"SalonsFonctionnalitésConfidentialité et sécuritéFacebook For Developers; Avec les salons Messenger, c’est une nouvelle façon de discuter en vidéo qui s’offre à vous et à vos proches.Créer un salonPartagez un lien et le tour est joué.Vous voulez créer et partager un salon ? C’est simple : il vous suffit d’envoyer un lien. Vous pouvez en démarrer un directement dans Messenger ou depuis Facebook, Instagram, WhatsApp et les appareils Portal.Rejoignez un salonsans compte.Rejoignez un salon sans compte.Rejoignez un salon ouvert via un lien, même si vous n’avez pas de compte Facebook.Participation instantanée.Si un salon vous intéresse, faites-y un détour. Vous pouvez le rejoindre directement à partir de Messenger, du fil d’actualité, des évènements et des groupes Facebook.Participation instantanée.Si un salon vous intéresse, faites-y un détour. Vous pouvez le rejoindre directement à partir de Messenger, du fil d’actualité, des évènements et des groupes Facebook.Plus on est de fous, plus on rit.Plus on est de fous, plus on rit.Invitez jusqu’à 50 personnes dans votre salon. Et pour les grands rassemblements, testez l’application de bureau afin de voir plus de monde en même temps.À votre image.Personnalisez votre discussion grâce à des filtres de caméra, des éclairages d’ambiance, des évènements thématiques et des arrière-plans à 360°.Prenez votre temps.Un vrai bon moment, ça se savoure. Avec les salons Messenger, discutez avec qui vous voulez, aussi longtemps que vous le souhaitez. Gratuitement.Contrôle totalsur votre salon.Contrôle total sur votre salon.Les salons vous offrent toutes les commandes dont vous avez besoin pour gérer votre expérience.Tout votre univers. Depuis vos applications favorites.Créez des salons depuis Messenger, Facebook, WhatsApp, Instagram et les appareils Portal. Et rejoignez-les de n’importe où.Ressources supplémentairesConseils pour vous protégerConfidentialité des salons © Facebook 2021.  Les logos Apple et Google Play sont des marques déposées appartenant à leurs titulaires respectifs. Politique d’utilisation des données Conditions généralesFrançais (France)Deutsch‎English (US)‎English (UK)‎Español (España)‎Español‎Français (France)‎Italiano‎Polski‎Português (Brasil)‎Português (Portugal)‎ภาษาไทย‎Tiếng Việt‎Prochainement ! Envoyez des messages à vos amis Instagram directement depuis Messenger. En savoir plus.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"