"\n\n\n\n\n\n\n\nWikipedia:Requests for permissions\n\nFrom Wikipedia, the free encyclopedia\n\n\n\nJump to navigation\nJump to search\nRequest page for admins to grant user rights\n\"WP:PERM\" redirects here. You may be looking for Wikipedia:Requesting copyright permission or Help:Permanent link.Administrator instructions\n\n\nvteNoticeboardsWikipedia's centralized discussion, request, and help venues. For a listing of ongoing discussions and current requests, see the dashboard.General\nAdministrators\nmain\nincidents\nBots\nBureaucrats\nCentralized discussion\nClosure requests\nEducation\nInterface admins\nMain Page errors\nOpen proxies\nOTRS\nOversight\nUser permissions\nArticles and content\nBiographies of living persons\nCopyrights\nquestions on media\nproblems\nDispute resolution\nExternal links\nFringe theories\nNeutral point of view\nOriginal research\nReliable sources\nResource requests\nSpam\nblacklist\nwhitelist\nScalable vector graphics\nTitleblacklist\nTranslation\nPage handling\nHistory merges\nMergers\nSplits\nMoves\nProtection\nImportation\nXfD\nArticles\nRedirects\nCategories\nTemplates\nFiles\nMiscellany\nUndeletion\nUser conduct\nConflict of interest\nContributor copyright\nEdit warring and 3RR\nSanctions\nPersonal restrictions\nGeneral sanctions\nSockpuppets\nUsernames\nVandalism\nOther\nArbitration\nCommittee noticeboard\nrequests\nenforcement\nEdit filters\nrequested\nfalse positives\nQuestions\nEditor assistance\nHelp desk\nTeahouse\nReference desk\nNew articles\nRequests for comment\nVillage pump\npolicy\ntechnical\nproposals\nidea lab\nWMF\nmiscellaneous\nWikiProject proposals\n Category:Wikipedia noticeboards\nSkip to TOC\nSkip to bottom\n\n\n\nRequests for permissions\n\n\n\nShortcutsWP:PERMWP:RFRWP:RFPERM\nThis page enables administrators to handle requests for permissions on the English Wikipedia. Administrators are able to modify account creator, autopatrolled, confirmed, file mover, extended confirmed, mass message sender, new page reviewer, page mover, pending changes reviewer, rollback, template editor rights and AutoWikiBrowser access.\nEditors wishing to request a permission flag here should do so following the procedure below.  Editors requesting permissions are advised to periodically revisit the requests page, as notifications will not always be given after a decision is made.  Editors should not expect their request to be answered right away and should remember to be patient when filing a request.  To find out what permissions your account has, go to Special:Preferences, where your permissions are listed in the user profile tab under \"Member of groups\".\nRequests for permissions are archived regularly; please see Wikipedia:Requests for permissions/Archive for an index of past requests.\n\n\nIf this page has been recently modified, it may not reflect the most recent changes.Please purge this page to view the most recent changes.\nBot report: No errors! Report generated at 15:40, 11 May 2021 (UTC)\nContents\n\n1 Permissions\n\n1.1 Handled here\n\n1.1.1 User groups\n\n\n1.2 Handled elsewhere\n\n\n2 Removal of permissions\n3 Process\n\n3.1 Requestors\n3.2 Administrators\n\n\n4 Current requests\n\n4.1 Account creator\n4.2 Autopatrolled\n\n4.2.1 User:LightandDark2000\n4.2.2 User:Hatchens\n4.2.3 User:Needforname\n4.2.4 User:Ezlev\n4.2.5 User:Bwrs\n4.2.6 User:EDG 543\n4.2.7 User:Skvader\n4.2.8 User:KidAd\n4.2.9 User:Aliaboomar\n4.2.10 User:LowercaseGuy\n4.2.11 User:Ashleyyoursmile\n\n\n4.3 AutoWikiBrowser\n\n4.3.1 User:Deeday-UK\n4.3.2 User:Jamesluiz102\n4.3.3 User:-Zai-\n4.3.4 User:ACB Smith\n4.3.5 User:NonsensicalSystem\n4.3.6 User:Mathglot\n\n\n4.4 Confirmed\n\n4.4.1 User:Communicationsgfmd\n4.4.2 User:UHasanova\n4.4.3 User:Bendiwan\n\n\n4.5 Event coordinator\n4.6 Extended confirmed\n\n4.6.1 User:Golollop\n\n\n4.7 File mover\n4.8 Mass message sender\n\n4.8.1 User:FULBERT\n\n\n4.9 New page reviewer\n\n4.9.1 User:HeinzMaster\n4.9.2 User:Fade258\n4.9.3 User:Aliaboomar\n4.9.4 User:Dswitz10734\n\n\n4.10 Page mover\n\n4.10.1 User:Elli\n4.10.2 User:FOARP\n4.10.3 User:Vpab15\n4.10.4 User:Eagleash\n4.10.5 User:Chicdat\n4.10.6 User:Vaticidalprophet\n4.10.7 User:Apd9696\n\n\n4.11 Pending changes reviewer\n\n4.11.1 User:Catalyzzt\n4.11.2 User:Nitesh003\n4.11.3 User:Kp2016rockin\n4.11.4 User:Churot\n4.11.5 User:Loafiewa\n4.11.6 User:Aliaboomar\n4.11.7 User:DFW FAA Brianvators\n4.11.8 User:Giraffedata\n4.11.9 User:Justus Nussbaum\n4.11.10 User:Morneo06\n\n\n4.12 Rollback\n\n4.12.1 User:Jogesh 69\n4.12.2 User:HurricaneCovid\n4.12.3 User:-Zai-\n4.12.4 User:A.A Prinon\n4.12.5 User:DFW FAA Brianvators\n4.12.6 User:Bsoyka\n4.12.7 User:NightWolf1223\n4.12.8 User:Blaze The Wolf\n4.12.9 User:Stickymatch\n4.12.10 User:Nakon\n4.12.11 User:KyloRen3\n4.12.12 User:Pupsterlove02\n\n\n4.13 Template editor\n\n\n\n\n\nPermissions\nHandled here\nUser groups\nAccount creator (add request • view requests): The account creator flag is granted to users who are active in the request an account process. The flag removes the limit on the maximum number of new accounts that can be created in a 24 hour period. It also allows users to make accounts with names similar to other accounts. The account creator flag is only given to users who participate in the ACC process and may be removed without notice should a user's participation in the account creation process cease.\nAutopatrolled (add request • view requests): The autopatrolled flag is granted to users who are active in the creation of new articles. This tool is granted so their creations are auto patrolled in Special:NewPages. Unlike other requests, any user may nominate an editor for Autopatrolled, even without that user's consent. A user who wishes to have this flag generally should have created at least 25 articles and must be trusted, experienced, and must have demonstrated they are familiar with Wikipedia's policies and guidelines, especially WP:BLP and Wikipedia:Notability.\nAutoWikiBrowser (add request • view requests): AutoWikiBrowser is a semi-automated MediaWiki editor for Microsoft Windows, designed to make tedious repetitive tasks quicker and easier. It is essentially a browser that automatically opens up a new page when the last is saved. When set to do so, it suggests some changes (typically formatting) that are generally meant to be incidental to the main change. Please read the quick guide on the main page before requesting permission. This is not a true user right, but access needs to be granted by administrators just like other permissions. If approved, your name will be added to the CheckPage. Users with under 250 non-automated mainspace edits or 500 total mainspace edits are rarely approved. You will need to give a reason for wanting AWB access.\nConfirmed (add request • view requests): The confirmed flag may be granted to new users who have not yet hit the threshold for autoconfirmed status. These are users who have not had both 10 edits and 4 days experience. People with this flag can  upload files and edit semi-protected pages before hitting the autoconfirmed flag. Users requesting this flag must indicate clearly why they should be exempted from the customary confirmation period.\nEvent coordinator (add request • view requests): The event coordinator user right allows editors to create multiple new accounts, and to temporarily confirm accounts so that they can create new articles.\nExtended confirmed (add request • view requests): The extended confirmed flag is normally automatically added to accounts after 500 edits and 30 days, but may be added to legitimate alternate accounts of users that already have this access. The flag allows users to edit pages under extended confirmed protection.\nFile mover (add request • view requests): The file mover user right is intended to allow users experienced in working with files to rename them, subject to policy, with the ease that autoconfirmed users already enjoy when renaming Wikipedia articles.\nMass message sender (add request • view requests): Mass message sender enables users to send messages to multiple users at once. This flag is given to users who have made requests for delivery in the past, clearly showing an understanding of the guidance for use.\nNew page reviewer (add request • view requests): The new page reviewer user right allows users to mark pages as patrolled and use the page curation toolbar. At administrators' discretion, the right may be accorded on a time limited basis or indefinite.\nPage mover (add request • view requests): The page mover user right allows users experienced in working with article names to move them, subject to policy, without leaving behind a redirect. They may also move all subpages when moving the parent page(s). General guidelines include making 3,000 edits and 6 months of editing history. At administrators' discretion, the right may be accorded on a time limited basis or indefinite.\nPending changes reviewer (add request • view requests): The reviewer flag is granted to users who are experienced enough with Wikipedia editing and its policies for contributing to the process of reviewing articles placed under pending changes.\nRollback (add request • view requests): Rollback enables users to remove vandalism much more quickly and efficiently than by undoing it. Users who do not demonstrate an understanding of what constitutes capable vandalism fighting, either because they have no or little history of doing so, or show a poor ability to discern between good and bad faith edits will not be granted this right. Also, it is unlikely that editors with under 200 mainspace edits will have their request granted. For a more detailed explanation of rollback and information about when it is appropriate to use the tool, see Wikipedia:Rollback. For information about the technical details of the feature, see here.\nTemplate editor (add request • view requests): The template editor flag allows users to edit protected templates and Lua modules. General guidelines for granting include making at least 1,000 edits overall (with at least 150 to templates or modules), being a registered user for over a year, and having a record of successfully proposing significant edits to several protected templates. Users should demonstrate proficiency with template syntax and an understanding of the need for caution when editing heavily-used templates.\nHandled elsewhere\nSeveral permissions are requested and handled elsewhere:\n\nAdministrator and bureaucrat access: Requests for administrator or bureaucrat access need to be posted at requests for adminship and requests for bureaucratship, respectively.\nBots: Request for bot flags should be made at Wikipedia:Bots/Requests for approval.\nEdit filter: Requests for access to the edit filter manager group and the edit filter helper group should be made at Wikipedia:Edit filter noticeboard.\nInterface administrator: Requests for interface administrator access should be made at Wikipedia:Bureaucrats' noticeboard. Only current administrators may become interface administrators.\nIP-block-exempt: While the IP-block-exempt right can be granted by administrators, this flag is not handled here. Requests for the IP-block exempt right should be submitted via the Unblock Ticket Request System or, if there are significant privacy concerns, email the checkuser team at checkuser-en-wpwikipedia.org or contact a CheckUser directly.\nCheckuser and Oversight: These rights are only granted by the Arbitration Committee, and only after strict scrutiny. More information can be found here.\nAfC reviewer: This access is granted by administrators at Wikipedia talk:WikiProject Articles for creation/Participants.\nRedirect patrol whitelist: Addition to the whitelist is granted by administrators at Wikipedia talk:New pages patrol/Redirect whitelist.\nSteward permissions can only be granted in yearly elections, and are rarely given.\nGlobal permissions such as global renamer, sysop, IP block exempt, rollback, etc should be made at meta:Steward requests/Global permissions.\nRemoval of permissions\nIf you wish to have any of your permission flags (except administrator) removed, you should contact an administrator. If you want your administrator flag removed, you should contact a bureaucrat.\nThis is not the place to request review of another user's rights. If you believe someone's actions merit removal of a permission flag, you should raise your concern at the incidents noticeboard. \nThe bureaucrat, checkuser, and oversight flags are removed at meta:Steward requests/Permissions. Stewards will typically not carry out such requests unless they are made on behalf of the Arbitration Committee, by a user who is requesting their own access be removed, or in cases of an emergency.\n\nProcess\nRequestors\nTo make a request for a permission, click \"add request\" next to the appropriate header and fill in the reason for wanting permission.\nAny editor may comment on requests for permission.\n\nAdministrators\nFull instructions at Wikipedia:Requests for permissions/Administrator instructions\nAdministrators are permitted to grant account creator, autopatrolled, confirmed, event coordinator, file mover, mass message sender, page mover, pending changes reviewer, rollback and template editor flags to any user who meets the criteria explained above and can be trusted not to abuse the tool(s). Administrators may either grant these permissions permanently or temporarily. For convenience, a bot will automatically comment with relevant data if the user does not meet configurable qualifications. Even if the bot does not comment, administrators should review the user's contributions and logs to ensure the tools will be used appropriately and check for any indication of potential misuse.\nOnce an administrator has granted a permission or decided to deny a request, they should add {{done}} or {{not done}} respectively under the request with their comments. If a user already has the requested permission, or is autoconfirmed and requesting confirmed, {{already done}} should be used. N hours after the last comment was made (as specified by the config), the request will be archived automatically: approved requests will be placed here; declined requests will go here. See User:MusikBot/PermClerk#Archiving for more information on archiving functionality.\n\n\nCurrent requests\nAccount creator\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\n\nAutopatrolled\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nUser:LightandDark2000\nLightandDark2000 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nLightandDark2000 has created around 49 articles, and he had created four articles in this year (and will likely going to go up). While 13 of these articles are deleted, it shouldn't be too much of a concern as these are recreated by other editors. MarioJump83! 14:26, 5 April 2021 (UTC)\nRegarding my stats, I consider my self to have authored or co-authored 30 full articles. Most of the deleted pages were redirects; those were deleted because either the main page (the redirect target) go deleted or because a later RfD on a group of redirects saw a consensus that axed some of them. I create a lot of redirects as an editor, but I've been starting more articles recently. And I plan to make more articles in the near future (I have at least 4 planned out). None of my articles were ever deleted for notability or Copyvio issues, and none of my recent article creations had any serious issues, either. LightandDark2000 🌀 (talk) 15:56, 5 April 2021 (UTC)\n Done (finally) Beeblebrox (talk) 23:06, 9 May 2021 (UTC)\nUser:Hatchens\nHatchens (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nHi, I'm Hatchens. Resubmiting my request for Autopatroll rights (Earlier, my request was denied because of falling short in numbers). I'm working on NRHP entities and creating stub/start articles. Most of the time, I submit drafts for AfC review. And, I intend to maintain a balance between AfC reviewing and autopatrolled articles. - Hatchens (talk) 05:05, 6 April 2021 (UTC)\nOne thing Im sure about Hatchens is that they have very well knowledge about our notability guidelines and also has plenty of experience at AFC. They have helped me in several situations. Regards. Kichu🐘 Need any help? 07:11, 11 April 2021 (UTC)\nOh wow! Hatchens is an amazing volunteer at the AfC. Should be having the autopatrolled flag. Definitely. ─ The Aafī on Mobile (talk) 10:07, 11 April 2021 (UTC)\nHey Kashmorwiki and TheAafi, Thank you for backing me up on my request. It's an honor. However, as I always say, any decision should be taken without any biases and without being influenced. If my edit history holds any merit, then I would be qualified for autopatrol rights. If not, then you guys are with me to build new articles, so that I can qualify for it next time. :-). Thank you once again to both of you for such a nice gesture. -Hatchens (talk) 11:16, 11 April 2021 (UTC)\n@Hatchens: Of course I'm supporting you to get this right. MarioJump83! 06:07, 14 April 2021 (UTC)\n@Hatchens Support also from my site.  CommanderWaterford (talk) 11:23, 6 May 2021 (UTC)\n Done Beeblebrox (talk) 23:13, 9 May 2021 (UTC)\nUser:Needforname\nNeedforname (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nFrom long-time actively participated and contributed in Wikipedia articles. Time to get more responsibility which helps to get good articles for readers. So many good articles remained pending for review from long time. This article are not availble for readers due shortage of reviewers and patrollers and time to get New one. I obey and follow the wiki guidelines  carefully everytime. Needforname (talk) 14:09, 12 April 2021 (UTC)\n Automated comment This user has created roughly 19 articles. — MusikBot talk 10:20, 15 April 2021 (UTC)\n Not done You are under the 25 article limit, but more importantly than that, your command of the English language is simply not sufficient to grant this request. To be honest, I can't even make sense of your request, it's not at all clear if you even know what it is you are applying for. Your article writing seems to be a bit better but has the same issues, meaning your creations would clealry benefit from being reviewed by others.   Beeblebrox (talk) 23:18, 9 May 2021 (UTC)\nUser:Ezlev\nEzlev (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've created 30 articles on the English Wikipedia, including six translations from Spanish and one listicle. None have been deleted, and I believe that I create clean articles and have a good understanding of Wikipedia policies. I have no issue with having articles I create go through the NPP process, but I've experienced big backlogs firsthand at AfC review, and my understanding is that NPP can get similarly backed up. That's why I'm requesting the Autopatrolled right, but I'll have no hard feelings about a decline. Thanks! ezlevtlkctrbs 00:59, 19 April 2021 (UTC)\n Not done This was not an easy decision. You've created quite a few interesting articles on a variety of subjects, and generally they are well put-together. However, I was able to find enough fairly recent issues with providing appropriate sourcing that I think your articles would still benefit from review by others.  Beeblebrox (talk) 23:25, 9 May 2021 (UTC)\nUser:Bwrs\nBwrs (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI frequently create redirects.  Don't want to put others through the trouble of patrolling them. Bwrs (talk) 16:33, 26 April 2021 (UTC)\n Not done This user right is really for people creating lots of articles. You are sometimes creating dab pages and redirects. There's nothing wrong with that, at all, but I don't see a real need for this user right here.  Beeblebrox (talk) 23:28, 9 May 2021 (UTC)\nUser:EDG 543\nEDG 543 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI have created 47 articles, with recent ones including Killing of Daunte Wright and 2021 Suez Canal obstruction, and 70 redirects. I'm fairly cautious with creating articles and think that I have a good enough track record to be able to have my articles autoreviewed, alleviating the burden on the reviewers. Thanks,  EDG 543 (message me) 16:13, 30 April 2021 (UTC)\n Done Beeblebrox (talk) 23:35, 9 May 2021 (UTC)\nUser:Skvader\nSkvader (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've created 110 articles over the past nine years, none have been deleted. Hoping to save some time for overworked admins. Skvader (talk) 01:03, 1 May 2021 (UTC)\n Done Beeblebrox (talk) 23:39, 9 May 2021 (UTC)\nUser:KidAd\nKidAd (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nHello, I'm KidAd, and I'm requesting the WP:APAT user right at the request/suggestion of Celestina007. I have been editing since December 2017 and have created 683 pages as of this submission. 34 of these pages have been deleted, though 10 have been re-created since. I am happy with and proud of my track record. I mostly edit within the subject area of American politics and specialize in state legislators. I have found that, unfortunately, many members of state houses and senates around the United States do not have pages. I should also note that a significant portion of these are women and/or BIPOC. I have made it a habit to create these pages semi-rapidly, and understand that this can create an unnecessary workload for page reviewers. Thank you. KidAd • SPEAK 01:48, 6 May 2021 (UTC)\nComment — They are one of the most prolific article creators who create clean articles (probably a dozen a day) that I have encountered thus far & can vouch that their knowledge on policy pertaining notability is pretty much decent. Giving them autopatral right would definitely be assisting new page reviewers reduce our workload. Celestina007 (talk) 02:42, 6 May 2021 (UTC)\n Done Beeblebrox (talk) 23:41, 9 May 2021 (UTC)\nUser:Aliaboomar\nAliaboomar (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI have experience with Wikipedia I think I qualify. Aliaboomar (talk) 08:41, 7 May 2021 (UTC)\n Not done Your stubs are extremely short and yet there’s a lot of tidy up needed including fundamental things like grammar, spelling, setting DEFAULTSORT. You need to get these things 100% for such short stubs before anybody will grant you autopatrolled. Schwede66 15:45, 7 May 2021 (UTC)\n\nHi @Schwede66: Done, can you check my articles again, please\nthanks a lot Aliaboomar (talk) 23:23, 8 May 2021 (UTC)\n\n Not done I refer you to this sentence in a recent deletion discussion about one of your articles from four days ago: \"Keep. He’s a member of the Turkish parliament so passes WP:NPOL, though the article is so poorly written it doesn’t actually say so (the tr.wiki article does).\" Looking at that article today, I see words randomly capitalised, sentences starting with lower case, poor grammar (missing words), missing wikilinks, and missing categories. What I said before stands: You need to get these things 100% for such short stubs before anybody will grant you autopatrolled. Schwede66 01:23, 10 May 2021 (UTC)\nUser:LowercaseGuy\nLowercaseGuy (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nLowercaseGuy has created over 25 articles, and the volume of these creations isn't going down. I acknowledge that the earlier creations has some problems, but recent creations didn't have this problem. MarioJump83! 03:04, 8 May 2021 (UTC)\nConsidering this, I created 26 articles in mainspace, although my first article (Cyclone Rachel) was redirected to 1996-97 Australian region cyclone season, due to the lack of notability of the storm. In fact, I'm preparing myself to make more articles here in wiki (primarily Tropical cyclones), that's why I'm on semi-wikibreak. None of my articles were ever deleted due to copy-vio issues, although I had an article in which there has a copyright issue (now resolved). LowercaseGuy chow! 08:26, 8 May 2021 (UTC)\n Done Beeblebrox (talk) 23:44, 9 May 2021 (UTC)\nUser:Ashleyyoursmile\nAshleyyoursmile (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI would like to request this permission so that my articles are no longer present in the new pages queue. I have created one GA class article- The Fate of Fausto, one B-class Birdsong, and several C-class and start-class articles, and have taken some of these through DYK. (This was a redirect created by me while moving it to draftspace, it has since been moved to mainspace and still does not cite any sources.) In addition, I have significantly written several GAs and a few FLs. I believe my contributions (including my AfD stats) demonstrate sufficient understanding of guidelines and policies, and as a NPP reviewer I don't want to add my future articles to the already long backlog. Thank you. Ashleyyoursmile! 11:47, 9 May 2021 (UTC)\n Done Beeblebrox (talk) 23:47, 9 May 2021 (UTC)\n\nAutoWikiBrowser\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\n\n\nUser:Deeday-UK\nDeeday-UK (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI intend to replace the current navbox template in railway accident articles with the new template {{Railway accidents and incidents}}, per discussion at WikiProject Trains. --Deeday-UK (talk) 08:47, 30 April 2021 (UTC) Deeday-UK (talk) 08:47, 30 April 2021 (UTC)\nDeeday-UK, wouldn't it just make sense to redirect (for example) Template:2010 railway accidents to Template:Railway accidents and incidents in 2010? Then you wouldn't need to replace them all. Primefac (talk) 13:23, 30 April 2021 (UTC)\nHmm... yeah, I suppose that would work just as well. --Deeday-UK (talk) 17:33, 30 April 2021 (UTC)\n Not done (for the bot), no longer needed. Primefac (talk) 14:57, 10 May 2021 (UTC)\nUser:Jamesluiz102\nJamesluiz102 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nHello, I require the use of AutoWikiBrowser in order to fix the reference errors and typos. -Jamesluiz102- (talk) (contribs) 13:45, 1 May 2021 (UTC)\n Automated comment This user has approximately 269 non-automated edits in the mainspace. — MusikBot talk 10:40, 9 May 2021 (UTC)\n Done. Primefac (talk) 14:57, 10 May 2021 (UTC)\nUser:-Zai-\n-Zai- (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've been actively editing for about a month now, and have been fighting a lot of vandalism and have reported a lot of sockpuppetry. I can fight vandalism using Twinkle and RedWarn, and would like to use more tools. Zai (💬 • 📝 • ⚡️) 18:20, 4 May 2021 (UTC)\n Automated comment This user has approximately 366 non-automated edits in the mainspace. — MusikBot talk 12:50, 10 May 2021 (UTC)\n Not done, AWB is not for fighting vandalism. Primefac (talk) 14:57, 10 May 2021 (UTC)\nUser:ACB Smith\nACB Smith (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI'm developing a template for an external link to Standard Ebooks, and will need to replace some variable names to add functionality. Smith(talk) 09:14, 5 May 2021 (UTC)\n Done, but please be careful. Primefac (talk) 14:57, 10 May 2021 (UTC)\nUser:NonsensicalSystem\nNonsensicalSystem (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI would like to use AWB to correct references, typos and to help wikilink text to new orphaned articles NonsensicalSystem(error?)(.log) 20:03, 8 May 2021 (UTC)\n Automated comment This user has approximately 238 non-automated edits in the mainspace. — MusikBot talk 11:00, 10 May 2021 (UTC)\n Done. Primefac (talk) 14:57, 10 May 2021 (UTC)\nUser:Mathglot\nMathglot (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nTo facilitate proper subcategorization of articles generated by daughter templates of {{Expand language}} with missing or incorrect |topic= parameter. Take {{Expand French}} as an example. This template categorizes articles by default into Category:Articles needing translation from French Wikipedia, which currently contains ~4,000 articles and 14 subcats  (see the /doc). Use of the parameter where appropriate (|topic=geo, |topic=cult, etc.) will move these articles to one of the subcats instead, relieving the pressure on the parent category, and placing these articles in the proper subcat. For example, use of 'geo' will place them in Category:Geography articles needing translation from French Wikipedia. I started on this already, but it's tedious and highly repetitive, involving addition of topic params to existing {{Expand French}} templates. (And then there's 'Expand Spanish', and dozens of other daughter-language templates of 'Expand language'.) Thanks. Mathglot (talk) 19:58, 9 May 2021 (UTC)\n Done. Primefac (talk) 14:57, 10 May 2021 (UTC)\n\n\n\nConfirmed\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nUser:Communicationsgfmd\nCommunicationsgfmd (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nWe are the Global Forum for Media Development – an international network of around 200 journalism support and media development organisations working across more than 70 countries. We really want to have our own Wikipedia page as we are often mentioned in Wikipedia articles and it might help us to spread a word about our work. Our communications manager has registered more than 4 days ago and edited various articles more than 10 times, however out account is still not autoconfirmed. Could you please help us speed up the process? Communicationsgfmd (talk) 11:07, 10 May 2021 (UTC)\n Automated comment An extraneous header or other inappropriate text was removed from this request — MusikBot talk 11:10, 10 May 2021 (UTC)\n Already done (automated response): This user  already has the \"autoconfirmed\" user right. — MusikBot talk 13:00, 10 May 2021 (UTC)\nUser:UHasanova\nUHasanova (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nUHasanova (talk) 11:35, 10 May 2021 (UTC)\n Automated comment An extraneous header or other inappropriate text was removed from this request — MusikBot talk 11:40, 10 May 2021 (UTC)\n Already done (automated response): This user  already has the \"autoconfirmed\" user right. — MusikBot talk 21:00, 10 May 2021 (UTC)\nUser:Bendiwan\nBendiwan (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nHello, I've been hired by Zack Rinat founder and CEO of Netdynamics applications server and Model N to edit pages on his behalf, as well as write his personal page. I am asking to be confirmed so I can do the necessary edits. thank you. Bendiwan (talk) 22:49, 10 May 2021 (UTC)\n Not done Please read and comply with WP:PAID before you do anything else on Wikipedia.  Beeblebrox (talk) 00:52, 11 May 2021 (UTC)\n\nEvent coordinator\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\n\nExtended confirmed\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nUser:Golollop\nGolollop (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI would like to request extendedconfirmed rights for Golollop, which I created pursuant to WP:PUBSOCK. Thank you. – Sdrqaz (talk) 13:37, 11 May 2021 (UTC)\n\nFile mover\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\n\nMass message sender\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nUser:FULBERT\nFULBERT (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI am the Secretary of the Affiliations Committee and we are preparing for the first of our new member elections of 2021. We need to post announcements to all Affiliates about this election and invite interested parties to consider serving on AffCom. There are other needs that arise for communicating across all Affiliates, and we need the internal capacity to do this. Thank you. FULBERT (talk) 17:47, 8 May 2021 (UTC)\n\n\n\nNew page reviewer\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nUser:HeinzMaster\nHeinzMaster (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI have experience in the AfC, AfD, and have read through the notability reviewing guidelines and feel like I have demonstrated understanding of them by creating 103 articles, off which none were nominated for deletion. I have been making considerable number of edits on Wikipedia for almost a year now, so I hope to take a larger role within it. All the best, cheers. HeinzMaster (talk) 16:03, 3 May 2021 (UTC)\n Done for 1 month as a trial run, afterwhich you may reapply.  signed, Rosguill talk 18:39, 10 May 2021 (UTC)\nUser:Fade258\nFade258 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nHello Wikipedia Administrator ! I have been in Wikipedia since September 2019 and I had done many edits on wikipedia to improve articles with that I want some additional righs to make Wikipedia articles more accurate and perfect content.So, I request to you to grant me this rights. I hope for positive response.Thank you ! (Fade258 (talk) 09:05, 6 May 2021 (UTC))\n Automated comment This user has had 1 request for new page reviewer declined in the past 90 days ([1]). — MusikBot talk 09:40, 6 May 2021 (UTC)\nYou do not need this user right in order to make Wikipedia articles more accurate. I also see no acknowledgement of my prior concern regarding English writing proficiency nor evidence that these concerns are moot, and thus will be declining this request.  Not done signed, Rosguill talk 18:45, 10 May 2021 (UTC)\nUser:Aliaboomar\nAliaboomar (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI have an experience with creating articles and have created 27 articles Aliaboomar (talk) 13:13, 8 May 2021 (UTC)\n Automated comment This user has 123 edits in the mainspace. — MusikBot talk 13:20, 8 May 2021 (UTC)\n Not done. Please see the notice at the top of this page. With only 123 mainspace edits, you don't meet the minimum requirements for granting. Please come back when you have the experience required for administrators to review your edits. — JJMC89 (T·C) 18:12, 9 May 2021 (UTC)\nUser:Dswitz10734\nDswitz10734 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nDswitz10734 (talk) 13:40, 11 May 2021 (UTC)\nHi! I'm Dswitz10734, an extended confirmed editor here. I've wanted to become a reviewer for a while now, so I decided to put in a request. I have 430 mainspace edits to a variety of different topics. I want to become a reviewer because I want to help develop new pages so they can help give free information to the everyone. I've started a few pages here, such as Thrawn: Alliances and Star Wars Battlefront II: Inferno Squad. I would appreciate a month-long trial period to get used to this role. Thank you for your time and I hope to hear from you soon! Dswitz10734 (talk) 13:40, 11 May 2021 (UTC)\n\n Automated comment An extraneous header or other inappropriate text was removed from this request — MusikBot talk 13:50, 11 May 2021 (UTC)\n Automated comment This user has 430 edits in the mainspace. — MusikBot talk 13:50, 11 May 2021 (UTC)\n\nPage mover\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nUser:Elli\nElli (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've had the right for two months now (granted by Primefac, and it expires in a month, so I'd like it extended permanently. In the past two months, I've used the right to perform round-robin moves and move pages along with subpages. The only move-related controversy I got involved with was this mess (which didn't involve me using this permission, nor do I think was particularly problematic conduct on my end). Elli (talk | contribs) 13:52, 12 April 2021 (UTC)\n Automated comment This user was granted temporary page mover rights by Primefac (expires 00:00, 11 May 2021 (UTC)). — MusikBot talk 14:00, 12 April 2021 (UTC)\n Done Extended indefinitely. –xenotalk 00:06, 28 April 2021 (UTC)\nUser:FOARP\nFOARP (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nWant to be able to move over redirects. I've been carrying out RM closes for a while now without controversy. FOARP (talk) 10:45, 28 April 2021 (UTC)\nAs an example of the kind of RM discussions I'd like to be able to close - Talk:Evgeniya_Kanayeva#Requested_move_28_April_2021. FOARP (talk) 08:54, 9 May 2021 (UTC)\nUser:Vpab15\nVpab15 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nThis permission will allow me to complete the closure of RMs that I now need to request at Wikipedia:Requested moves/Technical requests. Vpab15 (talk) 18:22, 29 April 2021 (UTC)\nUser:Eagleash\nEagleash (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI have 76,000+ edits and created approximately 80 articles. As both NP Patroller and AfC reviewer I would like the permission so that I can move reasonable drafts out of sandboxes to the 'preferred location'. At the moment, I quite often receive messages and/or credit/blame for items I have not created. When moving a sandbox draft a redirect is left which the 'owner' of the userpage overwrites with a new item but I am 'shown' as the first editor of the page. It would also be useful when moving new pages out of mainspace into draft which also creates a redirect which then has to be deleted by an Administrator. Thank you. Eagleash (talk) 20:32, 1 May 2021 (UTC)\n Automated comment An extraneous header or other inappropriate text was removed from this request — MusikBot talk 20:40, 1 May 2021 (UTC)\nUser:Chicdat\nChicdat (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nIn the past (about a year ago) I had the page mover right. Several months ago, I began a adopting program. My adopter, MarioJump83, recommended that I get that rollback/page mover back. I am requesting this right as part of the adopting. 🐔 Chicdat  Bawk to me! 11:35, 2 May 2021 (UTC)\n@L235: as revoking admin. You should probably address why the rights were revoked to begin with if you want them re-instated. Beeblebrox (talk) 19:48, 2 May 2021 (UTC)\nI made some very unwise suppressredirect page moves. L235 emphasized my move of Tropical Depression Ambo (2020) to Tropical Storm Ambo (2020) which, in L235's words, wasn't even close to a suppressable redirect. The straw that broke the camel's back was violating WP:EWLO to vandalize Egg drop syndrome. I would never do any of that again, and if I am granted the right, I will carefully review Wikipedia:Page mover before making any moves. 🐔 Chicdat  Bawk to me! 11:13, 3 May 2021 (UTC)\nUser:Vaticidalprophet\nVaticidalprophet (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI was granted temporary PMR by Anarchyte as a two-month trial in mid-March and am requesting extension. My move log show a number of unproblematic RM closes and RM/TR requests, as well as some reversion of pagemove vandalism. I have had one move in that period requested to be relisted by a party to the RM; I did so promptly and the discussion was re-closed a week later with an upholding of my original close. Vaticidalprophet 20:14, 2 May 2021 (UTC)\n Automated comment This user was granted temporary page mover rights by Anarchyte (expires 00:00, 14 May 2021 (UTC)). — MusikBot talk 20:20, 2 May 2021 (UTC)\nUser:Apd9696\nApd9696 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI would like to be able to move over redirects as I often would like to move pages for disambiguation purposes/move drafts into the mainspace but I am not able to do this as sometimes there are redirects in the way. In terms of experience, I don't have an immense amount of edits (coming up to 6,000) but I have been editing for a year now and have created quite a few pages and performed many page moves. APD (hmu) 17:33, 6 May 2021 (UTC)\n\n\n\nPending changes reviewer\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nUser:Catalyzzt\nCatalyzzt (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've had WP:ROLLBACK for a bit now, and I'd like to start making some more consequential and helpful edits, as well as reviewing pending changes. I'm fairly active, although I'm going to start editing a lot more in a couple weeks once the summer starts. I've done my research and I believe that I would make a great reviewer. Catalyzzt (talk) 15:04, 6 May 2021 (UTC)\nUser:Nitesh003\nNitesh003 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI'm very active on English Wikipedia and I'm familiar with wikipedia policy's on vandalism, Biographies of living persons, Neutral point of view, No original research, Verifiability and What Wikipedia is not. Like all of you, my first goal is to make Wikipedia, a more better place. Nitesh003 (talk) 03:40, 29 April 2021 (UTC)\nUser:Kp2016rockin\nKp2016rockin (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI'm requesting to become a pending changes reviewer because I want to help clearing out the backlog of pending changes when needed to. I've read Reviewing pending changes thoroughly. kpgamingz (rant me) 23:18, 1 May 2021 (UTC)\n Automated comment This user has had 1 request for pending changes reviewer declined in the past 90 days ([2]). — MusikBot talk 23:20, 1 May 2021 (UTC)\nUser:Churot\nChurot (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nThink I'm fairly active on Wikipedia. I have been WP:EXTENDEDCONFIRMED for a while now. I'm familiar with the policies and I think I can help. ☎️ Churot DancePop 11:51, 7 May 2021 (UTC)\n\nUser:Loafiewa\nLoafiewa (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've been editing WP for a fair while now, at least a couple hours each day, and I'm familiar with the policies on vandalism, NPOV, RS, and I'd like to be able to help out on the articles on my watchlist that have pending changes enabled. Loafiewa (talk) 13:59, 7 May 2021 (UTC) Loafiewa (talk) 13:59, 7 May 2021 (UTC)\nUser:Aliaboomar\nAliaboomar (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI have an experience with creating articles and have created 27 articles Aliaboomar (talk) 13:16, 8 May 2021 (UTC)\nUser:DFW FAA Brianvators\nDFW FAA Brianvators (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nHi, the reason why I am requesting a pending change reviewer because I’ve experienced Wikipedia for about 3 months now. However, I’ve read the policies and states that I can only accept edits that are constructive and have cited the sources. DFW FAA Brianvators (talk) 16:50, 9 May 2021 (UTC)\nUser:Giraffedata\nGiraffedata (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI would like to expand my maintenance work to include reviewing pending changes. Bryan Henderson (giraffedata) (talk) 02:15, 10 May 2021 (UTC)\nUser:Justus Nussbaum\nJustus Nussbaum (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI'm fairly active on English Wikipedia. And of course I'm familiar with the policies. Just N. (talk) 13:59, 10 May 2021 (UTC)\n\nUser:Morneo06\nMorneo06 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've had rollback for some time and I'm familiar with the important policies like biographies of living persons, Neutral point of view, No original research and What Wikipedia is not. I'm requesting pending changes reviewer because I want to help clearing the pending changes backlog. Morneo06 (talk) 09:20, 11 May 2021 (UTC)\n\nRollback\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nUser:Jogesh 69\nJogesh 69 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI am requesting for roll back because, I hate vandalism. Even I had done it when I was new and didn't knew much about Wikipedia policies, but it's ok now. I also wanted to join CVU but can't as the teacher had gone nowhere when it comes to teaching Jogesh 69 (talk) 21:27, 29 April 2021 (UTC)\nHello Jogesh 69, I appreciate that you hate vandalism and is ready to fight it. But do you have any past experience dealing with it? As of now, a quick look at your editing history does not give me the impression that you have any past experience fighting it. You need to show here, why you deserves the right. I hope you understood the point. Regards. Kichu🐘 Need any help? 18:35, 30 April 2021 (UTC)\n Automated comment This user has had 1 request for rollback declined in the past 90 days ([3]). — MusikBot talk 12:50, 1 May 2021 (UTC)\nUser:HurricaneCovid\nHurricaneCovid (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nOne month ago, I had a request declined for rollback [4] due to edit warring and Mz7 told me to request rollback again after one month with no edit warring. Now, it has been one month since the decline in which I have not edit warred, and so I am coming back to request again. I am requesting rollback because I have been reverting vandalism with RedWarn and Twinkle so far, but it's not very convenient since I have to click on a diff to revert vandalism. I would like an easier and faster way to revert vandals. I completely understand if you think one month wasn't enough time; I am happy to wait as long as you would like. Thank you. ~ 🌀HurricaneCovid🌀 14:30, 30 April 2021 (UTC)\n Automated comment This user has had 1 request for rollback declined in the past 90 days ([5]). — MusikBot talk 14:40, 30 April 2021 (UTC)\nFacepalm DXLB and LokiBlaster 16:00, 30 April 2021 (UTC)\n? ~ 🌀HurricaneCovid🌀 17:39, 30 April 2021 (UTC)\nDXLB Muzikant, please refrain from commenting on others' permissions requests unless you have something useful and constructive to add. GeneralNotability (talk) 19:08, 30 April 2021 (UTC)\nUser:-Zai-\n-Zai- (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've been actively editing for about a month now, and have been fighting a lot of vandalism and have reported a lot of sockpuppetry. I can rollback using Twinkle and RedWarn, but would like to use the rollback permission to use tools such as Huggle and igloo. Zai (💬 • 📝 • ⚡️) 21:41, 1 May 2021 (UTC)\n Automated comment This user has had 1 request for rollback declined in the past 90 days ([6]). — MusikBot talk 21:50, 1 May 2021 (UTC)\n Not done Rollback and blank undo summaries are only used in cases of obvious vandalism. There were multiple diffs in your contributions where you had undone something that didn't immediately look like obvious vandalism, like this, for example. In this situations, you need to provide a reason for your revert. There are also a few instances of you incorrectly undoing changes. This edit is entirely sourced; I haven't checked the validity of any claims nor the reliability of the sources, but this is not a situation where you blanketly revert. If it looks promotional (which it does, somewhat), you need to mention that. Similarly, this is neither a test edit or vandalism. I recommend getting some more experience and returning in a month or so. Anarchyte (talk • work) 12:35, 10 May 2021 (UTC)\nUser:A.A Prinon\nA.A Prinon (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI am requesting for rollbacker rights as it will be easier for me to revert vandalism. I think I meet all the criteria. I have more than 200 mainspace edits including 15 article creations. I am also a bit used to reverting vandal or inappropriate edits. And I have never been warned for edit warring or disruptive editing. Hope to get quick response from ToBeFree. — A.A Prinon  Conversation 11:57, 2 May 2021 (UTC)\nUser:DFW FAA Brianvators\nDFW FAA Brianvators (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI’m requesting it for a rollback is because I have used twinkle feature for a month now. I just wanted try out the full rollback features on Wikipedia. I can revert the edits that are non constructive at all, not providing a reliable sources, and obviously the bad faith edits. However, I must do my rollback job correctly otherwise my rollback rights will be revoked. DFW FAA Brianvators (talk) 05:14, 3 May 2021 (UTC)\n Automated comment An extraneous header or other inappropriate text was removed from this request — MusikBot talk 05:20, 3 May 2021 (UTC)\nUser:Bsoyka\nBsoyka (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI've been reverting vandalism (although a bit sporadically) for a while now using Twinkle and would like to be able to take care of it much faster using Huggle. I believe I'm fairly experienced as a Wikipedian and meet the requirements for this permission. Thank you for your time! Bsoyka🗣️ 04:23, 4 May 2021 (UTC)\nUser:NightWolf1223\nNightWolf1223 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI would like to get rollback and use it for Huggle. I already do a fair bit of counter vandalism with Twinkle. I fully understand the relevant policies. NW1223   | Howl at me  14:55, 5 May 2021 (UTC)\n Automated comment This user has had 1 request for rollback declined in the past 90 days ([7]). — MusikBot talk 15:00, 5 May 2021 (UTC)\nUser:Blaze The Wolf\nBlaze The Wolf (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI have been dealing with vandalism and while Twinkle's rollback works just fine, rollback rights are required for some more advanced anti-vandalism tools which I'm wanting to get into. Usually if I'm not completely sure on whether an edit is vandalism or not I ask people in the Discord or just leave it for someone else to deal with. Blaze The Wolf | Proud Furry and Wikipedia Editor (talk) 19:27, 6 May 2021 (UTC)\nUser:Stickymatch\nStickymatch (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI have been a pending changes reviewer for a while now; recently got back onto Wikipedia after an hiatus of a few months, and have continued working to revert vandalism.  I've been working against vandalism for a good bit, and the rollback permissions would enable me to do this with much greater efficiency. Stickymatch 23:42, 8 May 2021 (UTC)\nUser:Nakon\nNakon (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nResuming administrator duties after an extended break, re-learning rollback before advancing Nakon 05:55, 11 May 2021 (UTC)\nWelcome back! \n Done of course. ~ ToBeFree (talk) 06:50, 11 May 2021 (UTC)\nUser:KyloRen3\nKyloRen3 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nI sometimes patrol recent changes for vandalism and always keep an eye on vandalism for pages on my watchlist, often using Twinkle for the same. I believe that I can help fight vandalism even better with these user rights. KyloRen3 (talk) 10:59, 11 May 2021 (UTC) KyloRen3 (talk) 10:59, 11 May 2021 (UTC)\nUser:Pupsterlove02\nPupsterlove02 (t · c · del · cross-wiki · SUL · edit counter · pages created (xtools • sigma) · non-automated edits · BLP edits · undos · rollbacks · reviews · logs (blocks • rights • moves) · rfar · spi) (assign permissions)(acc · ap · fm · mms · npr · pm · pcr · rb · te)\nHi! I've been reverting vandalism on Wikipedia for a little under a year now (albeit with a 4-month wikibreak), and I recently completed WP:CVUA through Cassiopeia (see here). I'd like rollback rights to continue this effort, especially by using Huggle. Thanks in advance for your consideration! Pupsterlove02 talk • contribs 12:26, 11 May 2021 (UTC)\n\nTemplate editor\nSorry, please be aware that unregistered users cannot be granted permissions due to technical restrictions. Please create an account in order to request user account permissions.\n\n(add request • view requests)\n\nvteRequests for permissionsCommon\nAutopatrolled\nAutoWikiBrowser\nFile mover\nNew page reviewer\nPage mover\nPending changes reviewer\nRollback\nUncommon\nAccount creator\nConfirmed\nEvent coordinator\nExtended confirmed\nMass message sender\nTemplate editor\nLogs\nArchived requests\nApproved requests\nDenied requests\nSystem rights log\nSpecial\nAdministrator\nBureaucrat\nBot\nEdit filter helper\nEdit filter manager\nInterface administrator\n\nvteWikipedia accounts and governanceUnregistered (IP) users\nWhy create an account?\nCreate an account\nRequest an account\nIPs are human too\nIP addresses are not people\nIP hopper\nRegistered users\nNew account\nLogging in\nReset passwords\nUsername policy\nChanging username\nUsernames for administrator attention\nUnified login or SUL\nAlternate account\nAccount security\nPassword strength requirements\nUser account security\nPersonal security practices\nTwo-factor authentication\n2FA for AWB\nCommitted identity\nOn privacy, confidentiality and discretion\nCompromised accounts\nBlocks, bans, sanctions,global actions\nBlocking policy\nFAQ\nAdmins guide\nTools\nAutoblock\nAppealing a block\nGuide to appealing blocks\nUTRS Unblock Ticket Request System\nBlocking IP addresses\nRange blocks\nIPv6\nOpen proxies\nBanning policy\nArbCom appeals\nSanctions\nPersonal sanctions\nGeneral sanctions\nDiscretionary sanctions and Log\nEssay\nLong-term abuse\nStandard offer\nGlobal actions\nRelated to accounts\nSockpuppetry\nSingle-purpose account\nSleeper account\nVandalism-only account\nWikibreak\nEnforcer\nRetiring\nCourtesy vanishing\nClean start\nQuiet return\nUser groups and global user groups\nRequests for permissions\nAdmin instructions\nAdmin guide\nAccount creator\nPERM\n(Auto) confirmed\nPERM\nAutopatrolled\nPERM\nAutoWikiBrowser\nPERM\nBot\nRequest\nEdit filter helper\nRequest\nEvent coordinator\nPERM\nExtended confirmed\nPERM\nFile mover\nPERM\nIP block exempt\nRequest\nMass message sender\nPERM\nNew page reviewer\nPERM\nPage mover\nPERM\nPending changes reviewer\nPERM\nRollback\nPERM\nTemplate editor\nPERM\nGlobal rights policy\nOTRS Volunteer Response Team\nAdvanced user groups\nAdministrator\nRfA\nBureaucrat\nRfB\nCheckUser and Oversight\nRequest\nEdit filter manager\nRequest\nInterface administrator\nRequest\nFounder\nImporter\nResearcher\nCommittees and related\nArbitration Committee\nBot approvals group\nFunctionaries\nClerks\nSPI clerks\nArbCom clerks\nGovernance\nAdministration\nFAQ\nFormal organization\nEditorial oversight and control\nQuality control\nWikimedia Foundation\nBoard\nFounder's seat\nMeta-Wiki\nProposals\nWikiProjects\nElections\nPolicies and guidelines\nPetitions\nNoticeboards\nConsensus\nDispute resolution\nReforms\n\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Wikipedia:Requests_for_permissions&oldid=1011149008\"\nHidden categories: Project pages with short descriptionWikipedia extended-confirmed-protected pages\n\n\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nNot logged inTalkContributionsCreate accountLog in\n\n\n\n\n\nNamespaces\n\n\nProject pageTalk\n\n\n\n\n\nVariants\n\n\n\n\n\n\n\n\n\nViews\n\n\nReadView sourceView history\n\n\n\n\n\nMore\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\nContribute\n\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationWikidata item\n\n\n\n\nPrint/export\n\n\nDownload as PDFPrintable version\n\n\n\n\nIn other projects\n\n\nWikimedia CommonsMediaWikiMeta-WikiWikibooksWikidataWikimania\n\n\n\n\nLanguages\n\n\nAcèhАлтай тилالعربيةAsturianuAzərbaycancaবাংলাBân-lâm-gúБашҡортсаБеларускаяभोजपुरीEspañolفارسی한국어हिन्दीHrvatskiBahasa IndonesiaItalianoЛезгиLigureमैथिलीമലയാളംमराठीBahasa Melayuनेपाली日本語ଓଡ଼ିଆРусскийScotsShqipසිංහලSimple EnglishSlovenčinaSoomaaligaکوردیSrpskohrvatski / српскохрватскиТатарча/tatarçaไทยTürkçeاردوTiếng Việt吴语Yorùbá粵語中文\nEdit links\n\n\n\n\n\n\n This page was last edited on 9 March 2021, at 09:03 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n"