"Gehe zu:Bereiche dieser SeiteBedienhilfenFacebookE-Mail-Adresse oder HandynummerPasswortPasswort vergessen?Erstelle ein neues KontoEs geht schnell und einfach.JavaScript ist in deinem Browser deaktiviert.Bitte aktiviere JavaScript in deinem Browser oder installiere einen Browser, der JavaScript unterstützt, um dich für Facebook zu registrieren.Ein Fehler ist aufgetreten. Bitte versuche es noch einmal.Wir konnten dein Konto nicht erstellenWir konnten dich nicht bei Facebook registrieren.Geburtstag12345678910111213141516171819202122232425262728293031Jan.Feb.MärzApr.MaiJun.Jul.Aug.Sept.Okt.Nov.Dez.202120202019201820172016201520142013201220112010200920082007200620052004200320022001200019991998199719961995199419931992199119901989198819871986198519841983198219811980197919781977197619751974197319721971197019691968196719661965196419631962196119601959195819571956195519541953195219511950194919481947194619451944194319421941194019391938193719361935193419331932193119301929192819271926192519241923192219211920191919181917191619151914191319121911191019091908190719061905AlterGeburtsdatum verwendenGeschlechtWeiblichMännlichDiversWähle dein Pronomen aussie: „Wünsche ihr alles Gute zum Geburtstag!“er: „Wünsche ihm alles Gute zum Geburtstag!“er/sie: „Wünsche ihm/ihr alles Gute zum Geburtstag!“Dein Pronomen ist für alle sichtbar.Indem du auf „Registrieren“ klickst, stimmst du unseren Nutzungsbedingungen, unserer Datenrichtlinie und Cookie-Richtlinie zu. Facebook schickt dir eventuell Benachrichtigungen per SMS, die du jederzeit abbestellen kannst.RegistrierenSicherheits-CheckDies ist ein Pflichtfeld.Warum wird mir das angezeigt?Sicherheits-CheckDies ist ein Standard-Sicherheitstest, mit dem wir Spammer davon abhalten, automatisierte Anfragen zu senden.   ZurückRegistrierenErstelle eine Seite für einen Star, eine Band oder ein Unternehmen.DeutschFrançais (France)العربيةⵜⴰⵎⴰⵣⵉⵖⵜEnglish (UK)Español (España)ItalianoPortuguês (Brasil)हिन्दी中文(简体)日本語RegistrierenAnmeldenMessengerFacebook Lite Watch PersonenSeitenSeitenkategorienOrteSpieleStandorteMarketplaceFacebook PayGruppenJobsOculusPortalInstagramLokalesSpendenaktionenServicesWahl-InformationszentrumInfoWerbeanzeige erstellenSeite erstellenEntwicklerKarrierePrivatsphäreCookiesDatenschutzinfoNutzungsbedingungenHilfeEinstellungenAktivitätenprotokoll Facebook © 2021\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"