"\n\n\n\n\n\n\n\nWikipedia:Reliable sources\n\nFrom Wikipedia, the free encyclopedia\n\n\n\nJump to navigation\nJump to search\nContent guideline for determining the reliability of a source\n\"WP:Reliability\" and \"WP:RS\" redirect here. For the WikiProject, see Wikipedia:WikiProject Reliability. For other uses, see WP:RS (disambiguation).\nFor community input on the reliability of a source, see Wikipedia:Reliable sources/Noticeboard.\nFor a list of frequently discussed sources, see Wikipedia:Reliable sources/Perennial sources.\n\n\nThis page documents an English Wikipedia content guideline. It is a generally accepted standard that editors should attempt to follow, though it is best treated with common sense, and occasional exceptions may apply. Any substantive edit to this page should reflect consensus. When in doubt, discuss first on the talk page.ShortcutsWP:RSWP:RELYWP:RELIABLEWP:RELIABILITY\nThis page in a nutshell: Wikipedia requires inline citations for any material challenged or likely to be challenged, and for all quotations. If you are new to editing and instead just need a general overview of how sources work, please visit the referencing for beginners help page.\nWikipedia guidelines\nGuidelines list\nPolicies list\n\nBehavioral\n\nAssume good faith\nConflict of interest\nCourtesy vanishing\nDisruptive editing\nDon't bite the newcomers\nDon't edit to make a point\nEtiquette\nDon't game the system\nUser pages\nOther behavioral guidelines\nWMF friendly space policy\n\nDiscussions\nTalk page guidelines\nSignatures\n\n\nContent\nCiting sources\nExternal links\nReliable sources\nmedicine\nFringe theories\nNon-free content\nOffensive material\nDon't copy long texts\nDon't create hoaxes\nPatent nonsense\nOther content guidelines\n\nEditing\n\nArticle size\nBe bold\nEdit summary\nUnderstandability\nOther editing guidelines\n\nOrganization\nCategories, lists, templates\nCategorization\nDisambiguation\n\n\nStyle\nManual of Style\ncontents\nlists\ntables\n\nDeletion\nDeletion process\nSpeedy keep\nDeletion guidelines for administrators\n\nProject content\nProject pages\nWikiProjects\nTemplates\nUser pages\nUser boxes\nShortcuts\nSubpages\n\nOther\nNaming conventions\nNotability\nvte\nWikipedia articles should be based on reliable, published sources, making sure that all majority and significant minority views that have appeared in those sources are covered (see Wikipedia:Neutral point of view).  If no reliable sources can be found on a topic, Wikipedia should not have an article on it.\nThis guideline discusses the reliability of various types of sources. The policy on sourcing is Wikipedia:Verifiability, which requires inline citations for any material challenged or likely to be challenged, and for all quotations. The verifiability policy is strictly applied to all material in the mainspace—articles, lists, and sections of articles—without exception, and in particular to biographies of living persons, which states:\n\nContentious material about living persons (or, in some cases, recently deceased) that is unsourced or poorly sourced—whether the material is negative, positive, neutral, or just questionable—should be removed immediately and without waiting for discussion.\nIn the event of a contradiction between this guideline and our policies regarding sourcing and attribution, the policies take priority and editors should seek to resolve the discrepancy. Other policies relevant to sourcing are Wikipedia:No original research and Wikipedia:Biographies of living persons. For questions about the reliability of particular sources, see Wikipedia:Reliable sources/Noticeboard.\n\nContents\n\n1 Overview\n\n1.1 Definition of a source\n1.2 Definition of published\n1.3 Context matters\n1.4 Age matters\n\n\n2 Some types of sources\n\n2.1 Scholarship\n2.2 News organizations\n2.3 Vendor and e-commerce sources\n2.4 Biased or opinionated sources\n\n\n3 Questionable and self-published sources\n\n3.1 Questionable sources\n\n3.1.1 Sponsored content\n\n\n3.2 Self-published sources (online and paper)\n\n3.2.1 User-generated content\n\n\n3.3 Self-published and questionable sources as sources on themselves\n\n\n4 Reliability in specific contexts\n\n4.1 Biographies of living persons\n4.2 Primary, secondary, and tertiary sources\n4.3 Medical claims\n4.4 Quotations\n4.5 Academic consensus\n4.6 Usage by other sources\n4.7 Statements of opinion\n4.8 Breaking news\n4.9 Headlines\n\n\n5 Deprecated sources\n6 See also\n\n6.1 Templates\n6.2 Policies and guidelines\n6.3 Information pages\n6.4 Locating reliable sources\n6.5 Essays\n6.6 Other\n\n\n7 Notes\n8 References\n9 External links\n\n\nOverview\nFurther information: Wikipedia:Neutral point of view § Good research\nShortcutWP:REPUTABLE\n Source reliability falls on a spectrum:  highly reliable sources, clearly unreliable sources, and many in the middle.  Editors must use their judgment to draw the line between usable and unreliable sources.\nArticles should be based on reliable, independent, published sources with a reputation for fact-checking and accuracy. This means that we publish the opinions only of reliable authors, and not the opinions of Wikipedians who have read and interpreted primary source material for themselves. The following examples cover only some of the possible types of reliable sources and source reliability issues, and are not intended to be exhaustive. Proper sourcing always depends on context; common sense and editorial judgment are an indispensable part of the process.\n\nDefinition of a source\nFurther information: Wikipedia:Verifiability § Reliable sources\nShortcutWP:SOURCEDEF\nThe word \"source\" when citing sources on Wikipedia has three related meanings:\n\nThe piece of work itself (the article, book)\nThe creator of the work (the writer, journalist)\nThe publisher of the work (for example, Random House or Cambridge University Press)\nAny of the three can affect reliability. Reliable sources may be published materials with a reliable publication process, authors who are regarded as authoritative in relation to the subject, or both.  These qualifications should be demonstrable to other people.\n\nDefinition of published\n\"WP:PUBLISHED\" redirects here. It is not to be confused with Wikipedia:Published (WP:PUBLISH).\nShortcutWP:PUBLISHED\nThe term \"published\" is most commonly associated with text materials, either in traditional printed format or online; however, audio, video, and multimedia materials that have been recorded then broadcast, distributed, or archived by a reputable party may also meet the necessary criteria to be considered reliable sources. Like text, media must be produced by a reliable source and be properly cited. Additionally, an archived copy of the media must exist. It is convenient, but by no means necessary, for the archived copy to be accessible via the Internet.\n\nContext matters\nShortcutsWP:CONTEXTMATTERSWP:RSCONTEXT\nThe reliability of a source depends on context. Each source must be carefully weighed to judge whether it is reliable for the statement being made in the Wikipedia article and is an appropriate source for that content. In general, the more people engaged in checking facts, analyzing legal issues, and scrutinizing the writing, the more reliable the publication. Information provided in passing by an otherwise reliable source that is not related to the principal topics of the publication may not be reliable; editors should cite sources focused on the topic at hand where possible. Sources should directly support the information as it is presented in the Wikipedia article.\n\nAge matters\nShortcutsWP:AGE MATTERSWP:RS AGEWP:OLDSOURCES\nEspecially in scientific and academic fields, older sources may be inaccurate because new information has been brought to light, new theories proposed, or vocabulary changed.  In areas like politics or fashion, laws or trends may make older claims incorrect.  Be sure to check that older sources have not been superseded, especially if it is likely that new discoveries or developments have occurred in the last few years.  In particular, newer sources are generally preferred in medicine.\nSometimes sources are too new to use, such as with breaking news (where later reports might be more accurate), and primary sources which purport to debunk a long-standing consensus or introduce a new discovery (in which case awaiting studies that attempt to replicate the discovery might be a good idea, or reviews that validate the methods used to make the discovery).\nWith regard to historical events, older reports (closer to the event, but not too close such that they are prone to the errors of breaking news) tend to have the most detail, and are less likely to have errors introduced by repeated copying and summarizing.  However, newer secondary and tertiary sources may have done a better job of collecting more reports from primary sources and resolving conflicts, applying modern knowledge to correctly explain things that older sources could not have, or remaining free of bias that might affect sources written while any conflicts described were still active or strongly felt.\nSources of any age may be prone to recentism, and this needs to be balanced out by careful editing.\n\nSome types of sources\nShortcutWP:SOURCETYPES\nFurther information: Wikipedia:Verifiability § Reliable sources, and Wikipedia:Verifiability § Verifiability does not guarantee inclusion\nMany Wikipedia articles rely on scholarly material. When available, academic and peer-reviewed publications, scholarly monographs, and textbooks are usually the most reliable sources. However, some scholarly material may be outdated, in competition with alternative theories, or controversial within the relevant field. Try to cite current scholarly consensus when available, recognizing that this is often absent. Reliable non-academic sources may also be used in articles about scholarly issues, particularly material from high-quality mainstream publications. Deciding which sources are appropriate depends on context. Material should be attributed in-text where sources disagree.\n\nScholarship\nShortcutWP:SCHOLARSHIP\nArticles should rely on secondary sources whenever possible. For example, a paper reviewing existing research, a review article, monograph, or textbook is often better than a primary research paper. When relying on primary sources, extreme caution is advised. Wikipedians should never interpret the content of primary sources for themselves (see Wikipedia:No original research and Wikipedia:Neutral point of view).\nMaterial such as an article, book, monograph, or research paper that has been vetted by the scholarly community is regarded as reliable, where the material has been published in reputable peer-reviewed sources or by well-regarded academic presses.\nCompleted dissertations or theses written as part of the requirements for a doctorate, and which are publicly available (most via interlibrary loan or from Proquest), can be used but care should be exercised, as they are often, in part, primary sources. Some of them will have gone through a process of academic peer reviewing, of varying levels of rigor, but some will not. If possible, use theses that have been cited in the literature; supervised by recognized specialists in the field; or reviewed by independent parties. Dissertations in progress have not been vetted and are not regarded as published and are thus not reliable sources as a rule. Some theses are later published in the form of scholarly monographs or peer reviewed articles, and, if available, these are usually preferable to the original thesis as sources. Masters dissertations and theses are considered reliable only if they can be shown to have had significant scholarly influence.\nOne may be able to confirm that discussion of the source has entered mainstream academic discourse by checking what scholarly citations it has received in citation indexes or lists such as DOAJ. Works published in journals not included in appropriate databases, especially in fields well covered by them, might be isolated from mainstream academic discourse, though whether it is appropriate to use will depend on the context.\nIsolated studies are usually considered tentative and may change in the light of further academic research. If the isolated study is a primary source, it should generally not be used if there are secondary sources that cover the same content.  The reliability of a single study depends on the field. Avoid undue weight when using single studies in such fields. Studies relating to complex and abstruse fields, such as medicine, are less definitive and should be avoided. Secondary sources, such as meta-analyses, textbooks, and scholarly review articles are preferred when available, so as to provide proper context.\nCare should be taken with journals that exist mainly to promote a particular point of view. A claim of peer review is not an indication that the journal is respected, or that any meaningful peer review occurs. Journals that are not peer reviewed by the wider academic community should not be considered reliable, except to show the views of the groups represented by those journals.[notes 1]\nIn recent years[when?] there has been a proliferation of new journals of very low quality that have only token peer-review if any (see predatory journals). These journals publish whatever is submitted if the author is willing to pay a fee. Some go so far as to mimic the names of established journals (see hijacked journals).[1][2][3][4][5] The lack of reliable peer review implies that articles in such journals should be treated similarly to self-published sources. If you are unsure about the quality of a journal, check that the editorial board is based in a respected accredited university, and that it is included in the relevant high-quality citation index—be wary of indexes that merely list almost all publications, and do not vet the journals they list. For medical content, more guidance is available at WP:MEDRS.\nNews organizations\nShortcutsWP:NEWSORGWP:RSEDITORIAL\nNews sources often contain both factual content and opinion content. News reporting from well-established news outlets is generally considered to be reliable for statements of fact (though even the most reputable reporting sometimes contains errors).  News reporting from less-established outlets is generally considered less reliable for statements of fact. Most newspapers also reprint items from news agencies such as Reuters, Interfax, Agence France-Presse, United Press International or the Associated Press, which are responsible for accuracy. The agency should be cited in addition to the newspaper that reprinted it.\nEditorial commentary, analysis and opinion pieces, whether written by the editors of the publication (editorials) or outside authors (op-eds) are reliable primary sources for statements attributed to that editor or author, but are rarely reliable for statements of fact.  Human interest reporting is generally not as reliable as news reporting, and may not be subject to the same rigorous standards of fact-checking and accuracy (see junk food news).[6]\n\nWhen taking information from opinion content, the identity of the author may help determine reliability. The opinions of specialists and recognized experts are more likely to be reliable and to reflect a significant viewpoint.[notes 2] If the statement is not authoritative, attribute the opinion to the author in the text of the article and do not represent it as fact. Reviews for books, movies, art, etc. can be opinion, summary or scholarly pieces.[7][8]\nScholarly sources and high-quality non-scholarly sources are generally better than news reports for academic topics. Press releases from the organizations or journals are often used by newspapers with minimal change; such sources are churnalism and should not be treated differently than the underlying press release.   Occasionally, some newspapers still have specialist reporters who are citable by name.   With regard to biomedical articles, see also Wikipedia:Identifying reliable sources (medicine).\nThe reporting of rumors has a limited encyclopedic value, although in some instances verifiable information about rumors may be appropriate (i.e. if the rumors themselves are noteworthy, regardless of whether or not they are true). Wikipedia is not the place for passing along gossip and rumors.\nSome news organizations have used Wikipedia articles as a source for their work. Editors should therefore beware of circular sourcing.[notes 3]\nWhether a specific news story is reliable for a fact or statement should be examined on a case-by-case basis.\nMultiple sources should not be asserted for any wire service article.   Such sources are essentially a single source.\nSome news organizations do not publish their editorial policies.\nSignals that a news organization engages in fact-checking and has a reputation for accuracy are the publication of corrections and disclosures of conflicts of interest.\nVendor and e-commerce sources\nShortcutsWP:VENDORWP:AFFILIATE\nAlthough the content guidelines for external links prohibit linking to \"Individual web pages that primarily exist to sell products or services,\" inline citations may be allowed to e-commerce pages such as that of a book on a bookseller's page or an album on its streaming-music page, in order to verify such things as titles and running times. Journalistic and academic sources are preferable, however, and e-commerce links should be replaced with reliable non-commercial sources if available.\nRankings proposed by vendors (such as bestseller lists at Amazon) usually have at least one of the following problems:\n\nIt may be impossible to provide a stable source for the alleged ranking.\nWhen only self-published by the vendor, i.e. no reliable independent source confirming the ranking as being relevant, the ranking would usually carry insufficient weight to be mentioned in any article.\nFor such reasons, such rankings are usually avoided as Wikipedia content.\n\nBiased or opinionated sources\nShortcutsWP:BIASEDWP:PARTISANWP:BIASEDSOURCES\nSee also: Wikipedia:Neutral point of view § Bias in sources, and Wikipedia:Neutrality of sources\nWikipedia articles are required to present a neutral point of view. However, reliable sources are not required to be neutral, unbiased, or objective. Sometimes non-neutral sources are the best possible sources for supporting information about the different viewpoints held on a subject.\nCommon sources of bias include political, financial, religious, philosophical, or other beliefs. Although a source may be biased, it may be reliable in the specific context.  When dealing with a potentially biased source, editors should consider whether the source meets the normal requirements for reliable sources, such as editorial control, a reputation for fact-checking, and the level of independence from the topic the source is covering. Bias may make in-text attribution appropriate, as in \"Feminist Betty Friedan wrote that...\"; \"According to the Marxist economist Harry Magdoff...\"; or \"Conservative Republican presidential candidate Barry Goldwater believed that...\".\n\nQuestionable and self-published sources\nMain page: Wikipedia:Verifiability § Reliable sources\nQuestionable sources\nShortcutsWP:QUESTIONABLEWP:QUESTIONED\nQuestionable sources are those with a poor reputation for checking the facts or with no editorial oversight. Such sources include websites and publications expressing views that are widely acknowledged as extremist, that are promotional in nature, or that rely heavily on rumors and personal opinions.[9] Questionable sources are generally unsuitable for citing contentious claims about third parties, which includes claims against institutions, persons living or dead, as well as more ill-defined entities. The proper uses of a questionable source are very limited.\nBeware of sources that sound reliable but do not have the reputation for fact-checking and accuracy that this guideline requires.[10] The Journal of 100% Reliable Factual Information might have a reputation for \"predatory\" behavior, which includes questionable business practices and/or peer-review processes that raise concerns about the reliability of their journal articles.[11][12]\n\nSponsored content\nShortcutWP:SPONSORED\nSee also: Wikipedia:Conflict of interest § Covert advertising\nSponsored content is generally unacceptable as a source, because it is paid for by advertisers and bypasses the publication's editorial process. Reliable publications clearly indicate sponsored articles in the byline or with a disclaimer at the top of the article. Sources that do not clearly distinguish staff-written articles from sponsored content are also questionable.\nSymposia and supplements to academic journals are often (but far from always) unacceptable sources. They are commonly sponsored by industry groups with a financial interest in the outcome of the research reported. They may lack independent editorial oversight and peer review, with no supervision of content by the parent journal.[13] Such shill articles do not share the reliability of their parent journal,[14] being essentially paid ads disguised as academic articles. Such supplements, and those that do not clearly declare their editorial policy and conflicts of interest, should not be cited.\nIndications that an article was published in a supplement may be fairly subtle; for instance, a letter \"S\" added to a page number,[15] or \"Suppl.\" in a reference.[16] However, note that merely being published in a supplement is not prima facie evidence of being published in a sponsored supplement. Many, if not most, supplements are perfectly legitimate sources, such as the Astronomy & Astrophysics Supplement Series, Nuclear Physics B: Proceedings Supplements, Supplement to the London Gazette, or The Times Higher Education Supplement. A sponsored supplement also does not necessarily involve a COI; for instance, public health agencies may also sponsor supplements. However, groups that do have a COI may hide behind layers of front organizations with innocuous names, so the ultimate funding sources should always be ascertained.\n\nSelf-published sources (online and paper)\nShortcutsWP:RSSELFWP:RS/SPS\nMain page: Wikipedia:Verifiability § Self-published sources\nAnyone can create a personal web page or publish their own book and claim to be an expert in a certain field. For that reason, self-published sources are largely not acceptable. Self-published books and newsletters, personal pages on social networking sites, tweets, and posts on Internet forums are all examples of self-published media. Self-published expert sources may be considered reliable when produced by an established expert on the subject matter, whose work in the relevant field has previously been published by reliable, independent publications. Never use self-published sources as independent sources about living people, even if the author is an expert, well-known professional researcher, or writer.\n\nUser-generated content\nShortcutsWP:UGCWP:USERGWP:USERGENERATED\nContent from websites whose content is largely user-generated is generally unacceptable. Sites with user-generated content include personal websites, personal and group blogs (excluding newspaper and magazine blogs), content farms, Internet forums, social media sites, video and image hosting services, most wikis, and other collaboratively created websites. \nExamples of unacceptable user-generated sites are Wikipedia (self referencing), Twitter, Facebook, Tumblr, Instagram, Reddit, IMDb, Ancestry.com, Find a Grave, and ODMP.\nAlthough review aggregators (such as Rotten Tomatoes) may be reliable, their audience ratings based on the reviews of their users are not.\nIn particular, a wikilink is not a reliable source.\n\nSelf-published and questionable sources as sources on themselves\nShortcutWP:SELFSOURCE\nSee also: Wikipedia:Verifiability § Self-published or questionable sources as sources on themselves\nSelf-published or questionable sources may be used as sources of information about themselves, especially in articles about themselves, without the requirement that they be published experts in the field, so long as the following criteria are met:\n\nThe material is neither unduly self-serving nor an exceptional claim.\nIt does not involve claims about third parties (such as people, organizations, or other entities).\nIt does not involve claims about events not directly related to the subject.\nThere is no reasonable doubt as to its authenticity.\nThe Wikipedia article is not based primarily on such sources.\nThese requirements also apply to pages from social networking websites such as Twitter, Tumblr, and Facebook. Use of self-sourced material should be de minimis; the great majority of any article must be drawn from independent sources.\n\nReliability in specific contexts\nBiographies of living persons\nMain page: Wikipedia:Biographies of living persons § Reliable sources\nEditors must take particular care when writing biographical material about living persons. Contentious material about a living person that is unsourced or poorly sourced should be removed immediately; do not move it to the talk page. This applies to any material related to living persons on any page in any namespace, not just article space.\n\nPrimary, secondary, and tertiary sources\nShortcutsWP:RSPRIMARYWP:WPNOTRS\nMain page: Wikipedia:No original research § Primary, secondary and tertiary sources\nWikipedia articles should be based mainly on reliable secondary sources, i.e., a document or recording that relates or discusses information originally presented elsewhere.\nReputable tertiary sources, such as introductory-level university textbooks, almanacs, and encyclopedias, may be cited. However, although Wikipedia articles are tertiary sources, Wikipedia employs no systematic mechanism for fact checking or accuracy. Thus, Wikipedia articles (and Wikipedia mirrors) in themselves are not reliable sources for any purpose (except as sources on themselves per WP:SELFSOURCE). \nPrimary sources are often difficult to use appropriately. Although they can be both reliable and useful in certain situations, they must be used with caution in order to avoid original research. Although specific facts may be taken from primary sources, secondary sources that present the same material are preferred. Large blocks of material based purely on primary sources should be avoided. All interpretive claims, analyses, or synthetic claims about primary sources must be referenced to a secondary source, rather than original analysis of the primary-source material by Wikipedia editors.\nWhen editing articles in which the use of primary sources is a concern, in-line templates, such as {{primary source-inline}} and {{better source}}, or article templates, such as {{primary sources}} and {{refimprove science}}, may be used to mark areas of concern.\n\nMedical claims\nShortcutWP:RS/MC\nMain page: Wikipedia:Identifying reliable sources (medicine)\nIdeal sources for biomedical assertions include general or systematic reviews in reliable, independent, published sources, such as reputable medical journals, widely recognised standard textbooks written by experts in a field, or medical guidelines and position statements from nationally or internationally reputable expert bodies. It is vital that the biomedical information in all types of articles be based on reliable, independent, published sources and accurately reflect current medical knowledge.\n\nQuotations\nShortcutWP:RS/QUOTE\nFurther information: Wikipedia:Manual of Style § Quotations\nThe accuracy of quoted material is paramount and the accuracy of quotations from living persons is especially sensitive. To ensure accuracy, the text of quoted material is best taken from (and cited to) the original source being quoted. If this is not possible, then the text may be taken from a reliable secondary source (ideally one that includes a citation to the original).  No matter where you take the quoted text from, it is important to make clear the actual source of the text, as it appears in the article.\nPartisan secondary sources should be viewed with suspicion as they may misquote or quote out of context.  In such cases, look for neutral corroboration from another source.\nAny analysis or interpretation of the quoted material, however, should rely on a secondary source (see Wikipedia:No original research).\n\nAcademic consensus\nShortcutWP:RS/AC\nA statement that all or most scientists or scholars hold a certain view requires reliable sourcing that directly says that all or most scientists or scholars hold that view. Otherwise, individual opinions should be identified as those of particular, named sources.  Editors should avoid original research especially with regard to making blanket statements based on novel syntheses of disparate material.  Stated simply, any statement in Wikipedia that academic consensus exists on a topic must be sourced rather than being based on the opinion or assessment of editors. Review articles, especially those printed in academic review journals that survey the literature, can help clarify academic consensus.\n\nUsage by other sources\nShortcutsWP:UBOWP:USEBYOTHERS\nHow accepted and high-quality reliable sources use a given source provides evidence, positive or negative, for its reliability and reputation. The more widespread and consistent this use is, the stronger the evidence. For example, widespread citation without comment for facts is evidence of a source's reputation and reliability for similar facts, whereas widespread doubts about reliability weigh against it. If outside citation is the main indicator of reliability, particular care should be taken to adhere to other guidelines and policies, and to not represent unduly contentious or minority claims. The goal is to reflect established views of sources as far as we can determine them.\n\nStatements of opinion\nShortcutWP:RSOPINION\nSome sources may be considered reliable for statements as to their author's opinion, but not for statements asserted as fact. For example, an inline qualifier might say \"[Author XYZ] says....\". A prime example of this is opinion pieces in sources recognized as reliable. When using them, it is best to clearly attribute the opinions in the text to the author and make it clear to the reader that they are reading an opinion.\nOtherwise reliable news sources—for example, the website of a major news organization—that publish in a blog-style format for some or all of their content may be as reliable as if published in standard news article format.\nThere is an important exception to sourcing statements of fact or opinion: Never use self-published books, zines, websites, webforums, blogs and tweets as a source for material about a living person, unless written or published by the subject of the biographical material. \"Self-published blogs\" in this context refers to personal and group blogs; see Wikipedia:Biographies of living persons § Reliable sources and Wikipedia:Biographies of living persons § Using the subject as a self-published source.\n\nBreaking news\nShortcutWP:RSBREAKING\nFurther information: Wikipedia:Biographies of living persons § Avoid gossip and feedback loops\nSee also: Wikipedia:Notability (events) § Breaking news\nBreaking-news reports often contain serious inaccuracies.  As an electronic publication, Wikipedia can and should be up to date, but Wikipedia is not a newspaper and it does not need to go into all details of a current event in real time. It is better to wait a day or two after an event before adding details to the encyclopedia, than to help spread potentially false rumors. This gives journalists time to collect more information and verify claims, and for investigative authorities to make official announcements. The On the Media Breaking News Consumer's Handbook[17] contains several suggestions to avoid spreading unreliable and false information, such as distrusting anonymous sources and unconfirmed reports, as well as reports attributed to other news media; seeking multiple sources; seeking eyewitness reports; being wary of potential hoaxes, and being skeptical of reports of possible additional attackers in mass shootings.\nClaims sourced to initial news reports should be immediately replaced with better-researched ones as soon as they are published, especially if those original reports contained inaccuracies.  All breaking-news stories, without exception, are primary sources, and must be treated with caution: see Wikipedia:No original research § Primary, secondary and tertiary sources.\nWhen editing a current-event article, keep in mind recentism bias.\nThe {{current}}, {{recent death}}, or another current-event-related template can be added to the top of articles about a breaking-news event to alert readers to the fact that some information in the article may be inaccurate, and to draw attention to the need to add improved sources as they become available. These templates should not be used, however, to mark articles on subjects or persons in the news; if they were, hundreds of thousands of articles would have such a template, but to no significant advantage (see also Wikipedia:No disclaimers in articles).\n\nHeadlines\nShortcutsWP:HEADLINESWP:RSHEADLINES\nNews headlines—including subheadlines—are not a reliable source if the information in the headline is not explicitly supported in the body of the source. Headlines are written to grab readers' attention quickly and briefly; they may be overstated or lack context, and sometimes contain exaggerations or sensationalized claims with the intention of attracting readers to an otherwise reliable article. They are often written by copy editors instead of the researchers and journalists who wrote the articles.\n\nDeprecated sources\nMain page: Wikipedia:Deprecated sources\nSee also: Wikipedia:Reliable sources/Perennial sources and Wikipedia:Blacklist\nA small number of sources are deprecated on Wikipedia. That means they should not be used, unless there is a specific consensus to do so. Deprecation happens through a request for comment, usually at the reliable sources noticeboard. It is reserved for sources that have a substantial history of fabrication or other serious factual accuracy issues (e.g. promoting unfounded conspiracy theories), usually when there are large numbers of references to the source giving rise to concerns about the integrity of information in the encyclopaedia.\nA deprecated source should not be used to support factual claims. While there are exceptions for discussion of the source's own view on something, these are rarely appropriate outside articles on the source itself. In general articles, commentary on a deprecated source's opinion should be drawn from independent secondary sources. Including a claim or statement by a deprecated source that is not covered by reliable sources risks giving undue weight to a fringe view.\nSome sources are blacklisted, and can not be used at all. Blacklisting is generally reserved for sources which are added abusively, such as state-sponsored fake news sites with a history of addition by troll farms. Specific blacklisted sources can be locally whitelisted; see Wikipedia:Blacklist for other details about blacklisting.\n\nSee also\nTemplates\nWikipedia:Template messages/Cleanup/Verifiability and sources lists many templates, including\n\n{{notability}} – adds: The topic of this article may not meet Wikipedia's general notability guideline. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted.Find sources: \"Reliable sources\" – news · newspapers · books · scholar · JSTOR (Learn how and when to remove this template message)\n{{citation needed}} – adds: [citation needed]\n{{unreliable source?}} – adds: [unreliable source?]\nPolicies and guidelines\n\nCiting sources\nIdentifying reliable sources (medicine)\nFringe theories\nNo original research\n\nInformation pages\n\nCommon knowledge\nExternal links/Perennial websites\nHow to mine a source\nInaccuracy § Appendix: Reliability in the context\nIdentifying and using independent sources\nIdentifying and using primary sources\nOffline sources\nReliable sources/Cost\nVideo links\n\nLocating reliable sources\n\nFree English newspaper sources\nReliable sources/Perennial sources, a list of frequently discussed sources\nList of academic databases and search engines\nList of digital library projects\nList of online newspaper archives\nThe Wikipedia Library, a program for accessing paywalled resources free of charge\nWikiProject Resource Exchange/Shared Resources\nWikiProject Resource Exchange/Resource Request\n\nEssays\n\nArticles on sources\nApplying reliability guidelines\nCherrypicking\nChildren's, adult new reader, and large print sources\nDictionaries as sources\nDon't teach the controversy (phrase doesn't mean what you think it does)\nFrequently misinterpreted sourcing policy\nIdentifying reliable sources (history)\nIdentifying reliable sources (law)\nIdentifying reliable sources (natural sciences)\nIdentifying and using tertiary sources\nIdentifying and using style guides\nNPOV means neutral editing, not neutral content\nWikipedia:Otto Middleton (or why newspapers are dubious sources)\nReliable source examples\nReliable sources/Flaws\nReliable sources checklist (provides a ref-vetting method)\nPotentially unreliable sources\nTertiary-source fallacy\nVanity and predatory publishing\nWikipedia clones\n\nOther\n\nChange detection and notification\nCurrent science and technology sources\nNews sources\nReliable sources/Noticeboard – obtain community input on whether or not a source meets our reliability standards for a particular use\nReliable sources quiz\nSource criticism\nWikipedia Signpost/2008-06-26/Dispatches – Signpost article\nWikiProject Reliability\n\nNotes\n\n\n^ Examples include The Creation Research Society Quarterly and Journal of Frontier Science (the latter uses blog comments as peer review Archived 2019-04-20 at the Wayback Machine).\n\n^ Please keep in mind that any exceptional claim would require exceptional sources, and this is policy.\n\n^ A variety of these incidents have been documented by Private Eye and others and discussed on Wikipedia, where incorrect details from articles added as vandalism or otherwise have appeared in newspapers\n\n\nReferences\n\n\n^ Beall, Jeffrey (1 January 2015). \"Criteria for Determining Predatory Open-Access Publishers\" (PDF) (3rd ed.). Scholarly Open Access. Archived from the original on 5 January 2017. CS1 maint: discouraged parameter (link)\n\n^ Kolata, Gina (April 7, 2013). \"Scientific Articles Accepted (Personal Checks, Too)\". The New York Times. Archived from the original on April 11, 2013. Retrieved April 11, 2013. CS1 maint: discouraged parameter (link)\n\n^ Butler, Declan (March 28, 2013). \"Sham journals scam authors: Con artists are stealing the identities of real journals to cheat scientists out of publishing fees\". Nature. 495. pp. 421–422. Archived from the original on April 13, 2013. Retrieved April 11, 2013. CS1 maint: discouraged parameter (link)\n\n^ Bohannon, John (4 October 2013). \"Who's afraid of peer review?\". Science. 342 (6154): 60–65. doi:10.1126/science.342.6154.60. PMID 24092725. CS1 maint: discouraged parameter (link)\n\n^ Kolata, Gina (30 October 2017). \"Many Academics Are Eager to Publish in Worthless Journals\". The New York Times. Archived from the original on 8 November 2017. Retrieved 2 November 2017. CS1 maint: discouraged parameter (link)\n\n^ Miller, Laura (October 16, 2011). \"'Sybil Exposed': Memory, lies and therapy\". Salon. Salon Media Group. Archived from the original on October 16, 2011. Retrieved October 17, 2011. [Debbie Nathan] also documents a connection between Schreiber and Terry Morris, a 'pioneer' of this [human interest] genre who freely admitted to taking 'considerable license with the facts that are given to me.' CS1 maint: discouraged parameter (link)\n\n^ \"Book reviews\". Scholarly definition document. Princeton. 2011. Archived from the original on November 5, 2011. Retrieved September 22, 2011. CS1 maint: discouraged parameter (link)\n\n^ \"Book reviews\". Scholarly definition document. Virginia Polytechnic Institute and State University. 2011. Archived from the original on September 10, 2011. Retrieved September 22, 2011. CS1 maint: discouraged parameter (link)\n\n^ Malone Kircher, Madison (November 15, 2016). \"Fake Facebook news sites to avoid\". New York Magazine. Archived from the original on November 16, 2016. Retrieved November 15, 2016. CS1 maint: discouraged parameter (link)\n\n^ An example is the Daily Mail, which is broadly considered a questionable and prohibited source, per this RfC.\n\n^ Beall, Jeffrey (25 February 2015). \"'Predatory' Open-Access Scholarly Publishers\" (PDF). The Charleston Advisor. Archived (PDF) from the original on 4 March 2016. Retrieved 7 January 2016. CS1 maint: discouraged parameter (link)\n\n^ Beall, Jeffrey. \"Potential, possible, or probable predatory scholarly open-access publishers\". Archived from the original on 17 January 2017.\n\n^ Fees, F. (2016), Recommendations for the conduct, reporting, editing, and publication of scholarly work in medical journals (PDF), archived (PDF) from the original on 2014-03-05, retrieved 2019-01-12 Conflicts-of-interest section Archived 2018-12-30 at the Wayback Machine, [Last update on 2015 Dec].\n\n^ Rochon, PA; Gurwitz, JH; Cheung, CM; Hayes, JA; Chalmers, TC (13 July 1994). \"Evaluating the quality of articles published in journal supplements compared with the quality of those published in the parent journal\". JAMA. 272 (2): 108–13. doi:10.1001/jama.1994.03520020034009. PMID 8015117.\n\n^ Nestle, Marion (2 January 2007). \"Food company sponsorship of nutrition research and professional activities: a conflict of interest?\" (PDF). Public Health Nutrition. 4 (5): 1015–1022. doi:10.1079/PHN2001253. Archived (PDF) from the original on 17 November 2018. Retrieved 12 January 2019.\n\n^ See this discussion of how to identify shill academic articles cited in Wikipedia.\n\n^ \"The Breaking News Consumer's Handbook | On the Media\". WNYC. Archived from the original on 2019-02-28. Retrieved 2019-03-14.\n\n\nExternal links\nHow to Read a Primary Source, Reading, Writing, and Researching for History: A Guide for College Students, Patrick Rael, 2004. (Also pdf version)\nHow to Read a Secondary Source, Reading, Writing, and Researching for History: A Guide for College Students, Patrick Rael, 2004. (Also pdf version)\nCitogenesis (Where citations come from), xkcd comic by Randall Munroe\n\"How I used lies about a cartoon to prove history is meaningless on the internet\", Geek.com.  How a troll used user-generated content to spread misinformation to TV.com, the IMDb, and Wikipedia.\nHow to Read a News Story About an Investigation: Eight Tips on Who Is Saying What, Benjamin Wittes, Lawfare\nvteWikipedia key policies and guidelines (?)\nFive pillars\nIgnore all rules\nContent (?)P\nVerifiability\nNo original research\nNeutral point of view\nWhat Wikipedia is not\nBiographies of living persons\nCopyright (Copyright violations)\nImage use\nArticle titles\nG\nNotability\nAutobiography\nCiting sources\nReliable sources\nmedicine\nDo not include copies of lengthy primary sources\nPlagiarism\nDon't create hoaxes\nFringe theories\nPatent nonsense\nExternal links\nConduct (?)P\nCivility\nConsensus\nHarassment\nVandalism\nIgnore all rules\nNo personal attacks\nOwnership of content\nEdit warring\nDispute resolution\nSockpuppetry\nNo legal threats\nChild protection\nPaid-contribution disclosure\nG\nAssume good faith\nConflict of interest\nDisruptive editing\nDo not disrupt Wikipedia to illustrate a point\nEtiquette\nGaming the system\nPlease do not bite the newcomers\nCourtesy vanishing\nResponding to threats of harm\nTalk page guidelines\nSignatures\nDeletion (?)P\nDeletion policy\nProposed deletion\nBiographies\nBooks\nCriteria for speedy deletion\nAttack page\nOversight\nRevision deletion\nEnforcement (?)P\nAdministrators\nBanning\nBlocking\nPage protection\nEditing (?)P\nEditing policy\nG\nArticle size\nBe bold\nDisambiguation\nHatnotes\nBroad-concept article\nUnderstandability\nStyle\nManual of Style\nContents\nAccessibility\nDates and numbers\nImages\nLayout\nLead section\nLinking\nLists\nClassification\nCategories, lists, and navigation templates\nCategorization\nTemplate namespace\nProject content (?)G\nProject namespace\nWikiProjects\nUser pages\nUser boxes\nShortcuts\nSubpages\nWMF (?)P\nTerms of Use\nList of policies\nFriendly space policy\nLicensing and copyright\nPrivacy policy\n\nList of all policies and guidelines\nP: List of policies\nG: List of guidelines\nSummaries of values and principles\n\nvteWikipedia referencingPolicies and guidelines\nVerifiability\nNo original research\nBiographies of living persons\nReliable sources\nMedicine\nCiting sources\nScientific citations\nGeneral advice\nCitation needed\nFind sources\nCombining sources\nOffline sources\nReferencing styles\nCiting sources\nCitation Style 1\nCitation Style 2\nCitation Style Vancouver\nLSA\nComics\nCitation templates\nReflist template\nInline citations\nFootnotes\nPunctuation and footnotes\nShortened footnotes\nNesting footnotes\nHelp for beginners\nReference-tags\nCitations quick reference\nIntroduction to referencing\nReferencing with citation templates\nReferencing without using templates\nReferencing dos and don'ts\nCiting Wikipedia\nAdvanced help\nCite link labels\nCitation tools\nCite errors\nCite messages\nConverting between references formats\nReference display customization\nReferences and page numbers\nGuidance on source reviewing at FAC\nTemplate documentation\n{{Edit refs}}\n{{Refref}}\n{{Refref2}}\n{{Refstart}}\nTools\nWikipedia Library\nDeprecated\nParenthetical referencing\n\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Wikipedia:Reliable_sources&oldid=1022471883\"\nCategories: Wikipedia content guidelinesWikipedia reliable sourcesWikipedia verifiabilityWikipedia sourcesHidden categories: Webarchive template wayback linksCS1 maint: discouraged parameterProject pages with short descriptionWikipedia semi-protected project pages\n\n\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nNot logged inTalkContributionsCreate accountLog in\n\n\n\n\n\nNamespaces\n\n\nProject pageTalk\n\n\n\n\n\nVariants\n\n\n\n\n\n\n\n\n\nViews\n\n\nReadView sourceView history\n\n\n\n\n\nMore\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\nContribute\n\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationWikidata item\n\n\n\n\nPrint/export\n\n\nDownload as PDFPrintable version\n\n\n\n\nIn other projects\n\n\nWikiversity\n\n\n\n\nLanguages\n\n\nAfrikaansالعربيةԱրեւմտահայերէնAzərbaycancaتۆرکجهবাংলাBân-lâm-gúБеларускаяБеларуская (тарашкевіца)БългарскиBosanskiCatalàЧӑвашлаČeštinaDanskΕλληνικάEspañolEsperantoفارسیFrançaisGalegoગુજરાતી한국어ՀայերենHrvatskiBahasa IndonesiaÍslenskaItalianoJawaქართულიҚазақшаLietuviųMagyarമലയാളംमराठीمصرىمازِرونیBahasa MelayuNederlandsनेपाली日本語Norsk bokmålଓଡ଼ିଆOʻzbekcha/ўзбекчаPolskiPortuguêsRomânăРусскийСаха тылаShqipSicilianuසිංහලSimple EnglishسنڌيSlovenčinaکوردیСрпски / srpskiSrpskohrvatski / српскохрватскиSvenskaதமிழ்Татарча/tatarçaతెలుగుไทยТоҷикӣTürkçeУкраїнськаاردوTiếng Việt粵語中文\nEdit links\n\n\n\n\n\n\n This page was last edited on 10 May 2021, at 18:03 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n"