"Plate-forme Messenger Cas d’utilisation  Gén. prospects  Commerce  Service client  Solutions  Success Stories  Trouver un partenaire  Documentation pour les développeurs  Sécurité Générez des ventes grâce aux conversationsCommerceMessenger vous permet d'associer le service personnalisé des achats en magasin et la commodité des achats en ligne. La plate-forme Messenger offre des outils riches, qui favorisent les expériences commerciales axées sur la conversation. De plus, les plugins de discussion de Messenger permettent de démarrer facilement une conversation sur Facebook, votre site web, etc.Une erreur s’est produiteNous rencontrons des difficultés pour lire cette vidéo.En savoir plusDes fonctionnalités riches La plate-forme de Messenger prend en charge les intégrations au catalogue produits, les reçus et les mises à jour de livraison, les alertes de retour en stock et d'autres fonctionnalités riches qui améliorent l'expérience commerciale. Un service personnalisé Messenger permet une expérience personnalisée. Ce type de service centré sur le client crée du lien et peut contribuer à sa fidélisation. Une connexion permanente Messenger ne fait pas que générer des ventes sur le moment. Ce service connecte les personnes et les entreprises par la voie d'un canal persistant favorisant le suivi et le réengagement. Recommandations personnalisées dans Messenger2,4 xRetour sur investissement publicitaire pour la campagne de Noël3 xRetour sur investissement publicitaire pour la campagne de la Saint-ValentinHappy Socks souhaitait aider ses clients à trouver la bonne paire de chaussettes à offrir pendant les fêtes. En collaboration avec le partenaire développeur de Messenger Spectrum, Happy Socks a créé une expérience d'achat personnalisée dans Messenger. En s'appuyant sur les Recommandations de Messenger concernant les achats guidés, Happy Socks a aidé ses clients à parcourir les 300 styles de chaussettes disponibles pour trouver la paire parfaite. Ils ont ainsi bénéficié d'une expérience simple et divertissante, avec un appel à l'action clair pour générer des ventes. La société a ensuite exécuté des publicités clic vers Messenger pour guider l'expérience des visiteurs, ce qui s'est traduit par un retour sur investissement publicitaire de 2,4 x pour sa campagne de Noël. Voir les solutions commercialesBoutiques Facebook Au sein de notre famille d’apps, les Boutiques Facebook sont la destination en ligne qui permet aux entreprises de communiquer sur leur marque, de toucher de potentiels clients et de vendre des produits et des services. La messagerie est un composant essentiel, que ce soit sur Facebook ou en dehors. C'est pourquoi cette fonction est désormais native dans les Boutiques, afin que les clients puissent prendre des décisions plus éclairées concernant leurs achats, tout en stimulant les ventes. En savoir plus sur les Boutiques FacebookGénérer des ventes via le commerce axé sur la conversation1,8 xRetour sur investissement publicitaire pour la campagne de Noël+22 %Retour sur investissement publicitaire pour la campagne de la Saint-Valentin Kiehl's a collaboré avec le partenaire développeur de Messenger Haravan pour créer une expérience commerciale axée sur la conversation dans Messenger : les utilisateurs pouvaient poser des questions sur les produits et passer commande. Les commandes passées dans Messenger étaient directement acheminées vers le service de gestion des stocks et de logistique de la marque. Ainsi, il était plus facile pour Kiehl's de surveiller les stocks et de satisfaire les commandes. Kiehl's a ensuite utilisé des publicités clic vers Messenger pour démarrer des conversations avec son public cible, ce qui s'est traduit par un retour sur investissement publicitaire de 1,8 x et une croissance des ventes de 22 %. Solutions de commerce socialComment Messenger communique avec vos clientsPlugin de discussionLe plugin de discussion de Facebook permet aux gens de démarrer facilement des conversations avec votre entreprise tout en parcourant votre site web.Page FacebookFaites en sorte que les gens puissent vous contacter facilement en ajoutant un appel à l’action « Envoyer un message » à votre Page ou vos publications de Page.Publicités renvoyant vers MessengerLancez des conversations à grande échelle grâce aux publicités renvoyant vers Messenger.Liens m.meDémarrez des conversations à partir d’hyperliens que vous pouvez ajouter à des e-mails, messages, publications de médias sociaux et plus encore.Codes QRLes codes QR permettent de démarrer facilement des conversations dans Messenger depuis des emplacements hors ligne comme la signalétique en magasin, les emballages de produits, le publipostage et plus encore.Cas d’utilisation supplémentairesEn savoir plus sur le lancement de conversations dans Messenger.Génération de prospectsEn savoir plus Service clientEn savoir plusSuccess StoryLearn how a retailer built a Messenger-powered automated assistant that led to a 5x conversion rate increase. Read MoreSolutions MessengerCe sont les éléments de base de votre expérience Messenger. Que vous cherchiez à générer des prospects, à stimuler les ventes ou à proposer un service clientèle, nous avons les solutions dont vous avez besoin.Découvrir les solutionsTrouver un développeur partenaireNotre annuaire des partenaires vous aidera à trouver un développeur partenaire ayant de l’expérience dans la création de solutions Messenger.Annuaire des partenairesLancez-vousNotre documentation pour les développeurs contient les informations dont vous avez besoin pour vous lancer avec Messenger.Documentation pour les développeurs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"