"\n\n\n\n\n\n\nMain Page\n\nFrom Wikipedia, the free encyclopedia\n\n\n\nJump to navigation\nJump to search\n\n\n\nWelcome to Wikipedia,\nthe free encyclopedia that anyone can edit.\n6,295,479 articles in English\n\n\nThe arts\nBiography\nGeography\nHistory\nMathematics\nScience\nSociety\nTechnology\nAll portals\n\n\n\n\n\nFrom today's featured article\n\n\n\n\nTed Kaczynski (born 1942), also known as the Unabomber, is an American domestic terrorist, primitivist and former mathematics professor. He was accepted to Harvard College at the age of 16 and, after graduating and earning his PhD, he taught at UC Berkeley for three years. He then moved to a small cabin in Montana to pursue a simple life. Kaczynski began sending mail bombs to people associated with universities, airlines, and the advancement of modern technology in 1978. He mailed a total of sixteen bombs, killing 3 people and injuring 23 others. Kaczynski's bombing campaign came under investigation by the FBI, who employed over 150 people in the most expensive FBI investigation ever conducted at the time. Kaczynski's manifesto, an anarcho-primitivist essay, was published in The Washington Post on the condition that he would desist from terrorism. He was eventually arrested in 1996 (mug shot pictured) and later imprisoned at ADX Florence in Colorado. (Full article...)\n\n\nRecently featured: \nA Crow Looked at Me\n\"Mother's Day\" (Rugrats)\nPreening\n\n\nArchive\nBy email\nMore featured articles\n\nDid you know ...\n\n\n\nColumnar basalt at Cape Stolbchaty, Russia\n\n... that more than 90 percent of all volcanic rock on Earth is basalt (example pictured)?\n... that Les McKeown worked at a paper mill before becoming the frontman of the Bay City Rollers?\n... that some microprocessors feature a compressed instruction set that packs machine-language instructions into a more memory-efficient size?\n... that Curley Christian was the only soldier in the First World War to survive a quadruple amputation?\n... that critic Jack Anderson described Patricia Bowman as \"the first American ballerina to win critical acclaim and wide popularity as a classical and a musical-theater dancer\"?\n... that the Soviet frigate Zadornyy was named after the Russian word for \"provocative\"?\n... that Daniel Post Senning studied molecular biology and modern dance but ultimately became an expert in etiquette?\n... that William Lescaze and his wife lived in a glass house and were not afraid of stone throwers?\n\nArchive\nStart a new article\nNominate an article\n\n\n\n\n\n\nIn the news\n\n\nAl-Aqsa Mosque\n\nIsraeli air-strikes and Hamas militant missile launches kill at least 26 people and injure hundreds more following clashes at the Al-Aqsa Mosque (pictured) and elsewhere in Jerusalem.\nMaldives speaker of parliament and former president Mohamed Nasheed is injured with four others in a car bombing in Malé.\nIn Afghanistan, a bombing near a school in Kabul kills at least 85 people and injures more than 140 others.\nAn elevated section of the Mexico City Metro collapses, killing at least 26 people and injuring more than 70 others.\n\nOngoing: \nCOVID-19 pandemic\nRecent deaths: \nManas Bihari Verma\nCourtenay Bartholomew\nCruz Reynoso\nKarl Wirsum\nShamim Hanafi\nDel Crandall\n\nNominate an article\nOn this day\n\nMay 11\n\n\n\nCast of a 2011 production of Cats\n\n868 – A copy of the Diamond Sutra was printed in Tang-dynasty China, making it the world's oldest dated printed book.\n1867 – The major powers of Europe signed the Treaty of London to resolve a crisis over the political status of Luxembourg between France and Prussia.\n1894 – In response to a 28-percent wage cut, 4,000 Pullman Palace Car Company workers went on strike in Illinois, bringing rail traffic west of Chicago to a halt.\n1981 – Andrew Lloyd Webber's Cats (performers pictured), the first megamusical, opened at the New London Theatre to become an unprecedented commercial success.\n1998 – India began the Pokhran-II nuclear-weapons test, its first since the Smiling Buddha test 24 years earlier.\nFrank Schlesinger  (b. 1871)Lise de Baissac  (b. 1905)Douglas Adams  (d. 2001)\n\nMore anniversaries: \nMay 10\nMay 11\nMay 12\n\n\nArchive\nBy email\nList of days of the year\n\n\n\n\nToday's featured picture\n\n\n\n\n\n\nBoy Bitten by a Lizard is an oil-on-canvas painting from around 1595 by the Italian Baroque painter Caravaggio. It exists in two versions, both believed to be authentic works of Caravaggio; one is in the collection of the Fondazione Roberto Longhi in Florence, while the other, shown here, is in the National Gallery, London. The identity of the sitter (theorised to be Mario Minniti) and the symbolism of the painting have been the subjects of much debate.\n\nPainting credit: Caravaggio\n\nRecently featured: \nSt Cyprian's, Clarence Gate\nProboscis monkey\nMary Lou Williams\n\n\nArchive\nMore featured pictures\n\n\n\n\n\nOther areas of Wikipedia\n\nCommunity portal – Bulletin board, projects, resources and activities covering a wide range of Wikipedia areas.\nHelp desk – Ask questions about using Wikipedia.\nLocal embassy – For Wikipedia-related communication in languages other than English.\nReference desk – Serving as virtual librarians, Wikipedia volunteers tackle your questions on a wide range of subjects.\nSite news – Announcements, updates, articles and press releases on Wikipedia and the Wikimedia Foundation.\nVillage pump – For discussions about Wikipedia itself, including areas for technical issues and policies.\n\nWikipedia's sister projects\n\nWikipedia is hosted by the Wikimedia Foundation, a non-profit organization that also hosts a range of other projects:\n\n\n\n\n\nCommonsFree media repository\n\n\n\nMediaWikiWiki software development\n\n\n\nMeta-WikiWikimedia project coordination\n\n\n\nWikibooksFree textbooks and manuals\n\n\n\nWikidataFree knowledge base\n\n\n\nWikinewsFree-content news\n\n\n\nWikiquoteCollection of quotations\n\n\n\nWikisourceFree-content library\n\n\n\nWikispeciesDirectory of species\n\n\n\nWikiversityFree learning tools\n\n\n\nWikivoyageFree travel guide\n\n\n\nWiktionaryDictionary and thesaurus\n\n\n\nWikipedia languages\n\n\nThis Wikipedia is written in English. Many other Wikipedias are available; some of the largest are listed below.\n\n\n\n\n\n1,000,000+ articles\n\n\n\nالعربية\nDeutsch\nEspañol\nFrançais\nItaliano\nNederlands\n日本語\nPolski\nPortuguês\nРусский\nSvenska\nУкраїнська\nTiếng Việt\n中文\n\n\n\n\n\n250,000+ articles\n\n\n\nBahasa Indonesia\nBahasa Melayu\nBân-lâm-gú\nБългарски\nCatalà\nČeština\nDansk\nEsperanto\nEuskara\nفارسی‎\nעברית\n한국어\nMagyar\nNorsk Bokmål\nRomână\nSrpski\nSrpskohrvatski\nSuomi\nTürkçe\n\n\n\n\n\n50,000+ articles\n\n\n\nAsturianu\nBosanski\nEesti\nΕλληνικά\nSimple English\nGalego\nHrvatski\nLatviešu\nLietuvių\nമലയാളം\nМакедонски\nNorsk nynorsk\nSlovenčina\nSlovenščina\nไทย\n\n\n\n\n\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Main_Page&oldid=1004593520\"\n\n\n\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nNot logged inTalkContributionsCreate accountLog in\n\n\n\n\n\nNamespaces\n\n\nMain PageTalk\n\n\n\n\n\nVariants\n\n\n\n\n\n\n\n\n\nViews\n\n\nReadView sourceView history\n\n\n\n\n\nMore\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\nContribute\n\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageWikidata item\n\n\n\n\nPrint/export\n\n\nDownload as PDFPrintable version\n\n\n\n\nIn other projects\n\n\nWikimedia CommonsMediaWikiMeta-WikiMultilingual WikisourceWikispeciesWikibooksWikidataWikimaniaWikinewsWikiquoteWikisourceWikiversityWikivoyageWiktionary\n\n\n\n\nLanguages\n\n\nالعربيةবাংলাБългарскиBosanskiCatalàČeštinaDanskDeutschEestiΕλληνικάEspañolEsperantoEuskaraفارسیFrançaisGalego한국어HrvatskiBahasa IndonesiaItalianoעבריתქართულიLatviešuLietuviųMagyarМакедонскиBahasa MelayuNederlands日本語Norsk bokmålNorsk nynorskPolskiPortuguêsRomânăРусскийSimple EnglishSlovenčinaSlovenščinaСрпски / srpskiSrpskohrvatski / српскохрватскиSuomiSvenskaไทยTürkçeУкраїнськаTiếng Việt中文\n\n\n\n\n\n\n This page was last edited on 3 February 2021, at 11:11 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n\n\n"