"Plate-forme Messenger Cas d’utilisation  Gén. prospects  Commerce  Service client  Solutions  Success Stories  Trouver un partenaire  Documentation pour les développeurs  Sécurité Établissez des relations durablesLe service client sur MessengerÉtablissez des relations durables avec vos clients par la conversation, sur leur canal préféré[1]. Plus besoin de patienter au téléphone ni de répéter le problème rencontré à plusieurs agents. La conversation est conservée dans Messenger, un canal facilement accessible pour transférer les questions, et propice au réengagement des clients.Une erreur s’est produiteNous rencontrons des difficultés pour lire cette vidéo.En savoir plusUne automatisation efficace Tirez parti de processus structurés et du traitement du langage naturel pour apporter instantanément des réponses aux questions les plus courantes de vos clients, et accroître ainsi leur satisfaction, ainsi que les taux de rétention. Assistance avec agent en direct Offrez une assistance avec agent en direct dans un canal pratique, utilisé par de nombreux clients chaque jour Des transitions fluides  Tirez parti du protocole de transfert de Messenger pour entamer une transition aisée entre la messagerie automatisée et l'assistance par un agent en direct Accroître la productivité du service client grâce à Messenger+29 %Réduction des délais de traitement par les agents du service client5 xQuantité d'interactions que les agents peuvent gérer simultanément, par rapport au téléphone+83 %Réduction anticipée des coûts des canaux du service client à l'échelle Afin d'améliorer les délais de réponse et la productivité des agents de son service client, Volaris a testé le plugin Chat de Facebook sur son site web avec 50 % des visiteurs. Étant donné que le plugin Chat était directement relié au logiciel de service client de Volaris (Conversocial), les agents en direct pouvaient gérer cinq interactions simultanément dans Messenger, alors qu'ils ne peuvent en gérer qu'une au téléphone. Au bout de six mois, la compagnie aérienne mexicaine constatait une baisse des délais de traitement de 29 %. La réussite de ce test a incité Volaris à implémenter la solution pour 100 % des visiteurs de son site web, avec une réduction des coûts anticipée de 83 % sur les canaux du service client.Voir les solutions pour le service clientGuide du service clientLe service client est un élément essentiel de toute entreprise. Et la communication est au cœur de tout bon service client. Nous avons conçu un guide dʼaide à la création dʼune expérience enrichissante sur Messenger. Il renferme des informations précieuses et complètes qui couvrent lʼensemble du processus, de la prise en main de Messenger pour offrir un service dʼassistance à lʼintégration de la plate-forme dans une stratégie omni-canal.Télécharger le guide 1. Source : Facebook Messaging Survey (Sondage relatif aux messages dans Facebook) de Nielsen (étude commandée par Facebook, réalisée auprès de 12 500 personnes âgées d’au moins 18 ans et ayant utilisé une app de messagerie mobile au cours des 30 derniers jours dans les pays suivants : Australie, Brésil, Corée du Sud, Émirats arabes unis, États-Unis, France, Inde, Indonésie, Japon, Mexique, Royaume-Uni, Taïwan, Thaïlande et Vietnam), mars 2016.Comment Messenger communique avec vos clientsPlugin de discussionLe plugin de discussion de Facebook permet aux gens de démarrer facilement des conversations avec votre entreprise tout en parcourant votre site web.Page FacebookFaites en sorte que les gens puissent vous contacter facilement en ajoutant un appel à l’action « Envoyer un message » à votre Page ou vos publications de Page.Publicités renvoyant vers MessengerLancez des conversations à grande échelle grâce aux publicités renvoyant vers Messenger.Liens m.meDémarrez des conversations à partir d’hyperliens que vous pouvez ajouter à des e-mails, messages, publications de médias sociaux et plus encore.Codes QRLes codes QR permettent de démarrer facilement des conversations dans Messenger depuis des emplacements hors ligne comme la signalétique en magasin, les emballages de produits, le publipostage et plus encore.Cas d’utilisation supplémentairesEn savoir plus sur le lancement de conversations dans Messenger.CommerceEn savoir plusGénération de prospectsEn savoir plusSuccess StoryLearn how a retailer built a Messenger-powered automated assistant that led to a 5x conversion rate increase. Read MoreSolutions MessengerCe sont les éléments de base de votre expérience Messenger. Que vous cherchiez à générer des prospects, à stimuler les ventes ou à proposer un service clientèle, nous avons les solutions dont vous avez besoin.Découvrir les solutionsTrouver un développeur partenaireNotre annuaire des partenaires vous aidera à trouver un développeur partenaire ayant de l’expérience dans la création de solutions Messenger.Annuaire des partenairesLancez-vousNotre documentation pour les développeurs contient les informations dont vous avez besoin pour vous lancer avec Messenger.Documentation pour les développeurs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"