"SalonsFonctionnalitésConfidentialité et sécuritéFacebook For DevelopersCommuniquez à votre façonCommuniquez à votre façonCommuniquez à votre façonAvec les fonctionnalités Messenger, rester proche n’a jamais été aussi naturel.COMMUNICATION ENTRE APPLICATIONSPassez du bon temps, qu’importe l’application, qu’importe l’appareilMessenger centralise les conversations sur Facebook, Instagram, Portal et Oculus (bientôt disponible).PARTAGE DE VIDÉOSSéance complète entre amisRegardez des films, des clips, des émissions et bien plus ensemble, directement depuis votre discussion vidéo.RÉACTIONS PERSONNALISÉESDites-le avec des emojisDites-le avec des emojisLes mots vous manquent ? Vous pouvez désormais personnaliser vos réactions avec une multitude d’emojis, comme  ou .EFFETS D’ANIMATIONExprimez-vousDonnez vie à vos conversations grâce à la réalité augmentée, des effets dans les messages* et des stickers à votre effigie*.*Bientôt disponible*Bientôt disponible*Bientôt disponibleRÉPONSES ET TRANSFERTSPlace à la conversationChoisissez dans votre discussion le message spécifique auquel vous souhaitez répondre ou que vous voulez transférer.VERROUILLAGEVos discussions en lieu sûrActivez la fonction de reconnaissance faciale ou d’empreinte digitale pour déverrouiller Messenger et gardez l’accès exclusif à vos discussions.PAIEMENTSEnvoyez de l’argent à vos amis et votre familleTransférez de l’argent rapidement et en toute sécurité en associant à Messenger votre carte de débit, votre compte PayPal ou une carte prépayée rechargeable.**Disponible uniquement aux États-Unis. Les cartes à approvisionnement unique ne peuvent être utilisées que pour envoyer de l’argent.*Disponible uniquement aux États-Unis. Les cartes à approvisionnement unique ne peuvent être utilisées que pour envoyer de l’argent.ENTREPRISECommuniquez avec votre universTrouvez des bons plans, effectuez des réservations et contactez un service client en discutant avec vos entreprises favorites directement sur Messenger. © Facebook 2021.  Les logos Apple et Google Play sont des marques déposées appartenant à leurs titulaires respectifs. Politique d’utilisation des données Conditions généralesFrançais (France)العربية‎Čeština‎Dansk‎Deutsch‎Ελληνικά‎English (UK)‎English (US)‎Español (España)‎Español‎Suomi‎Français (France)‎עברית‎हिन्दी‎Magyar‎Bahasa Indonesia‎Italiano‎日本語‎한국어‎Norsk (bokmål)‎Nederlands‎Polski‎Português (Brasil)‎Português (Portugal)‎Română‎Русский‎Svenska‎ภาษาไทย‎Türkçe‎Tiếng Việt‎中文(简体)‎中文(香港)‎中文(台灣)‎Prochainement ! Envoyez des messages à vos amis Instagram directement depuis Messenger. En savoir plus.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"