"\n\n\n\n\n\n\n\nWikipedia:Protection policy\n\nFrom Wikipedia, the free encyclopedia\n\n\n\nJump to navigation\nJump to search\nPolicy on page protection\n\n\nSee also: Wikipedia:Requests for page protection and Wikipedia:Lists of protected pages\n\"WP:PP\" and \"WP:PROTECT\" redirect here. For other uses, see Wikipedia:Perennial proposals, Wikipedia:WikiProject Parliamentary Procedure, Wikipedia:Party and person, Wikipedia:Child protection, and Wikipedia:WikiProject Protected areas.\nThis page documents an English Wikipedia policy.It describes a widely accepted standard that all editors should normally follow. Changes made to it should reflect consensus.ShortcutsWP:PPWP:PROTECT\nThis page in a nutshell: While Wikipedia strives to be as open as possible, sometimes it is necessary to limit editing of certain pages in order to prevent vandalism, edit warring, or other disruptive edits.\nAre you in the right place?This page is for documenting and explaining the English Wikipedia policy on page protection.\n\n\nAre you trying to request protection of a page? Request page protection.\nAre you trying to request removal of a page's protection? Request a change in page protection level.\nDo you want to request an edit be made to a protected page? Create an edit request.\nDo you need to report persistent vandalism or spam to an administrator? File a vandalism report.\nDo you need to report an inappropriate username or an account with a username that blatantly violates Wikipedia's username policy? File a username report.\nAre you currently blocked from editing Wikipedia and wish to request an unblock? You can resolve this matter by appealing your block.\nDo you need to report an edit war or three-revert rule violation to an administrator? File an edit war report.\nDo you need to report or discuss a policy violation or behavioral issue (such as an evasion of a block, abuse of tools, or other incidents) on Wikipedia that requires administrator intervention? File an incident report.\nEnforcement policies\nAdministrators\nBanning policy\nBlocking policy\nProtection policy\nvte\n\n\n\n\nFully-protected\n\n\n\n\nInterface protected\n\n\n\n\nTemplate-protected\n\n\n\n\nSemi-protected\n\n\n\n\nCreate protected\n\n\n\n\nMove protected\n\n\n\n\nUpload protected\n\n\n\n\nPending changes protected\n\n\n\n\nExtended confirmed protected\n\n\n\n\nProtected by Office\n\n\n\n\nCascade protected\n\nIn some circumstances, pages may need to be protected from modification by certain groups of editors. Pages are protected when a specific damaging event has been identified that can not be prevented through other means such as a block. Otherwise, Wikipedia is built on the principle that anyone can edit it, and it therefore aims to have as many of its pages as possible open for public editing so that anyone can add material and correct errors. This policy explains in detail the protection types and procedures for page protection and unprotection and when each protection should and should not be applied.\nProtection is a technical restriction applied only by administrators, although any user may request protection. Protection can be indefinite or expire after a specified time. The various levels of protection are detailed below, and they can be applied to the page edit, page move, page create, and file upload actions. Even when a page is protected from editing, the source code (text) of the page can still be viewed and copied by any user.\nA protected page is marked at its top right by a padlock icon, usually added by the {{pp-protected}} template.\n\nContents\n\n1 Types of protection\n\n1.1 Full protection\n\n1.1.1 Content disputes\n1.1.2 Vandalism\n1.1.3 \"History only\" review\n1.1.4 Protected generic file names\n1.1.5 Permanent protection\n\n\n1.2 Template protection\n1.3 Semi-protection\n\n1.3.1 Guidance for administrators\n\n\n1.4 Creation protection (salting)\n1.5 Move protection\n1.6 Upload protection\n1.7 Pending changes protection\n\n1.7.1 When to apply pending changes protection\n\n\n1.8 Extended confirmed protection\n1.9 Office actions\n1.10 Cascading protection\n\n\n2 Deprecated protection\n\n2.1 Superprotect\n2.2 Cascading semi-protection\n2.3 Pending changes protection level 2\n\n\n3 Protection by namespace\n\n3.1 Article talk pages\n3.2 User talk pages\n\n3.2.1 Blocked users\n\n\n3.3 User pages\n\n3.3.1 Deceased users\n\n\n3.4 Protection of templates\n3.5 Sandboxes\n\n\n4 Available templates\n5 See also\n6 Notes\n\n\nTypes of protection\nShortcutWP:PPLIST\nThe following technical options are available to administrators for protecting different actions to pages:\n\nEdit protection protects the page from being edited.\nMove protection protects the page from being moved or renamed.\nCreation protection prevents a page (normally a previously deleted one) from being created (also known as \"salting\").\nUpload protection prevents new versions of a file from being uploaded, but it does not prevent editing to the file's description page (unless edit protection is applied).\nThe following technical options are available to administrators for adding protection levels to the different actions to pages:\n\nPending changes protection (only available for edit protection) means edits by unregistered and new contributors are not visible to readers who are not logged-in until the edits are approved by a reviewer or an administrator.\nSemi-protection prevents the action by unregistered contributors and contributors with accounts that are not confirmed.\nExtended confirmed protection, also known as 30/500 protection, prevents the action by users without 30 days' tenure and 500 edits on the English Wikipedia. It is applied to combat any form of disruption where semi-protection has proven to be ineffective. It should not be applied as a protection level of first resort. Its use is logged at the Administrators' noticeboard.\nTemplate protection prevents the action by everyone except template editors and administrators (who have this right as part of their toolset).\nFull protection prevents the action by everyone except administrators.\nAny type of protection (with the exception of cascading protection) may be requested at Wikipedia:Requests for page protection. Changes to a fully protected page should be proposed on the corresponding talk page, then carried out by an administrator if they are uncontroversial or there is consensus for them.\nExcept in the case of office actions (see below), Arbitration Committee remedies, or pages in the MediaWiki namespace (see below), administrators may unprotect a page if the reason for its protection no longer applies, a reasonable period has elapsed, and there is no consensus that continued protection is necessary. Editors desiring the unprotection of a page should, in the first instance, ask the administrator who applied the protection unless the administrator is inactive or no longer an administrator; thereafter, requests may be made at Requests for unprotection. Note that such requests will normally be declined if the protecting administrator is active and was not consulted first. A log of protections and unprotections is available at Special:Log/protect.\n\n\n\nInteraction of Wikipedia user groups and page protection levels\n\n\n \n\nUnregistered or Newly registered\n\nAuto-confirmed, Confirmed\n\nExtended confirmed\n\nTemplate editor\n\nAdmin\n\nAppropriate for\n\n\nNo protection\n\nnormal editing\n\nThis is the default protection level, used for the vast majority of pages.\n\n\nPendingchanges protection\n\nall users can edit. However, once an unregistered or new editor makes an edit, that edit and any subsequent edits by anyone will remain hidden from \"readers\" (users not logged in) until the edit made by the unregistered or new editor is reviewed by a pending changes reviewer or admin. Logged-in editors always see all changes (whether accepted or not) immediately.\n\nInfrequently edited pages with high levels of vandalism, BLP violations, edit-warring, or other disruption from unregistered and new users\n\n\nSemi-protection\n\ncannot edit\n\nnormal editing\n\nPages with high levels of disruption from unregistered and new users; some highly visible templates & modules\n\n\nExtended-confirmed prot.\n\ncannot edit\n\nnormal editing*\n\nSpecific topic areas authorized by Arbcom; pages subject to persistent disruption that semi-protection has failed to stop\n\n\nTemplate prot.\n\ncannot edit\n\nnormal editing\n\nHigh-risk templates & modules; also some high-risk pages outside template space\n\n\nFull protection\n\ncannot edit\n\nnormal editing\n\nArticles with persistent disruption from extended confirmed accounts; critical templates & modules\n\n\n* A template editor must also be extended confirmed in order to edit through extended confirmed protection, but in practice this is essentially always the case.\nOther modes of protection:\n\n\nInterface protectionCreate protectionMove protectionUpload protectionOffice protectionCascade protection\n\n\nviewtalkedit\n\n\n\n\nFull protection\n\nShortcutsWP:FULLWP:GOLDLOCK\nA fully protected page cannot be edited or moved by anyone except administrators. The protection may be for a specified time or may be indefinite.\nModifications to a fully protected page can be proposed on its talk page (or at another appropriate forum) for discussion. Administrators can make changes to the protected article reflecting consensus. Placing the {{Edit fully protected}} template on the talk page will draw the attention of administrators for implementing uncontroversial changes.\n\n\nContent disputes\nSee also: Wikipedia:Stable version\n\"WP:PREFER\" redirects here. For what title name should be preferred, see WP:PRIMARYTOPIC.\nWhile content disputes and edit warring may be addressed with user blocks issued by uninvolved administrators, allowing normal page editing by other editors at the same time, the protection policy provides an alternative approach as administrators have the discretion to temporarily fully protect an article to end an ongoing edit war. This approach may better suit multi-party disputes and contentious content, as it makes talk page consensus a requirement for implementation of requested edits.\n\n\nShortcutWP:PREFER\nWhen protecting a page because of a content dispute, administrators have a duty to avoid protecting a version that contains policy-violating content, such as vandalism, copyright violations, defamation, or poor-quality coverage of living people. Administrators are deemed to remain uninvolved when exercising discretion on whether to apply protection to the current version of an article, or to an older, stable, or pre-edit-war version.\nProtected pages may not be edited except to make changes that are uncontroversial or for which there is clear consensus. Editors convinced that the protected version of an article contains policy-violating content, or that protection has rewarded edit warring or disruption by establishing a contentious revision, may identify a stable version prior to the edit war and request reversion to that version. Before making such a request, editors should consider how independent editors might view the suggestion and recognize that continuing an edit war is grounds for being blocked.\nAdministrators who have made substantive content changes to an article are considered involved and must not use their advanced permissions to further their own positions. When involved in a dispute, it is almost always wisest to respect the editing policies that bind all editors and call for input from an uninvolved administrator, rather than to invite controversy by acting unilaterally.\n\nVandalism\nShortcutsWP:NO-PREEMPTWP:PREEMPTIVE\nApplying page protection as a preemptive measure is contrary to the open nature of Wikipedia and is generally not allowed if applied for these reasons. However, brief periods of an appropriate and reasonable protection level are allowed in situations where blatant vandalism or disruption is occurring by multiple users and at a level of frequency that requires its use in order to stop it. The duration of the protection should be set as short as possible, and the protection level should be set to the lowest restriction needed in order to stop the disruption while still allowing productive editors to make changes.\n\n\"History only\" review\nShortcutWP:PPDRV\nIf a deleted page is going through deletion review, only administrators are normally capable of viewing the former content of the page. If they feel it would benefit the discussion to allow other users to view the page content, administrators may restore the page, blank it or replace the contents with {{Temporarily undeleted}} or a similar notice, and fully protect the page to prevent further editing. The previous contents of the page are then accessible to everyone via the page history.\n\n Protected generic file names\nGeneric file names such as File:Map.jpg, File:Photo.jpg, and File:Sound.wav are fully protected to prevent new versions being uploaded.\n\n\nPermanent protection\n\n\n\nShortcutsWP:PPINDEFWP:PERM-PROWP:REDLOCK\nAdministrators cannot change or remove the protection for some areas on Wikipedia which are permanently protected by the MediaWiki software:\n\nEdits to the MediaWiki namespace, which defines parts of the site interface, are restricted to administrators.\nEdits to system-wide CSS and JavaScript pages such as MediaWiki:common.js are further restricted to interface administrators.\nEdits to personal CSS and JavaScript pages such as User:Example/monobook.css and User:Example/cologneblue.js are restricted to the associated user and interface administrators. Interface administrators may edit these pages, for example, to remove a user script that has been used in an inappropriate way. Administrators may delete (but not edit or restore) these pages.\nEdits to personal JSON pages such as User:Example/data.json are restricted to the associated user and administrators.\nIn addition to hard-coded protection, the following are usually fully protected for an indefinite period of time:\n\nPages that are very visible, such as the Main Page\nPages that should not be modified for copyright or legal reasons, such as the general disclaimer or the local copy of the site copyright license.\nPages that are very frequently transcluded, such as {{tl}} or {{citation needed}}, to prevent vandalism or denial of service attacks. This includes images or templates used in other highly visible or frequently transcluded pages. See Wikipedia:High-risk templates for more information.\n\n\nTemplate protection\nMain page: Wikipedia:Template editor\n\nShortcutsWP:TPROTWP:PINKLOCK\nA template-protected page can be edited only by administrators or users in the Template editors group. This protection level should be used almost exclusively on high-risk templates and modules. In cases where pages in other namespaces become transcluded to a very high degree, this protection level is also valid.\nThis is a protection level[1] that replaces full protection on pages that are merely protected due to high transclusion rates, rather than content disputes. It should be used on templates whose risk factor would have otherwise warranted full protection. It should not be used on less risky templates on the grounds that the template editor user right exists—the existence of the right should not result in more templates becoming uneditable for the general editing community.\nEditors may request edits to a template-protected page by proposing them on its talk page, using the {{Edit template-protected}} template if necessary to gain attention.\n\n\nSemi-protection\nSee also: Wikipedia:Rough guide to semi-protection\n\nShortcutsWP:SEMIWP:SILVERLOCK\nSemi-protected pages cannot be edited by unregistered users (IP addresses), as well as accounts that are not autoconfirmed (accounts that are at least four days old and have made at least ten edits to Wikipedia) or confirmed. Semi-protection is useful when there is a significant amount of disruption or vandalism from new or unregistered users, or to prevent sockpuppets of blocked or banned users from editing, especially when it occurs on biographies of living persons who have had a recent high level of media interest. An alternative to semi-protection is pending changes, which is sometimes favored when an article is being vandalized regularly, but otherwise receives a low amount of editing.\nSuch users can request edits to a semi-protected page by proposing them on its talk page, using the {{Edit semi-protected}} template if necessary to gain attention. If the page in question and its talk page are both protected, please make your edit request at Wikipedia:Requests for page protection instead. New users may also request the confirmed user right at Wikipedia:Requests for permissions/Confirmed.\n\nGuidance for administrators\nAdministrators may apply indefinite semi-protection to pages that are subject to heavy and persistent vandalism or violations of content policy (such as biographies of living persons, neutral point of view). Semi-protection should not be used as a preemptive measure against vandalism that has not yet occurred or to privilege registered users over unregistered users in (valid) content disputes.\nIn addition, administrators may apply temporary semi-protection on pages that are:\n\nSubject to significant but temporary vandalism or disruption (for example, due to media attention) if blocking individual users is not a feasible option.\nSubject to edit warring if all parties involved are unregistered or new editors (i.e. in cases in which full protection would otherwise be applied). This does not apply when autoconfirmed users are involved.\nSubject to vandalism or edit warring where unregistered editors are engaging in IP hopping by using different computers, obtaining new addresses by using dynamic IP allocation, or other address-changing schemes.\nArticle discussion pages, if they have been subject to persistent disruption. Such protection should be used sparingly because it prevents unregistered and newly registered users from participating in discussions. A page and its talk page should not normally be protected at the same time. If a page and its talk page are both protected, the talk page should direct affected editors to Wikipedia:Request for edit to ensure that no editor is entirely prevented from contributing.\nProtection should be used sparingly on the talk pages of blocked users, including IP addresses. Instead the user should be re-blocked with talk page editing disallowed. When required, or when re-blocking without talk page editing allowed is unsuccessful, protection should be implemented for only a brief period not exceeding the duration of the block.\nToday's featured article may be semi-protected just like any other article. But since that article is subject to sudden spurts of vandalism during certain times of day, administrators should semi-protect it for brief periods in most instances. For the former guideline, see Wikipedia:Main Page featured article protection.\n\n\nCreation protection (salting)\n\nShortcutsWP:SALTWP:SKYBLUELOCK\nAdministrators can prevent the creation of pages. This level of protection is useful for bad pages that have been deleted but repeatedly recreated. Such protection is case-sensitive. There are several levels of creation protection that can be applied to pages, identical to the levels for edit protection. A list of protected titles may be found at Special:ProtectedTitles (see also historical lists).\nPre-emptive restrictions on new article titles are instituted through the title blacklist system, which allows for more flexible protection with support for substrings and regular expressions.\nPages that have been creation-protected are sometimes referred to as \"salted\". Contributors wishing to re-create a salted title with appropriate content should either contact an administrator (preferably the protecting administrator), file a request at Wikipedia:Requests for page protection#Current requests for reduction in protection level, or use the deletion review process. To make a convincing case for re-creation, it is helpful to show a draft version of the intended article when filing a request.\nAdministrators should choose the appropriate level of create protection—autoconfirmed, extended-confirmed,[2] or full. Due to the implementation of ACPERM, non-confirmed editors cannot create pages in mainspace; thus, semi-creation protection should be rare, used only for protection of pages outside of mainspace.\nWhile creation-protection is usually permanent, temporary creation protection may be applied if a page is repeatedly recreated by a single user (or sockpuppets of that user, if applicable).\n\n\nMove protection\n\nShortcutsWP:MOVPWP:GREENLOCK\nMove protected pages, or more technically, fully move-protected pages, cannot be moved to a new title except by an administrator. Move protection is commonly applied to:\n\nPages subject to persistent page-move vandalism.\nPages subject to a page-name dispute.\nHighly visible pages that have no reason to be moved, such as the administrators' noticeboard and articles selected as \"Today's featured article\" on the main page.\nFully edit-protected pages are also implicitly move-protected.\nAs with full edit protection, protection because of edit warring should not be considered an endorsement of the current name. When move protection is applied during a requested move discussion, the page should be protected at the location it was at when the move request was started.\nAll files are implicitly move-protected; only file movers and administrators can rename files.\n\n\nUpload protection\n\nShortcutsWP:UPLOAD-PWP:PURPLELOCK\nUpload protected files, or more technically, fully upload-protected files, cannot be replaced with new versions except by an administrator. Upload protection does not protect file pages from editing. Upload protection may be applied by an administrator to:\n\nFiles subject to persistent upload vandalism.\nFiles subject to a dispute between editors.\nFiles that should not be replaced, such as images used in the interface or transcluded to the main page.\nFiles with common or generic names. (eg. File:Map.png)\nAs with full edit protection, administrators should avoid favoring one file version over another, and protection should not be considered an endorsement of the current file version. An exception to this rule is when files are protected due to upload vandalism.\n\n\nPending changes protection\nFurther information: Wikipedia:Pending changes\n\nShortcutsWP:PCPPWP:WHITELOCK\nPending changes protection is a tool used to suppress vandalism and certain other persistent problems while allowing all users to continue to submit edits. Pending changes protection can be used as an alternative to semi-protection to allow unregistered and new users to edit pages, while keeping the edits hidden from the view of most readers until those changes are accepted by a pending changes reviewer.\nWhen a page under pending changes protection is edited by an unregistered (IP addresses) editor or a new user, the edit is not directly visible to the majority of Wikipedia readers, until it is reviewed and accepted by an editor with the pending changes reviewer right. When a page under pending changes protection is edited by an autoconfirmed user, the edit will be immediately visible to Wikipedia readers, unless there are pending edits waiting to be reviewed.\nPending changes are visible in the page history, where they are marked as pending review. Readers that are not logged in (the vast majority of readers) are shown the latest accepted version of the page; logged-in users see the latest version of the page, with all changes (reviewed or not) applied. When editors who are not reviewers make changes to an article with unreviewed pending changes, their edits are also marked as pending and are not visible to most readers.\nA user who clicks \"edit this page\" is always, at that point, shown the latest version of the page for editing regardless of whether the user is logged in or not.\n\nIf the editor is not logged in, their changes join any other changes to the article awaiting review – for the present they remain hidden from not-logged-in users. (This means that when the editor looks at the article after saving, the editor won't see the change made.)\nIf the editor is logged in and a pending changes reviewer, and there are pending changes, the editor will be prompted to review the pending changes before editing – see Wikipedia:Pending changes.\nIf the editor is logged in and not a pending changes reviewer, then ...\nIf there are no unreviewed pending edits waiting, this editor's edits will be visible to everyone immediately; but\nIf there are unreviewed pending edits waiting, then this editor's edits will be visible only to other logged-in users (including themself) immediately, but not to readers not logged in.\nReviewing of pending changes should be resolved within reasonable time limits.\n\nWhen to apply pending changes protection\nPending changes may be used to protect articles against:\n\nPersistent vandalism\nViolations of the biographies of living persons policy\nCopyright violations\nPending changes protection should not be used as a preemptive measure against violations that have not yet occurred. Like semi-protection, PC protection should never be used in genuine content disputes, where there is a risk of placing a particular group of editors (unregistered users) at a disadvantage. Pending changes protection should not be used on articles with a very high edit rate, even if they meet the aforementioned criteria. Instead semi-protection should be considered.\nIn addition, administrators may apply temporary pending changes protection on pages that are subject to significant but temporary vandalism or disruption (for example, due to media attention) when blocking individual users is not a feasible option. As with other forms of protection, the time frame of the protection should be proportional to the problem. Indefinite PC protection should be used only in cases of severe long-term disruption.\nRemoval of pending changes protection can be requested of any administrator, or at requests for unprotection.\nThe reviewing process is described in detail at Wikipedia:Reviewing pending changes.\n\n\nExtended confirmed protection\nSee also: Wikipedia:Rough guide to extended confirmed protection\n\nShortcutsWP:ECPWP:BLUELOCK\nExtended confirmed protection, also known as 30/500 protection, only allows edits by editors with the extended confirmed user access level, granted automatically to registered users with at least 30 days tenure and 500 edits.\nWhere semi-protection has proven to be ineffective, administrators may use extended confirmed protection to combat disruption (such as vandalism, abusive sockpuppetry, edit wars, etc.) on any topic. Extended confirmed protection should not be used as a preemptive measure against disruption that has not yet occurred, nor should it be used to privilege extended confirmed users over unregistered/new users in valid content disputes on articles not covered by Arbitration Committee 30/500 rulings. Extended confirmed protection may be applied by an administrator at their discretion when creation-protecting a page.[2]\nUntil August 12, 2016,[3] 30/500 protection applied only in topic areas determined by the Arbitration Committee, which authorized its use on articles reasonably construed as belonging to the Arab–Israeli conflict;[4] as an arbitration enforcement tool by motion or remedy;[5] or as a result of community consensus.[6] In February 2019, the community authorized uninvolved administrators to place pages reasonably construed as belonging to the India–Pakistan conflict under extended confirmed protection as part of a general sanctions regime.[7] In May 2020 the Arbitration Committee authorized extended confirmed protection to pages related to the history of Jews and antisemitism in Poland during World War II (1933–45).[8] As of September 23, 2016, a bot posts a notification in a subsection of AN when this protection level is used.[9] A full list of the 2622 pages under 30/500 protection can be found here.\nUsers can request edits to an extended confirmed-protected page by proposing them on its talk page, using the {{Edit extended-protected}} template if necessary to gain attention. \n\n\nOffice actions\nSee also: Wikipedia:Office actions\n\nShortcutsWP:WMF-PROWP:BLACKLOCK\nAs outlined in Meta:Office actions#Use of advanced rights by Foundation staff, pages may be protected by Wikimedia Foundation staff in response to issues such as copyright infringement or libel. Such actions override community consensus. Administrators should not edit or unprotect such pages without permission from Wikimedia Foundation staff.\n\n\nCascading protection\n\"WP:CASCADE\" redirects here. You may be also looking for Wikipedia:Cascading style sheets or Wikipedia:Cascade-protected items.\n\nShortcutsWP:CASCADEWP:TURQUOISELOCK\nCascading protection fully protects a page, and extends that full protection automatically to any page that is transcluded onto the protected page, whether directly or indirectly. This includes templates, images and other media that are hosted on the English Wikipedia. Files stored on Commons are not protected by any other wiki's cascading protection and, if they are to be protected, must be either temporarily uploaded to the English Wikipedia or explicitly protected at Commons (whether manually or through cascading protection there). When operational, KrinkleBot cascade-protects Commons files transcluded at Wikipedia:Main Page/Tomorrow, Wikipedia:Main Page/Commons media protection and Main Page. As the bot's response time varies, media should not be transcluded on the main page (or its constituent templates) until after it has been protected. (This is particularly relevant to Template:In the news, for which upcoming images are not queued at Wikipedia:Main Page/Tomorrow.) Cascading protection:\n\nShould be used only to prevent vandalism when placed on particularly visible pages, such as the main page.\nIs available only for fully protected pages; it is disabled for lower levels of protection as it represents a security flaw. See Phabricator:T10796 for more information.\nIs not instantaneous; it may be several hours before it takes effect. See Phabricator:T20483 for more information.\nShould generally not be applied directly to templates or modules, as it will not protect transclusions inside <includeonly> tags or transclusions that depend on template parameters, but will protect the documentation subpage. See the \"Protection of templates\" section below for alternatives.\nThe list of cascading-protected pages can be found at Wikipedia:Cascade-protected items. Requests to add or remove cascading protection on a page should be made at Wikipedia talk:Cascade-protected items as an edit request.\n\nDeprecated protection\nSuperprotect\nShortcutWP:SUPERPROTECT\nSee also: meta:Superprotect\nSuperprotect was a level of protection, allowing editing only by Wikimedia Foundation employees who are in the Staff global group. It was implemented on August 10, 2014 and used the same day to override community consensus regarding the use of the Media Viewer on the German Wikipedia's primary site JavaScript, common.js. It was never used on the English Wikipedia. On November 5, 2015, the WMF decided to remove superprotect from all Wikimedia wikis.\n\nCascading semi-protection\nCascading semi-protection was formerly possible, but it was disabled in 2007 after users noticed that non-administrators could fully protect any page by transcluding it onto the page to which cascading semi-protection had been applied by an administrator.\n\nPending changes protection level 2\nShortcutWP:ORANGELOCK\nOriginally, two levels of pending changes protection existed, where level 2 required edits by all users who are not pending changes reviewers to be reviewed. Following a community discussion, level 2 was retired from the English Wikipedia in January 2017. It was suggested then that \"Pending changes level 1\" be referred to in the future as simply \"Pending changes\".[10]\n\nProtection by namespace\nArticle talk pages\n\nModifications to a protected page can be proposed on its talk page (or at another appropriate forum) for discussion. Administrators can make changes to the protected article reflecting consensus. Placing the {{Edit protected}} template on the talk page will draw the attention of administrators for implementing uncontroversial changes.\nTalk pages are not usually protected, and are semi-protected only for a limited duration in the most severe cases of vandalism.\n\nUser talk pages\nUser talk pages are rarely protected. However, protection may be applied if there is severe vandalism or abuse. Users whose talk pages are protected may wish to have an unprotected user talk subpage linked conspicuously from their main talk page to allow good-faith comments from users that the protection restricts editing from.\nA user's request to have their own talk page protected is not a sufficient rationale by itself to protect the page, although requests may be considered if a reason is provided.\n\nBlocked users\nBlocked users' user talk pages should not ordinarily be protected, as this interferes with the user's ability to contest their block through the normal process. It also prevents others from being able to use the talk page to communicate with the blocked editor.\nIn extreme cases of abuse by the blocked user, such as abuse of the {{unblock}} template, re-blocking the user with talk page access removed should be preferred over applying protection to the page. If the user has been blocked and with the ability to edit their user talk page disabled, they should be informed of this in a block notice, subsequent notice, or message, and it should include information and instructions for appealing their block off-wiki, such as through the UTRS tool interface or, as a last recourse, the Arbitration Committee.\nWhen required, protection should be implemented for only a brief period, not exceeding the duration of the block.\nConfirmed socks of registered users should be dealt with in accordance with Wikipedia:Sockpuppetry; their pages are not normally protected.\n\nUser pages\nShortcutsWP:UPROTWP:UPPROT\nBase user pages (for example, the page User:Example, and not User:Example/subpage or User talk:Example) are automatically protected from creation or editing by unconfirmed accounts and anonymous IP users. An exception to this includes an unconfirmed registered account attempting to create or edit their own user page. IP editors and unconfirmed accounts are also unable to create or edit user pages that do not belong to a currently-registered account. This protection is enforced by an edit filter.[11] Users may opt-out of this protection by placing {{unlocked userpage}} anywhere on their own user page.\nUser pages and subpages within their own user space may be protected upon a request from the user, as long as a need exists. Pages within the user space should not be automatically or pre-emptively protected without good reason or cause.[12][13] Requests for protection specifically at uncommon levels (such as template protection) may be granted if the user has expressed a genuine and realistic need.\nWhen a filter is insufficient to stop user page vandalism, a user may choose to create a \".css\" subpage (ex. User:Example/Userpage.css), copy all the contents of their user page onto the subpage, transclude the subpage by putting {{User:Example/Userpage.css}} on their user page, and then ask an administrator to fully protect their user page. Because user space pages that end in \".css\", \".js\", and \".json\" are editable only by the user to which that user space belongs (and interface administrators), this will protect your user page from further vandalism.\n\nDeceased users\nSee also: Wikipedia:Deceased Wikipedians/Guidelines\nIn the event of the confirmed death of a user, the user's user page (but not the user talk page) should be fully protected.\n\nProtection of templates\nShortcutWP:PTPROT\nSee also: Wikipedia:High-risk templates and Wikipedia:Template documentation\nHighly visible templates, which are used on an extremely large number of pages or substituted with great frequency, are often semi-, template-, or fully-protected based on the degree of visibility, type of use, content, etc.\nProtected templates should normally have the {{documentation}} template. It loads the unprotected /doc page, so that non-admins and IP-users can edit the documentation, categories and interwiki links. It also automatically adds {{pp-template}} to protected templates, which displays a small padlock in the top right corner and categorizes the template as protected. Only manually add {{pp-template}} to protected templates that don't use {{documentation}} (mostly the flag templates).\nCascading protection should generally not be applied directly to templates, as it will not protect transclusions inside <includeonly> tags or transclusions that depend on template parameters, but will protect the template's documentation subpage. Instead, consider any of the following:\n\nIf the set of subtemplates is static (even if large), protect them using normal protection mechanisms.\nIf the set of subtemplates is unbounded, use MediaWiki:Titleblacklist to protect all subtemplates using a particular naming format (as is done for editnotice templates and subtemplates of Template:TFA title).\nNote: All editnotice templates (except those in userspace) are already protected via MediaWiki:Titleblacklist. They can be edited by admins, template editors and page movers only.\n\nSandboxes\nSee also: Wikipedia:About the Sandbox\nSandboxes should not ordinarily be protected since their purpose is to let new users test and experiment with wiki syntax. Most sandboxes are automatically cleaned every 12 hours, although they are frequently overwritten by other testing users. The Wikipedia:Sandbox is cleaned every hour. Those who use sandboxes for malicious purposes, or to violate policies such as no personal attacks, civility, or copyrights, should instead be warned and/or blocked.\n\nAvailable templates\nThe following templates may be added at the very top of a page to indicate that it is protected:\n\nProtection templates Edit Move Pending changes Upload Generic {{pp}} {{pp-protected}} {{pp}} {{pp-move}} {{pp}} {{pp-pc}} {{pp}} {{pp-upload}} BLP {{pp-blp}} – – – Dispute {{pp-dispute}} {{pp-move-dispute}} – – Extended confirmed protection {{pp-extended}} {{pp-extended}} – – Main Page Image {{pp-main-page}} – – – Office {{pp-office}} {{pp-reset}} {{pp-office-dmca}} {{pp-office}} {{pp-reset}} {{pp-office-dmca}} {{pp-office}} {{pp-reset}} {{pp-office-dmca}} – Sockpuppetry {{pp-sock}} – – – High-visibility {{pp-template}} – – – Blocked user's talk {{pp-usertalk}} – – – Vandalism {{pp-vandalism}} {{pp-move-vandalism}} – – Talk page {{permanently protected}} {{temporarily protected}} – – – Long-term {{pp-semi-indef}} {{pp-move-indef}} – –Module:Protection banner\nOn redirect pages, use the {{Redirect category shell}} template, which automatically categorizes by protection level, below the redirect line. A protection template may also be added below the redirect line, but it will serve only to categorize the page, as it will not be visible on the page, and it will have to be manually removed when protection is removed.\n\nSee also\nMediaWiki:Protectedpagetext\nSpecial:Protectedpages\nSpecial:Protectedtitles\nWikipedia:Edit lock\nWikipedia:List of indefinitely protected pages\nWikipedia:Requests for page protection\nWikipedia:Rough guide to semi-protection\nWikipedia:Make protection requests sparingly, an essay\nm:Protected pages considered harmful\nm:The Wrong Version\nWikipedia:Protection policy/Padlocks\nNotes\n\n\n^ Created October 2013 as a result of Wikipedia:Requests for comment/Template editor user right‎\n\n^ a b Wikipedia:Requests for comment/Extended confirmed protection policy 2\n\n^  Wikipedia:Requests for comment/Extended confirmed protection policy\n\n^ Wikipedia:Arbitration/Requests/Case/Palestine-Israel articles 4#ARBPIA General Sanctions (Note: This sanction was originally authorised in Wikipedia:Arbitration/Requests/Case/Palestine-Israel articles 3).\n\n^ Arbitration motions regarding extended confirmed protection\n\n^ Wikipedia:Village pump (proposals)/Archive 129#New usergroup with autopromotion to implement arbitration \"30-500\" bans as a page protection\n\n^ AN discussion authorizing India-Pakistan general prohibition\n\n^ Antisemitism in Poland: Motion (May 2020)\n\n^ Wikipedia talk:Protection Policy discussion to remove manual posting requirement\n\n^ VPR RfC to remove PC2\n\n^ Please refer to Wikipedia:Requests for comment/Protect user pages by default and its talk page for community discussion related to a preventative measure for user pages.\n\n^ Per discussion at Wikipedia talk:Protection policy/Archive 15#Own userspace pages protection policy, June 2013\n\n^ Per discussion at Wikipedia:Administrators' noticeboard/Archive314#Protecting an editor's user page or user space per their request, September 2019\n\n\nvteAdministrators' guideArticles\nAdvice for new administrators\nBlocking\nCleaning backlogs\nDealing with disputes\nDealing with spam\nDeleting\nEdit filters\nFixing cut-and-paste moves\nGranting and revoking user rights\nProtecting\nReading list\nRollback\nTools, scripts and gadgets\nViewing deleted pages and contributions\nPolicies\nAdministrator policy (WP:ADMIN)\nBanning policy (WP:BAN)\nBlocking policy (WP:BLOCK)\nDeletion policy (WP:DEL)\nProtection policy (WP:PROTECT)\nRevision deletion policy (WP:REVDEL)\n\nvteWikipedia key policies and guidelines (?)\nFive pillars\nIgnore all rules\nContent (?)P\nVerifiability\nNo original research\nNeutral point of view\nWhat Wikipedia is not\nBiographies of living persons\nCopyright (Copyright violations)\nImage use\nArticle titles\nG\nNotability\nAutobiography\nCiting sources\nReliable sources\nmedicine\nDo not include copies of lengthy primary sources\nPlagiarism\nDon't create hoaxes\nFringe theories\nPatent nonsense\nExternal links\nConduct (?)P\nCivility\nConsensus\nHarassment\nVandalism\nIgnore all rules\nNo personal attacks\nOwnership of content\nEdit warring\nDispute resolution\nSockpuppetry\nNo legal threats\nChild protection\nPaid-contribution disclosure\nG\nAssume good faith\nConflict of interest\nDisruptive editing\nDo not disrupt Wikipedia to illustrate a point\nEtiquette\nGaming the system\nPlease do not bite the newcomers\nCourtesy vanishing\nResponding to threats of harm\nTalk page guidelines\nSignatures\nDeletion (?)P\nDeletion policy\nProposed deletion\nBiographies\nBooks\nCriteria for speedy deletion\nAttack page\nOversight\nRevision deletion\nEnforcement (?)P\nAdministrators\nBanning\nBlocking\nPage protection\nEditing (?)P\nEditing policy\nG\nArticle size\nBe bold\nDisambiguation\nHatnotes\nBroad-concept article\nUnderstandability\nStyle\nManual of Style\nContents\nAccessibility\nDates and numbers\nImages\nLayout\nLead section\nLinking\nLists\nClassification\nCategories, lists, and navigation templates\nCategorization\nTemplate namespace\nProject content (?)G\nProject namespace\nWikiProjects\nUser pages\nUser boxes\nShortcuts\nSubpages\nWMF (?)P\nTerms of Use\nList of policies\nFriendly space policy\nLicensing and copyright\nPrivacy policy\n\nList of all policies and guidelines\nP: List of policies\nG: List of guidelines\nSummaries of values and principles\n\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Wikipedia:Protection_policy&oldid=1020593394\"\nCategories: Wikipedia policiesWikipedia enforcement policiesWikipedia Administrators' guideWikipedia vandalismWikipedia page protectionHidden categories: Project pages with short descriptionWikipedia move-protected project pagesWikipedia semi-protected project pagesPages with missing files\n\n\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nNot logged inTalkContributionsCreate accountLog in\n\n\n\n\n\nNamespaces\n\n\nProject pageTalk\n\n\n\n\n\nVariants\n\n\n\n\n\n\n\n\n\nViews\n\n\nReadView sourceView history\n\n\n\n\n\nMore\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\nContribute\n\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationWikidata item\n\n\n\n\nPrint/export\n\n\nDownload as PDFPrintable version\n\n\n\n\nIn other projects\n\n\nWikimedia CommonsMultilingual WikisourceWikibooksWikidataWikinewsWikiquoteWikisourceWikiversityWikivoyageWiktionary\n\n\n\n\nLanguages\n\n\nAfrikaansÆngliscالعربيةAragonésঅসমীয়াAzərbaycancaتۆرکجهবাংলাБеларуская (тарашкевіца)БългарскиBosanskiCatalàCebuanoČeštinaCymraegDanskDeutschދިވެހިބަސްEestiΕλληνικάEspañolEsperantoفارسیFøroysktFrançaisGalego한국어Հայերենहिन्दीHrvatskiIlokanoBahasa IndonesiaÍslenskaItalianoעבריתJawaქართულიKurdîLatinaLëtzebuergeschLietuviųMagyarМакедонскиMaltiमराठीმარგალურიمصرىBahasa MelayuМонголမြန်မာဘာသာNederlandsनेपाली日本語Norsk bokmålଓଡ଼ିଆOʻzbekcha/ўзбекчаភាសាខ្មែរPolskiPortuguêsRomânăРусскийСаха тылаSängöSarduසිංහලSimple EnglishسنڌيSlovenčinaSlovenščinaSoomaaligaکوردیСрпски / srpskiSundaSuomiSvenskaதமிழ்తెలుగుไทยTürkçeУдмуртУкраїнськаاردوVènetoTiếng Việtייִדיש粵語中文\nEdit links\n\n\n\n\n\n\n This page was last edited on 29 April 2021, at 23:12 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n"