"Plate-forme Messenger Cas d’utilisation  Gén. prospects  Commerce  Service client  Solutions  Success Stories  Trouver un partenaire  Documentation pour les développeurs  Sécurité Acquérir des clientsGénération de prospectsMessenger permet aux clients potentiels de communiquer facilement avec votre entreprise de n’importe où et à tout moment.Une erreur s’est produiteNous rencontrons des difficultés pour lire cette vidéo.En savoir plusCommodité Les éléments de conversation tels que les réponses rapides et les modèles de message aident les gens à créer des liens avec votre entreprise. Compatibilité Les prospects attirés dans Messenger peuvent être intégrés à des solutions existantes, comme votre CRM ou votre fournisseur de discussion instantanée. Persistance Les fils Messenger sont persistants sur plusieurs plates-formes et appareils. Pas besoin de changer de canal, vous pouvez continuer à entretenir vos relations avec vos prospects directement dans Messenger. La génération de prospects dans Messenger+12 %de personnes ont réalisé des devis dans Messenger par rapport au site web de l’entreprise-23 %de réduction du coût par prospect par rapport aux publicités sur les autres plates-formes numériquesHaven Life est une agence spécialisée dans les assurances vie qui propose un outil permettant d’obtenir des estimations des taux avant d’acheter une police, le tout par l’intermédiaire de Messenger.Pour toucher des clients potentiels à grande échelle, Haven Life a créé des publicités qui automatisaient la collecte de prospects dans Messenger, en exploitant les outils de ciblage de Facebook tels que les audiences similaires. En réitérant son expérience, l’entreprise a pu découvrir ce qui intéressait le plus les gens, puis adapter son contenu publicitaire tout au long de la campagne afin de générer de meilleurs résultats.La campagne d’une durée d’un mois a permis à Haven Life d’obtenir des insights et des analyses utiles. L’entreprise a généré d’excellents résultats, notamment une réduction du coût par prospect par rapport aux publicités sur les autres plates-formes numériques.Afficher les solutions pour la génération de prospectsGénérer des prospects grâce aux publicitésCréez des flux de génération de prospects simples pour Messenger à l’aide du Gestionnaire de publicités.Effort faibleCommencer à générer des prospects grâce aux publicitésRelancez vos clients en utilisant des publicitésFaites découvrir à vos clients votre expérience Messenger en utilisant nos produits publicitaires.Effort faibleAnnuaire des partenairesLancez-vousAugmenter la qualité des prospects en utilisant Messenger+42 %de hausse de la qualité des prospects par rapport aux autres plates-formes numériques59,7 %des prospects issus de Facebook sont de qualité, un pourcentage supérieur à tous les autres canaux+21 %de hausse des services après-vente par rapport aux autres canauxPour attirer de manière créative les bons clients, Audi Taïwan a décidé d’explorer les publicités renvoyant vers Messenger. Audi Taïwan a élaboré une série de publicités vidéo contenant un appel à l’action clair afin de lancer une conversation dans Messenger.En cliquant, les gens pouvaient en apprendre plus sur les voitures disponibles grâce à l’assistant mobile Audi et aisément réserver un essai sur route sans avoir à décrocher leur téléphone ou à envoyer un e-mail.Avec l’aide de son agence de pub PHD, Audi Taïwan a diffusé ces publicités auprès des personnes intéressées par les voitures. La marque a également montré les publicités à des audiences personnalisées composées des personnes ayant aimé sa Page Facebook et de celles qui avaient visionné sa vidéo promotionnelle. Elle a ensuite créé des audiences similaires à partir des gens qui avaient regardé ses publicités vidéo afin de toucher encore plus de clients potentiels.En utilisant Messenger comme portail, Audi Taïwan a pu communiquer efficacement avec les gens intéressés, susciter des conversations dynamiques à propos de ses voitures et proposer une expérience mobile fluide et optimisée à ses clients potentiels. La marque a ainsi généré une hausse de 42 % des prospects de qualité par rapport aux autres plates-formes numériques.Afficher les solutions pour la génération de prospectsPoints d’entrée MessengerVos clients peuvent accéder à votre expérience Messenger depuis plusieurs points d’entrée, notamment un plugin sur votre site web, votre Page Facebook, des publicités renvoyant vers Messenger et des liens m.me.Effort faibleAnnuaire des partenairesLancez-vousComment Messenger communique avec vos clientsPlugin de discussionLe plugin de discussion de Facebook permet aux gens de démarrer facilement des conversations avec votre entreprise tout en parcourant votre site web.Page FacebookFaites en sorte que les gens puissent vous contacter facilement en ajoutant un appel à l’action « Envoyer un message » à votre Page ou vos publications de Page.Publicités renvoyant vers MessengerLancez des conversations à grande échelle grâce aux publicités renvoyant vers Messenger.Liens m.meDémarrez des conversations à partir d’hyperliens que vous pouvez ajouter à des e-mails, messages, publications de médias sociaux et plus encore.Codes QRLes codes QR permettent de démarrer facilement des conversations dans Messenger depuis des emplacements hors ligne comme la signalétique en magasin, les emballages de produits, le publipostage et plus encore.Cas d’utilisation supplémentairesEn savoir plus sur le lancement de conversations dans Messenger.CommerceEn savoir plusService clientEn savoir plusSuccess StoryLearn how a retailer built a Messenger-powered automated assistant that led to a 5x conversion rate increase. Read MoreSolutions MessengerCe sont les éléments de base de votre expérience Messenger. Que vous cherchiez à générer des prospects, à stimuler les ventes ou à proposer un service clientèle, nous avons les solutions dont vous avez besoin.Découvrir les solutionsTrouver un développeur partenaireNotre annuaire des partenaires vous aidera à trouver un développeur partenaire ayant de l’expérience dans la création de solutions Messenger.Annuaire des partenairesLancez-vousNotre documentation pour les développeurs contient les informations dont vous avez besoin pour vous lancer avec Messenger.Documentation pour les développeurs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"