"SalonsFonctionnalitésConfidentialité et sécuritéFacebook For DevelopersVotre expérience Messenger, votre contrôleVotre expérience Messenger, votre contrôleVotre expérience Messenger, votre contrôleProtégez votre vie privéeIl vous revient de choisir à qui parler et de décider quoi partager. Nous sommes déterminés à faire de Messenger un endroit sûr, sécurisé et privé vous permettant de communiquer avec vos proches. Pour ce faire, nous avons développé des outils qui vous aident à garder le contrôle, à sécuriser votre compte et à être en sécurité sur la plate-forme.PROTECTION DE VOS INFORMATIONSVos messages sont personnels.Nous voulons que vous sachiez quelles informations nous recueillons et comment nous les utilisons. Nous n’utilisons aucun contenu de vos messages mentionnant d’autres personnes à des fins de marketing publicitaire. Les annonceurs ne peuvent donc pas vous cibler en fonction de ce que vous dites dans vos messages. Comme sur les autres services Facebook, nous recueillons des informations depuis Messenger pour vous offrir ce service, améliorer l’expérience avec le produit et protéger les utilisateurs.En savoir plusCOMBATTRE LE PIRATAGENos équipes d’experts travaillent sans relâche pour détecter les pirates informatiques et les empêcher d’accéder à vos messages et informations personnelles.Nous mettons également ces outils à disposition pour vous aider à sécuriser votre compte :Authentification à deux facteursCette fonctionnalité améliore la sécurité de votre compte et vous aide à vous protéger contre les tentatives de piratage et de hameçonnage, même si votre mot de passe est compromis.En savoir plusAlertes de connexionProtégez votre compte des menaces et attaques potentielles en activant les alertes de connexion. Vous recevrez une alerte si nous détectons des connexions ou des tentatives de connexion non reconnues.En savoir plusInvitations par message plus sûresNous avons simplifié le blocage et la suppression des nouvelles invitations par message. Pour renforcer votre sécurité, nous masquons ou floutons également les images et désactivons les liens des messages, sauf si vous y répondez ou copiez-collez les liens dans un autre onglet du navigateur.En savoir plusASSURER VOTRE SÉCURITÉUne plate-forme sûre est essentielle pour vous permettre d’échanger en toute confiance avec vos proches.C’est pourquoi nous œuvrons sans relâche à stopper toute activité malveillante avant qu’elle ne vous touche. Voici ce que nous mettons en place pour protéger votre vie privée, votre sécurité et votre bien-être sur Messenger :ASSURER VOTRE SÉCURITÉUne plate-forme sûre est essentielle pour vous permettre d’échanger en toute confiance avec vos proches.C’est pourquoi nous œuvrons sans relâche à stopper toute activité malveillante avant qu’elle ne vous touche.Voici ce que nous mettons en place pour protéger votre vie privée, votre sécurité et votre bien-être sur Messenger :Neutraliser les arnaquesNous filtrons les messages potentiellement nuisibles, pour qu’ils n’atteignent pas votre messagerie. Des avis de sécurité peuvent s’afficher dans vos discussions pour vous aider à repérer des arnaques ou des imposteurs potentiels et vous proposer des moyens d’agir, par exemple en bloquant le compte.Supprimer les faux comptesNous détectons et bloquons chaque jour des millions de faux comptes sur Facebook, pour nous assurer que votre expérience Messenger reste sûre et sécurisée. La majorité de ces comptes sont repérés quelques minutes après leur création, avant même qu’ils puissent commencer à nuire.S’appuyer sur l’IANous faisons appel à l’intelligence artificielle pour identifier les comportements inhabituels associés aux arnaques, au hameçonnage et à d’autres activités nuisibles afin de les supprimer de notre plate-forme. Nous améliorons régulièrement notre technologie pour l’adapter à l’évolution des activités nuisibles.Repérer les imposteursLe badge bleu sur Messenger vous permet de vous assurer que le compte avec lequel vous échangez est authentique, et contribue à empêcher les arnaqueurs de se faire passer pour des personnalités publiques, des entreprises de média ou des marques.Réduire la diffusion de la désinformationPour réduire la diffusion des fausses informations virales et du contenu néfaste, nous limitons le nombre de discussions dans lesquelles un message peut être simultanément transféré. Nous avons également mis en place des mesures de protection supplémentaires pour bloquer les contenus identifiés comme véhiculant de fausses informations sur Facebook et partagés directement dans Messenger. Pour en savoir plus, consultez l’article Comment Facebook protège les élections.Protection renforcée pour les mineursProtéger les mineurs sur nos plates-formes est l’une de nos principales responsabilités. Nous proposons des fonctionnalités de sécurité renforcées pour les enfants de moins de 18 ans (limitation des utilisateurs pouvant leur envoyer un message et de la façon dont ils apparaissent dans la recherche) et leur offrons des conseils pédagogiques. Nous utilisons également le machine learning pour détecter et désactiver les comptes qui interagissent de manière inappropriée avec des enfants.Consulter le portail pour les parentsLivres blancs techniquesPour obtenir des explications techniques détaillées concernant nos outils et technologies, consultez nos livres blancs téléchargeables grâce au lien suivant :Conversations secrètes Messenger : livre blanc techniqueRessources supplémentaires Messenger Kids  Confidentialité et sécurité sur Facebook  Centre de sécurité Facebook  Conditions et règlements de Facebook  Messenger et le coronavirus  Messenger Kids  Confidentialité et sécurité sur Facebook  Centre de sécurité Facebook  Conditions et règlements de Facebook  Messenger et le coronavirus  Messenger Kids  Confidentialité et sécurité sur Facebook  Centre de sécurité Facebook  Conditions et règlements de Facebook  Messenger et le coronavirus  © Facebook 2021.  Les logos Apple et Google Play sont des marques déposées appartenant à leurs titulaires respectifs. Politique d’utilisation des données Conditions généralesFrançais (France)Deutsch‎English (UK)‎English (US)‎Español (España)‎Español‎Français (France)‎Italiano‎日本語‎Polski‎Português (Brasil)‎Português (Portugal)‎ภาษาไทย‎Tiếng Việt‎Prochainement ! Envoyez des messages à vos amis Instagram directement depuis Messenger. En savoir plus.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"