"\n\n\n\n\n\n\nWikipedia:Perennial proposals\n\nFrom Wikipedia, the free encyclopedia\n\n\n\nJump to navigation\nJump to search\nlist of frequently rejected proposals on Wikipedia\n\"WP:PERENNIAL\" redirects here. It is not to be confused with Wikipedia:Reliable sources/Perennial sources (WP:RSP) or Wikipedia:External links/Perennial websites (WP:ELP).\nWikipedia information pageThis is an information page.It is not one of Wikipedia's policies or guidelines, but rather intends to describe some aspect(s) of Wikipedia's norms, customs, technicalities, or practices. It may reflect varying levels of consensus and vetting.ShortcutsWP:PERENWP:PERENNIALWP:FREQUENT\nCommon decisionsand arguments\nDeletion (XfD)\nArguments to avoid\nCommon outcomes (AfD)\nCommon outcomes (RfD)\nCommon outcomes (TfD)\nOvercategorisation\nPerennial deletion review\n\nAdminship (RfA) andBureaucratship (RfB)\nArguments to avoid\n\nArbitration (Arbcom)\nGuide to arbitration\nPrinciples\n\nProposals and policy\nPerennial proposals\nvte\nThis is a list of things that have frequently been proposed on Wikipedia, and have been rejected by the community several times in the past. It should be noted that merely listing something on this page does not mean it will never happen, but that it has been discussed before and never met consensus.  Consensus can change, and some proposals that remained on this page for a long time have finally been proposed in a way that reached consensus, but you should address rebuttals raised in the past if you make a proposal along these lines.  If you feel you would still like to do one of these proposals, then raise it at the Wikipedia:Village pump.\n\nContents\n\n1 Content\n\n1.1 Content warnings\n1.2 Censor offensive images\n1.3 Legal issues\n1.4 Advertising\n1.5 Enforce American or British spelling\n1.6 Only allow the truth in articles\n1.7 Define reliable sources\n1.8 Require or prefer free, online sources\n1.9 Require inline citations for everything\n1.10 Protect featured articles\n1.11 Move maintenance tags to talk pages\n1.12 Changes to standard appendices\n1.13 Allow non-commercial licensed content\n1.14 Protecting Today's Featured Article on the Main Page\n1.15 Establish a house citation style\n1.16 Add in-article credit for images\n1.17 Remove state from US placenames\n1.18 Redesign the Main Page\n1.19 Change the color of red links\n\n\n2 Editing\n\n2.1 Prohibit anonymous users from editing\n2.2 Automatically prompt for missing edit summary\n2.3 Usernames should contain only Latin characters\n\n\n3 Talk pages and discussions\n\n3.1 Prohibit removal of warnings\n3.2 Use a bot to welcome new users\n3.3 Disallow personalized signatures\n3.4 Allow discussion about the topic of the article\n\n\n4 Deletion\n\n4.1 Cap on nominations for deletion\n4.2 All authors must be notified of deletion\n4.3 Deleted pages should be visible\n4.4 Delete no-consensus AfDs for biographies of living persons\n4.5 Rename AFD\n4.6 Deletion of user accounts\n4.7 Delete unreferenced articles\n4.8 Grace period for deletion\n\n\n5 Adminship\n\n5.1 Too many questions at RfA\n5.2 Reconfirm administrators\n5.3 Hierarchical structures\n5.4 Prerequisites for adminship\n5.5 Community-based process for removing adminship\n5.6 Grant non-admins admin functions within their user space\n5.7 Administrators should be of the age of majority\n5.8 Automatically grant adminship to users with a certain number of edits or time editing\n5.9 There should be suffrage requirements for RfA\n\n\n6 Technical\n\n6.1 Watchlist changes\n\n6.1.1 Multiple watchlists\n6.1.2 Public watchlists\n6.1.3 Allow watchlisting individual sections of a page\n\n\n6.2 Use reCAPTCHA\n6.3 Create shortcut namespace aliases for various namespaces\n6.4 Move the Main Page to another namespace, such as \"Wikipedia:\" or \"Portal:\"\n6.5 Share pages on Facebook, Twitter etc.\n\n\n7 See also\n8 Notes\n\n\nContent[edit]\nContent warnings[edit]\nProposal: Certain Wikipedia pages should display content warnings or disclaimers, such as \"This article contains sexually explicit images\" or \"This article is not suitable for children\".\nReasons for previous rejection: All Wikipedia pages contain a link to the Wikipedia:General disclaimer page, where you can access the content, legal, medical and risk disclaimers. See the \"Disclaimers\" link at the bottom of this page. In addition, Wikipedia is not censored for the protection of minors. Our mission is to document human knowledge, no matter how unpleasant or offensive it may be to some people. It is impossible to draw a line between \"offensive\" and \"non-offensive\" content that satisfies all cultural, religious and political norms. Any page could conceivably be offensive to somebody.  Furthermore, once a page has loaded, the disclaimer is often too late.\nSee also: Wikipedia:No disclaimers in articles.\nCensor offensive images[edit]\nProposal: Images of a sexual, obscene, emotionally disturbing, religiously offensive or disgusting nature should be hidden from all users or even deleted entirely.\nReasons for previous rejection: Wikipedia is not censored. In an encyclopedia, it is expected that articles on sexual subjects should be illustrated as such. In addition, standards about what is and is not acceptable for pictures vary widely between cultures.\nSee also: Help:Options to hide an image for instructions on how to suppress images. m:2010 Wikimedia Study of Controversial Content proposes user-configurable options.  In August 2011, a referendum on how to permit users to suppress types of images they personally deem unwanted was begun at m:Image filter referendum/en.\nLegal issues[edit]\nProposal: Because of such-and-such law, Wikipedia must do so-and-so (e.g. implement censorship as above, or require identification of editors, or defer certain rulings to the U.S. Supreme Court).\nReasons for previous rejection: The Wikimedia Foundation employs legal counsel to advise on whether and when such measures are necessary, and editors may rest assured that appropriate Wikipedia policies will inform them of any such needed measures, such as removal of copyrighted material.\nSee also: Wikipedia:Office actions and CAT:LEGAL.\nAdvertising[edit]\nProposal: To cover server costs, or for some other public good such as charity, Wikipedia should add advertisements to its pages. The ads could be highly targeted, unobtrusive textual ads similar to those used by Google. Revenues would be very high based on Wikipedia's very high search engine ranking for many diverse keywords.\nReasons for previous rejection: Wikipedia is supposed to be neutral, which advertising by definition is not. Even if well segregated from article content, advertising could create an impression that our content is commercially influenced and that our content could be affected by advertisers threatening to withdraw their ads, whether or not this is actually the case. Advertising could discourage contributors, the lifeblood of Wikipedia, many of whom object strongly to advertising. Placing ads would also likely decrease the amount of money raised by community fundraising. Also, since we don't allow spam or advertising by users, doing it ourselves would be, at the very least, hypocritical. Finally, the financial situation of the Wikimedia Foundation, which hosts the website, is stable—there is no pressing need to make such a change.\nSee also: Wikipedia:Funding Wikipedia through advertisements; Spanish Wikipedia and Enciclopedia Libre.\nEnforce American or British spelling[edit]\nProposal: For consistency's sake, we should pick one style of spelling (American or British, generally), and enforce it throughout the site.\nReasons for previous rejection: It is wildly impractical and there is no agreement on which style should be chosen, which has in the past resulted in repeated, needless edit warring.\nSee also: Wikipedia:Manual of Style#National varieties of English, Wikipedia:Standardize spellings/Archive.\nOnly allow the truth in articles[edit]\nProposal: For a long time, the first sentence of Wikipedia:Verifiability stated, \"The threshold for inclusion is verifiability, not truth\".  This meant that the absolute minimum standard for including material in Wikipedia is that it be possible to verify it; the minimum standard for including material is not merely being true in the opinion of an editor.  The most common proposal is to require not only that all material be verifiable, but that all material also be true in the opinion of editors.  The second most common proposal is to require that material be either verifiable or true according to any editor.  It is usually motivated by a desire to reduce errors in Wikipedia or increase Wikipedia's scholarly reputation.\nReasons for previous rejection:  Wikipedia is supposed to be based on published reliable sources, not on the opinions or beliefs of editors.  The community refuses to let editors delete well-sourced material if they believe the sources are wrong or to include material merely because they personally believe the unpublished, unsourceable material to be true.  Adding unsourced material or deleting well-sourced material on the basis of editors' personal beliefs can result in biased, unbalanced articles and frequently does result in edit wars between editors with opposing personal beliefs.\nSee also: Wikipedia:Verifiability, not truth, Wikipedia:Editorial discretion, Wikipedia:Neutral point of view\nDefine reliable sources[edit]\nProposal: Wikipedia should define the reliability of particular types of sources so that no exceptions are possible, and only sources defined as reliable may be used for the verification of Wikipedia's content. Examples include changing Wikipedia:Reliable sources from a guideline to an official policy, or merging it with Wikipedia:Verifiability and/or Wikipedia:No original research.\nReasons for previous rejection: Assessing the reliability of sources requires sound editorial judgment, not strict adherence to a list of rules.  Whether a source is reliable depends on how the source relates to the material:  a very weak source may be reliable for a very small claim, such as \"this source was published\", while a very strong source will be deemed unreliable if the claim is unrelated to the source's contents (e.g., a source about electricity being cited for information about a celebrity).  Although it may be possible to define a minimum threshold below which sources are never acceptable as reference for Wikipedia content, it appears presumptuous to define all sources above that threshold as \"reliable\". For this reason, a universally applicable (or: policy-level) definition of reliable sources is impractical. Furthermore, strict rules about what type of source is permitted amount to instruction creep.\nPartly done: Editors can assess the reliability of sources at Wikipedia:Reliable sources/Noticeboard, and frequently discussed sources are indexed at Wikipedia:Reliable sources/Perennial sources. Strong community consensus results in a source being classified as \"generally reliable\" or \"generally unreliable\", but exceptions are possible depending on context and consensus can change.\nSee also: Wikipedia talk:Reliable sources (and/or many archives of that page); Wikipedia:Attribution/Poll, which dealt with an attempted merger of the verifiability, no original research and reliable sources pages into a single official policy.\nRequire or prefer free, online sources[edit]\nShortcutWP:FUTON\nProposal: Editors should use sources that anyone can read immediately, without cost.\nReasons for previous rejection: Editors should use the best sources available to them, regardless of cost or format.  The content policies require that it be possible for someone to verify a given statement—not that it be quick, easy, and free for you to verify it.  A \"replacement\" source that is available online and/or without cost is not identical to the first source, and therefore is never truly equal in all particulars.  Many academic journals eventually release papers, and more books are being digitized, so \"unavailable\" sources may become freely available later.  What appears to be free in your country or computer network may not be free everywhere.[1]  Wikipedia already has a systemic bias in favor of freely available online sources (called the FUTON bias) that are written in English; this bias may distort its contents, and institutionalizing such a recommendation would only further exacerbate this bias.\nSee also: Wikipedia:Verifiability#Access to sources and Wikipedia:Reliable sources/Cost\nRequire inline citations for everything[edit]\nProposal: Every sentence (or paragraph) should be followed by an inline citation that supports it.  Any material added without a reliable source should be promptly removed.  All articles without references should be deleted, regardless of whether Wikipedia should have an article on that subject.  All use of general references should be banned.\nReasons for previous rejection: The policy is that material must be verifiable, that is, that it must be possible for someone to name a reliable source that supports it.  Sourcing policies require inline citations only for four types of material, and there is no deadline for supplying these citations.  Inline citations are not required for material everyone agrees is obvious.  The editing policy requires editors to preserve appropriate, encyclopedic information, which often means adding citations to reliable sources for editors who did not name sources at the time the material was added.  Increasing the requirements discourages new editors.  Increasing the requirements mindlessly would destroy most of Wikipedia's content.\nSee also:  #Delete unreferenced articles, below\nProtect featured articles[edit]\nProposal: To maintain their high quality, featured articles should be permanently protected or semi-protected. Alternatively, featured articles could be split into two pages: a protected page showing the article as it appeared when originally promoted, and a separate \"Draft\" version for any future editing the articles may need.\nReasons for previous rejection:\nFeatured articles often improve over time, rather than deteriorate. Although a featured article \"exemplifies our very best work and features professional standards of writing and presentation\",[2] there is, and always will be, room for further improvement.\nFeatured articles are not \"finished\" articles. Not only do they need further editing in response to changes in the topic itself, our standards for featured articles change over time. For example, in Wikipedia's early days most featured articles did not use inline citations. Today, a proposal to promote such an article to \"featured\" status would have no chance of surviving a featured article discussion.\nWhile some featured articles deteriorate in quality, this is not a widespread problem. Since the featured article program began in 2004, 21% of promoted articles have been de-featured as of 2008,[3]  and this is mainly due to increased requirements.\nIn regard to vandalism, our featured articles are not specifically targeted by vandals, and are among the most-watched pages on Wikipedia. Short-term semi-protection and blocks are more than adequate to deal with featured article vandalism.\nA link to the \"originally featured version\" is already available on the talk page.\nSee also: #Protecting Today's Featured Article on the Main Page, below\nMove maintenance tags to talk pages[edit]\nProposal: Move maintenance tags such as {{cleanup}} and {{POV-check}} from the head of article pages to the article talk pages.  Some proposals recommend all tags be moved, and others only propose moving some tags.  Moving templates would reduce self-references to Wikipedia, reduce clutter, and reserve article space for information about the subject.\nReasons for previous rejection: Every reader is a potential editor and the maintenance tags give potential editors ideas of how to improve an article. Some tags also serve as warnings to readers about potentially problematic and low-quality content.  The {{ambox}} \"meta-template\" used by the templates means that they are not nearly as cluttered-looking as they were before 2007. The implementation costs would be large: About a million articles have maintenance tags, and moving them all to talk pages would be a massive undertaking, even using a bot or spreading the work out over many months. The documentation on all the templates, several editing help pages, and any bot or script that edits or reads maintenance tags would have to be updated manually.\nPartly done In November 2013 orphan tags were moved to talk pages.\nPrevious discussions: September 2010, November 2009, January 2009, December 2008, October 2008, March 2008, October 2007\nChanges to standard appendices[edit]\nProposal: The standard appendices at the end of an article (e.g., See also, Notes, References, Further reading, and External links) should be changed to the system preferred by the editor/a particular professional field/the editor's school. These proposals may involve changing the names of the sections (e.g., changing References to Sources or Bibliography), changing the order of the sections (e.g., putting External links first, or References last), or changing the formatting (e.g., long lists of references should be hidden in a scrolling box).\nReasons for previous rejection: Policies and guidelines document \"actual good practices\".[4] Most proposals fail to demonstrate that their proposed practice is an emerging, sustainable alternative to the current de facto method. These guidelines only seek to document the status quo and not to change it.  The See also precedes the References, Further reading, and External links; the reason for the existing order follows a logical progression from on-wiki to off-wiki information.  About the names of the section headings, different academic fields use different terms, and Wikipedia editors do not want to impose the convention preferred by one academic discipline on articles in another discipline.[5]\nSee also: WP:ORDER. Many discussions in the archives of Wikipedia talk:Layout.\nAllow non-commercial licensed content[edit]\nProposal: Allow uploading and use of media which is licensed under a non-commercial license (such as Creative Commons Attribution-Noncommercial).\nReasons for previous rejection: Could cause confusion, in that reusers may not realize that they cannot use for any purpose.[1]\nSee also: Jimbo's original edict against NC media; Wikipedia:Non-free content\nProtecting Today's Featured Article on the Main Page[edit]\nProposal: Today's Featured Article that is linked from the Main Page should be either fully protected or semi protected to prevent vandalism and ensure that all visitors get a good impression of Wikipedia.\nReasons for previous rejection: Wikipedia claims to be an \"Encyclopedia that anyone can edit\" so having the most viewed article every day protected would be contrary to that purpose.  Also, Today's Featured Article is always watched by many editors so any vandalism is quickly reverted.\nPartly done: TFA Protector Bot move-protects tomorrow's FA so only administrators can move it. There was formerly a guideline that said that TFA should generally never be protected, but that was rescinded in 2011.\nSee also: Wikipedia:Main Page featured article protection and Wikipedia:For and Against TFA protection for lengthy discussions\nEstablish a house citation style[edit]\nProposal: Wikipedia should establish a house citation style applicable to all articles. This would improve consistency between articles and/or make citing sources easier for new users. Past suggestions include an outside style guide/prescribed format (such as MLA or Harvard referencing), a system preferred by the user's school or teacher(s), and/or a unique style that would meet the specific needs of Wikipedia.\nReasons for previous rejection: If academics can't find a single system suitable for all fields, why would one system work for Wikipedia? An extreme amount of time and effort would be necessary to (1) develop, or even agree on, a comprehensive house style that covers most or all situations, and (2) implement it on all 6,295,374 articles with sources, even with the help of one or more bots. Any benefits of a single encyclopedia-wide house style pale in comparison to the massive scope of such an undertaking.\nSee also: Wikipedia:Centralized discussion/Citation discussion, Wikipedia:Citing sources#Variation in citation methods (shortcut: WP:CITEVAR)\nAdd in-article credit for images[edit]\nProposal: Wikipedia should include bylines or some other sort of in-article credit for images used in articles. It is sometimes also claimed this is required by CC-BY licenses.\nReasons for previous rejection:\nThese is no need to clutter articles with this information. Credit is already provided for the majority of images by linking them to the file description page, which includes authorship, licensing, and more. (The exceptions to this are CC0 and public domain images used as icons, where the file description page still exists but is sometimes not linked.)\nMaintaining these in-article credits would be a significant maintenance burden on our editors, so there should be a similarly significant advantage to doing it. Such advantage has not been evident.\nThe existing model of attribution has so far proven to be widely successful, despite resistance by a small number of copyright holders to allowing use of their images without in-article credit.\nMistaken credit of images taken from Wikipedia (e.g. crediting them to \"Wikipedia\" rather than the actual authors) is an issue, but it is not evident that this would be significantly affected by this proposal.\nIncluding in-article credits would increase the incentive for people to \"spam\" their images into articles in an attempt to use Wikipedia for free advertising.\nProminently crediting some images without crediting all, including the various icons used in maintenance templates, could itself prove problematic by seemingly valuing some people's contributions over others'. The same applies to prominently crediting image contributions without doing so for text contributions.\nAnd, specific to the CC-BY licenses:\nWhile the CC license deed (a lay summary, not legally binding) says attribution is to be provided \"in the manner specified by the author or licensor\", this does not mean that the author/licensor can require specific fonts, colors, wording, or placement of the credit. Looking at the actual license (the \"legal code\"), this seems to be referring to the author/licensor's ability to choose the name to be attributed, the title of the work, and the canonical URL for the work. The actual location and formatting of the attribution is merely required to be \"reasonable to the medium\" and \"at least as prominent as the credits for the other contributing authors\".\nThe assertion that linking to a file description page is not \"reasonable to the medium\" of a hypertext encyclopedia has not received any significant level of support.\nProviding in-article credit for some but not all images might possibly fall afoul of the CC-BY license's \"at least as prominent as the credits for the other contributing authors\" clause. And providing in-article credit for images and not text contributions may have the same problem; the fact that it is (usually) feasible to do this for images and not text does not factor into the CC-BY license's requirement.\nSee also: Wikipedia talk:Manual of Style/Captions#RfC: Requiring photo credits in footnotes for copyrighted images, Wikipedia:Village pump (proposals)/Archive 76#Attribution of images, Wikipedia:Village pump (proposals)/Archive 25#Photograph attribution in image captions, Wikipedia:Village pump (policy)/Archive 17#Requiring photo credits, Wikipedia:Village pump (policy)/Archive AK#Image attribution under CC-Attrib license\nRemove state from US placenames[edit]\nProposal: Remove the state from the titles of articles about unambiguously-named US places.  Example: Missoula, Montana → Missoula.\nReasons for previous rejection:\nReliable sources commonly append the state to placenames.\nAppending the state is common usage and sufficiently natural that it may be considered part of American English.\nRepeated or otherwise ambiguous placenames are very common in the US (e.g. Springfield); a majority would require disambiguation regardless of USPLACE.  Always appending the state produces a consistent and predictable set of titles.\nIncluding the state makes it clear that the article is about a US municipality, which can be helpful with lesser known places.\nPartly done: Twenty-nine significant US cities are exempted from the convention per AP style.\nRedesign the Main Page[edit]\nProposal: Revamp the look of the Main Page. The current design was implemented in March 2006 following several months of discussion by the community organized by the Usability WikiProject.\nReasons for previous rejection:  Although some consensus exists that certain changes are in order, no particular change or specific redesign has had consensus.\nNo consensus on what Main Page sections to add or remove.\nNo consensus on particular changes to the general layout.\nPartly done: Today's Featured List was added to the Main Page every Monday and Friday in 2011, and minor tweaks have been done since 2006.\nSee also: Wikipedia:Requests for comment/Main Page features, Wikipedia:Main Page design\nChange the color of red links[edit]\nProposal: Use any color except red to identify links to non-existent articles.  The usual reasons are that red is an aggressive color or that it is too easy to see.\nReasons for previous rejection:  Red has been used for so many years that its meaning is established among editors.  There is no evidence that red links are abused to make certain names or words stand out in an article.\nSee also: Help:Link color or User:Anomie/linkclassifier on how to change the color for your own account.\nEditing[edit]\nProhibit anonymous users from editing[edit]\nProposal: Everybody should register an account before editing; IP addresses are insufficient.\nReasons for previous rejection: A large portion of our good edits come from IP addresses;[6] positive experiences with initial IP edits lead users to create accounts who otherwise would not do so; software features disabling IPs from creating new articles or editing semiprotected ones are sufficient. According to Jimbo Wales, \"what is commonly called 'anonymous' editing is not particularly anonymous ... and there are good reasons to want vandals on IP numbers instead of accounts\". While about 97% of vandalism comes from anonymous users, about 76% or 82% of anonymous edits are intended to improve the encyclopedia. (Prohibiting IP edits would not eliminate 97% of all vandalism, because those inclined to vandalize could easily take the 10 seconds to register.) The ability of anyone to edit articles without registering is a Foundation issue.\nPartly done IP addresses have been unable to create pages in the main namespace since 2005, and are subject to other restrictions such as not being able to vote in RfAs.\nSee also: Wikipedia:Editors should be logged-in users, Wikipedia:IPs are human too, Wikipedia:Autoconfirmed article creation trial (new accounts shouldn't be allowed to create pages), and Prosecutor's fallacy.\nAutomatically prompt for missing edit summary[edit]\nProposal: When any editor is about to post an edit without an edit summary, they should automatically be reminded that no summary has been provided and given another opportunity to include one. (Registered users can set their accounts' Preferences to do this, but many users are not aware of this.)\nReasons for previous rejection: It's already an option in the user preferences, and forcing (or reminding) users to enter edit summaries may annoy them enough they will not save their (possibly constructive) edits.  Forcing users to type something in the edit summary box does not mean that they will provide accurate, honest, or useful edit summaries.  Manually added edit summaries also suppress the automatic edit summaries. Blank edit summaries are a good way to spot possible vandalism.\nPartly done: As said above, this is an option for account Preferences.\nSee also: Help:Preferences#Editing\nUsernames should contain only Latin characters[edit]\nProposal:  Proposals have included banning usernames that include symbols, Unicode characters, non-English alphabets, and/or any characters that are not easy to type on \"standard\" computer keyboards.\nReasons for previous rejection:  The notion of acceptable characters broadened to accommodate single user login rules.  Very few active users choose names that are difficult to type, so the problem is quite small.  Being able to type a name is not necessary, as names can be copied or ignored. Furthermore, banning non-Latin usernames would cause difficulty on Wikipedias in languages that do not use the Latin alphabet, as speakers of those languages may not be able to enter Latin characters with their keyboards and would have a difficult time in choosing a username.\nPartly done: Since 6 November 2017 no usernames are permitted to contain Unicode characters unrelated to writing, although usernames registered before that time were grandfathered in.\nSee also: Wikipedia:Signatures#Non-Latin_usernames on providing transliterations.  WP:UUN for the list of active accounts using Unicode characters.\nTalk pages and discussions[edit]\nProhibit removal of warnings[edit]\nProposal: Editors should be prohibited from removing warning templates from their talk page.\nReasons for previous rejection: Talk pages are not intended as a permanent record of a user's misbehavior. Warnings are frequently placed incorrectly or spuriously. Removal of warnings other than to archive them is strongly discouraged, but does constitute definitive proof that the warning was seen, and can still lead to escalated warnings. All warnings continue to be available in the page history regardless of whether or not they have been removed from the page's current revision. Revert warring to keep a warning on a user's talk page is disruptive and constitutes \"biting\" newcomers.\nPartly done: Users may not remove declined unblock requests regarding a currently active block, miscellany for deletion tags while the discussion is in progress, speedy deletion tags and requests for uninvolved administrator help, and templates and notes on anonymous IP user talk pages that indicate other users share the same IP address.\nSee also: Wikipedia:Centralized discussion/Removing warnings, WP:BLANKING\nUse a bot to welcome new users[edit]\nProposal: Some people get missed for weeks at a time, or never welcomed at all. Would it not be better to have a bot drop one of the welcome templates on newcomers' pages instead of depending upon volunteers of the welcoming committee?\nReasons for previous rejection: In general, this proposal comes up every few months at Wikipedia talk:Welcoming committee, the village pump, or the bot requests page. There are multiple reasons for rejection:\nIf a bot is used, it is cold and impersonal, and the bot is incapable of mentoring and assisting newcomers.\nMany vandals are exposed when an edit made by them receives extra scrutiny because their user or talk page shows as a redlink.\nThe bot would make thousands of pointless edits welcoming vandals and accounts that never make an edit.\nPartly done: HostBot automatically delivers Teahouse invites to new users if:\nthey created their account within the past 36 hours and have since made at least 10 edits.\nthe user has not already received an invitation to visit the Teahouse\nthe user has not been blocked from editing at any point since joining\nthe user has not received a level 4 user warning\nSee also: Wikipedia:Bots/Frequently denied bots\nDisallow personalized signatures[edit]\nProposal: Editors should use only plain signatures. Personalized signatures (colored text, CSS, HTML, special characters, etc.) are inherently disruptive, draw too much attention to the user, are often poorly designed, and/or take up too much space in the edit window.\nReasons for previous rejection: Most custom signatures cause little or no trouble. In addition, they are popular throughout Wikipedia, and forcing users to give them up would create more trouble than it would be worth. It is better to deal with unacceptable signatures on a case-by-case basis than to issue a blanket prohibition that would anger many users, with few or no benefits. Furthermore, a user whose username uses non-Latin characters could use a custom signature to display an alternate name that English speakers could understand.\nSee also: Wikipedia:Signatures#Customizing your signature, User:Kephir/gadgets/unclutter.\nAllow discussion about the topic of the article[edit]\nProposal: People should be allowed to discuss the topic of the article on talk pages, instead of limiting discussion to improvement of the article. Or forums of some sort should be created to allow this, either on Wikipedia or elsewhere and linked from all articles.\nReasons for previous rejection: This conflicts with our mission at a fundamental level: our purpose is to create an encyclopedia, not to provide a place for people to hold random discussions on various topics. Similarly, we are not here to endorse any particular external sites for such discussion; people interested in finding such places should use a search engine. Additionally, hosting such discussions would require volunteers or staff to monitor and/or moderate these discussions, delete WP:BLP violations, block or ban disruptive users, and so on, which would reduce the time these people (likely Admins) have to spend on activities that do improve the encyclopedia. Occasionally it is claimed that these forums could provide a place for original research to be \"peer reviewed\"; this would nonetheless conflict with our policy WP:No original research, even if the \"peer review\" turned out to be much more rigorous than can be reasonably expected.\nSee also: Wikipedia:What Wikipedia is not#FORUM\nDeletion[edit]\nFurther information: Wikipedia:Deletion reform\nCap on nominations for deletion[edit]\nProposal: Something like \"people can only nominate three articles per day\", \"articles cannot be nominated more than once per year\", etc.\nReasons for previous rejection: Strict numerical limits fall under instruction creep. This is a solution in search of a problem (see Wikipedia:Don't stuff beans up your nose).\nSee also: Wikipedia:Revotes on Vfd, Wikipedia:Repeated AfD nomination limitation policy, and List of articles that have been nominated for deletion more than once.\nAll authors must be notified of deletion[edit]\nProposal: The first creator, or everybody who has contributed to an article, must be warned on their talk page of a deletion debate of that article.\nReasons for previous rejection: Excessive bureaucracy; people are expected to keep pages important to them on their watchlist. The \"first creator\" is meaningless for many articles, as this person may have long since left or made few contributions; \"everybody\" can number several hundred people, including those who have made trivial edits to the article and aren't concerned whether or not it's deleted. Regardless, editors are encouraged to notify the original author or the main contributors of an article when their article is nominated for deletion, as it is considered courteous; this is strictly optional. This puts fewer requirements for a deletion proposal than for a Featured Article review, for which all main contributors must be notified.\nDeleted pages should be visible[edit]\nProposal: Make deleted pages visible to everybody (or to all logged-in users), not just administrators.\nReasons for previous rejection: That defies the main point of deletion (which is to improve Wikipedia quality by getting rid of the worst parts); also, it would increase the workload of the Oversight body to ensure that copyright violations and libelous statements are not visible to everybody. The proposal to allow access to all deleted content has been explicitly vetoed by the Wikimedia Foundation legal counsel ([2]). If you have a plausible reason for seeing a particular page, then you can request a WP:REFUND. Wikipedia is written by its readers.\nNote: Some articles that are unsuitable in their present state but have potential are often turned into drafts for later improvement. Also, several long-standing deleted hoax articles are preserved (see Wikipedia:List of hoaxes on Wikipedia).\nNote: Deleted articles may be archived in the Wayback Machine or archive.today.\nSee also: Wikipedia:Viewing deleted articles\nFailed proposals:\nWikipedia:Village pump (proposals)/Persistent proposals/Straw poll for view-deleted\nDelete no-consensus AfDs for biographies of living persons[edit]\nProposal: Deletion discussions for biographies of living persons (BLPs) where there is no consensus for keeping the article should result in deletion.\nReasons for previous rejection: In articles that meet Wikipedia's criteria for inclusion, most BLP-related problems do not require deletion of the article. Policy on consensus requires consensus for deletion as well as for edits. (One exception: Biographies that are entirely negative in tone and unsourced are considered attack pages, which makes them eligible for speedy deletion under criterion G10.) and there is also \"sticky\" proposed deletion for BLP articles\nPartly done: A policy already exists to permit (not require) deletion of biographies of relatively unknown subjects when there is no consensus for keeping the article and the subject has requested deletion.\nRename AFD[edit]\nProposal: Change the name of WP:AFD from \"Articles for deletion\" to \"Articles for discussion\" in order to seem less confrontational and/or to match some other forums such as Redirects for discussion.  This usually assumes that Wikipedia:Proposed mergers and Wikipedia:Requested moves would be merged into AFD, as the equivalent processes are at the XFD \"for discussion\" pages.\nReasons for previous rejection: The purpose of AfD is in fact to decide whether or not to delete an article. Lesser issues such as mergers or renaming should be discussed on the talk page or at the separate merge and article title forums. Users should be made aware of the very real possibility that the article will in fact be deleted at the end of the discussion (the result for perhaps three-quarters of nominated articles).  AFD is already very large and would become even larger.\nNote:  This proposal was favorably received in 2009, but technical difficulties and inertia prevented the change; see Wikipedia talk:Articles for discussion/Proposal 1.\nDeletion of user accounts[edit]\nProposal: Allow users to have their own accounts deleted upon their request.\nReasons for previous rejection: This is currently a technical impossibility for both Wikipedia system operators and bureaucrats. Even if it was not technically impossible, there would still be legal limitations on the implementations of this idea, particularly violations of our CC-BY-SA 3.0 License and GFDL.  Alternatively users can delete their user page by adding {{db-userreq}} and can mark the talk page as inactive by adding {{retired}} to the top of the page. Users wishing to permanently leave can have a global renamer rename their account with a generic username not tied to them under courtesy vanishing.\nSee also: Wikipedia:Username policy#Deleting and merging accounts, mw:Extension:User Merge and Delete\nDelete unreferenced articles[edit]\nProposal: Wikipedia should automatically delete articles that do not cite at least one source, via speedy or proposed deletion. This may apply to all articles, newly created articles, or certain types of articles (BLPs, for example).\nReasons for previous rejection: Such a practice would \"bite\" new users and discourage them from becoming members of the community, as even good-faith contributions are immediately deleted or proposed for deletion. Keep in mind that not all users fully understand our policies and guidelines the minute they start editing. When a brand-new article is started without references, the creator, or another user, is often gathering sources to add later. Many users—both new and experienced—create stubs as a starting point, with the intention of developing them into full-fledged, well-sourced articles. Of course you are free to tag such pages, and to help clear the backlog of unsourced and poorly sourced articles, and articles with unsourced statements. However, a deletion process for unreferenced BLPs has been approved, see WP:BLPPROD.\nGrace period for deletion[edit]\nProposal: Pages should be immune to deletion for a certain amount of time after their creation and/or XFD/PROD/speedy nomination. This would give editors time to improve the page or convince editors of its subject's importance, and would help make Wikipedia more friendly and inviting for new users. There may be exceptions for copyright violations, attack pages, etc.\nReasons for previous rejection: PROD and XFD already have \"grace periods\" built in, so editors should have ample time to find sources or otherwise improve problematic articles, if possible. As for speedy deletion, our criteria are carefully written so that articles can be speedily deleted only if no Wikipedia-compliant article is possible at this time or the content is so dangerous to the encyclopedia it must be removed immediately. A mandatory grace period would also be excessively bureaucratic, and would make it more difficult to delete copyright violations and attack pages, even if there are exceptions for such cases. You can already request undeletion in your userspace in certain limited cases. If you believe a page was deleted mistakenly or out of process, you are free to request a deletion review.\nAdminship[edit]\nToo many questions at RfA[edit]\nProposal: Limit the number of questions asked at RfA, limit the types of questions asked, not allow additional questions to be asked, or ban canned questions.\nReason for previous rejection: RfA is a discussion and people may need to be able to ask questions they find pertinent towards making a decision.  People should be able to ask the questions they want/need to ask to make an assessment based upon their individual criteria.\nPartly done: In 2015, the community set a limit of two questions per editor.\nNote: While there has been no consensus to ban canned questions, they have routinely been criticized as being ineffective or adding little value to the process.\nReconfirm administrators[edit]\nProposal: Administrators should have their status reconfirmed through RFA or an RFA-like process, either periodically or on demand.\nReasons for previous rejection:\nThere are 1,096 administrators.  Periodically reconfirming them would be an onerous and time-consuming process.  For example, with annual reconfirmation, there would be 20+ reviews per week.  Endorsements of uncontroversial admins would consume much of the schedule, while the \"wait time\" to review admins who are controversial could be on the order of months.\nReconfirmation \"on demand\" has faced objections about potential abuse.  Although no proposal for mandatory reconfirmation has achieved consensus, some administrators have voluntarily joined Category:Wikipedia administrators open to recall, agreeing to stand for reconfirmation if requested to do so by a sufficient number of editors in good standing.\nThe Arbitration process can address problems that arise from accusations of administrator misconduct.\nSee also: Wikipedia:Requests for de-adminship#Proposed processes, User:SamuelTheGhost/Re-electing admins (a proposal), Wikipedia:Village pump (proposals)/Archive 70#Time limits on adminship, Wikipedia:Village pump (proposals)/Archive 97#Admin tenure, and Wikipedia:Requests for comment/Adminship term length.  Reconfirmation is done at some very small Wikipedias, such as the Norwegian Wikipedia, which had just 63 admins in 2013.\nHierarchical structures[edit]\nProposal: There should be some kind of \"partial admin\" that gets certain admin powers, but not all of them, such as only being allowed to block IP users or only being able to delete pages.  Or, new admins should undergo a probationary period, which may include limited abilities or desysopping on demand.\nReasons for previous rejection: The proposal doesn't solve any of the problems.\nIf we can't trust people to use their tools sensibly, they don't become admins. Period.\nA \"partial admin\" process would at least double the already considerable frictional effort expended at WP:RFA, as users debate who gets full administrator powers versus who gets only partial abilities.\nThe Wikimedia Foundation may require an RFA-style process to access some specific permissions anyway, such as viewing deleted revisions. Therefore, it does not make sense to have people go through one RFA to just get a subset of these tools and then later go through a second RFA if they want the full set of admin permissions.\nMany common problems require access to multiple tools (e.g., RevDel, blocking, and page protection for BLP vandalism).  Having only a small subset also results in non-optimal responses due to the Law of the instrument.  This means that a protection-only semi-admin, for example, would sometimes deploy page protection when a user block would be far more appropriate, because page protection is the only tool available to them.\nIt would also increase wasteful overhead, because even admins with the \"wrong\" powers would have to find, explain the situation to, and request help from someone with the correct power, instead of stopping the problem instantly themselves.\nIt's confusing.  People won't know who can deal with a problem, especially inexperienced users.\nPer the law of the instrument, partial admins will use the tool they have, which may not be the right tool for the situation. For example, they might protect a page because they are unable to block the user who is vandalizing it instead.\nPartly done: Several permissions are available to trustworthy non-admins upon request, such as rollback, page mover or protected template editing. See Wikipedia:Requests for permissions for a list and the application process.\nSee also: Discussions listed at Wikipedia:Unbundling administrators' powers.\nPrerequisites for adminship[edit]\nProposal: To reduce the number of failed RFAs, all candidates should meet certain requirements, such as a minimum edit count, contributions to featured content, or participation in internal Wikipedia processes like articles for deletion.\nReasons for previous rejection: While candidates with few edits and/or a lack of project-space contributions often fail per WP:SNOW or WP:NOTNOW, there are always exceptions. The encyclopedia should not lose out on a good candidate just because they have not achieved an arbitrary number of edits or does not frequent a particular area of the encyclopedia. Having a set minimum edit count may not lower the number of failed RfAs substantially, because an otherwise poor candidate could edit just for the sake of meeting the requirements. In addition, edit counts are not a reliable indicator of an editor's experience or competence. It is better to evaluate candidates on the quality of their contributions, not the quantity of their edits. Finally, no one agrees on what the prerequisites should be.\nThis is one of the issues that was discussed in depth at WP:RFA2011.\nPartly done Following a discussion in 2017, editors must be at least extended confirmed (30 days/500 edits) to nominate/self-nominate someone for adminship without the request being reviewed by someone else first.  This was primarily enacted to prevent futile RfA's of very new editors who didn't know better.\nCommunity-based process for removing adminship[edit]\nProposal: There should be a community-based process for removing adminship. Currently, the only way to involuntarily remove adminship outside of emergencies is by Arbitration Committee action or by bureaucrat action.  This would make adminship really \"No big deal\".\nReasons for previous rejection: Many admins object that a system like this would be too open to abuse by editors who have been disciplined by admins for violating policy.  Also, nobody can agree on the requirements for filing a request for de-adminship.  Many want very strict requirements for a desysop, while some want it no more difficult, or easier, than the requests for adminship process.\nSee also: Wikipedia:Requests for de-adminship, especially Wikipedia:Requests for de-adminship#Proposed processes. Before proposing a new system to revoke admin rights, read Wikipedia:De-adminship proposal checklist.\nGrant non-admins admin functions within their user space[edit]\nProposal: Allow non-administrators to administer their user space, with the tools technically limited to that space only. This has been proposed in a number of different ways, ranging from individual abilities (such as deletion), to full admin abilities.\nReasons for previous rejection: Lack of need; admin workload is not high enough to justify this.  There are also possible security concerns; if users could delete pages in their namespace, they would be able to move pages to their user space and delete them.  Gives the impression of user space ownership and has been rejected by the developers and the Wikipedia community.\nAdministrators should be of the age of majority[edit]\nProposal: Administrators should either indicate or prove at their request for adminship that they have reached the age of majority in the country in which they reside. This would provide legal protection for the editor and possibly also for the Wikimedia Foundation.\nReasons for previous rejection: No consensus to implement this; editors are free to use age as a personal rationale for opposing adminship on RfA.\nSee also: Wikipedia:Ageism, Wikipedia:Age and adminship\nAutomatically grant adminship to users with a certain number of edits or time editing[edit]\nProposal: An editor who has edited for a certain period of time and made a certain number of edits would be automatically granted admin rights\nReasons for previous rejection: This would create major problems for the Wikimedia Foundation's legal department. The legal department requires that admin rights only be granted to users who have undergone community review.\nSee also: Wikipedia:Village pump (proposals)/Archive 116#RFA reform Proposal: Automatic admintools to users with 1 year of registration and 3000 mainspace edits\nThere should be suffrage requirements for RfA[edit]\nProposal: New editors lack the knowledge and experience to appropriately evaluate an RfA candidate. This also would eliminate vandalism and trolls.\nReason for previous rejection: There is already a prohibition on IPs from 'voting' on RfA. New and/or single purpose accounts are generally disregarded anyway. Bureaucrats are empowered and able to discern such activity on an RfA and factor it in appropriately. Vandalism and troll behavior at RfA is low and handled already by current methods.\nSee also: various proposals such as from 2015 administrator election reform, another proposal from 2015, a 2016 proposal, and a 2017 RfC.\nTechnical[edit]\nWatchlist changes[edit]\nNote that extensive styling of nearly every aspect of one's watchlist is possible through CSS; see Wikipedia:Customizing watchlists.\n\nMultiple watchlists[edit]\nProposal Users should be able to have multiple watchlists so that they can group the pages they watch and not have to see all watched pages in one huge list.\nReasons for previous rejection: Technologically unfeasible without further development.  See T7875.\nSee also: archive 68, archive 3, archive 92, Help\nPublic watchlists[edit]\nProposal Watchlists are currently private for each logged-in user. Watchlist functionality should be public so that a given watchlist could be managed by all members of a wikiproject.\nReasons for previous rejection: Technologically unfeasible without further development.  See T9467.\nSee also: Help:Public watchlist, Wikipedia:Article alerts\n Allow watchlisting individual sections of a page[edit]\nProposal: Allow specific sections of pages to be watchlisted, so editors can monitor small portions of large pages, such as WP:ANI, instead of the whole page.\nReasons for previous rejection: While many users support the use of such a feature, the technical implementation of this feature is difficult, if not impossible with the current version of MediaWiki. At the moment, watchlisting is done on a page-by-page basis, as each page is assigned a unique ID number in the database.  Page sections, being fluid, are assigned numbers on the page they are situated on, but adding or removing sections above it will change the number. The name of the section can also be changed easily and new sections can be created with the same name.  This does not apply to pages which are transcluded within other pages, but this setup is not commonly used.\nSee also: User:Enterprisey/section-watchlist, T2738 (\"Ability to watch section levels of pages\")\nUse reCAPTCHA[edit]\nProposal: Use the reCAPTCHA CAPTCHA system in place of our own.\nReasons for previous rejection: The primary reasons for rejection were given by Brion Vibber, our former CTO, who stated that reCAPTCHA is proprietary (Wikimedia prefers to use free and open-source software) and Google will not let us run it on our own servers (so it would introduce a dependency on an external server by forcing MediaWiki to contact the server for CAPTCHA verification).\nSee also:  Wikicaptcha: a ReCAPTCHA-like solution for Wikisource, bugzilla:32695\nCreate shortcut namespace aliases for various namespaces[edit]\nProposal: Along the lines of the existing WP: → Wikipedia: and WT: → Wikipedia talk: namespace aliases, create shortcuts such as T: → Template:, TT: → Template talk:, U: → User:, UT: → User talk:, P: → Portal:, CAT: → Category:, and so on.\nReasons for previous rejection: Adding shortcuts comes with an increase in complexity that the community in general does not feel is justified by the added convenience. Contributing factors include:\nSome namespaces, such as User:, Help:, and Talk:, are already so short that further abbreviation is not really necessary.\nSome proposed shortcuts, such as TT: → Template talk:, conflict with existing interlanguage, interWikimedia, or interwiki prefixes, or codes from ISO 639 that may be used for future interlanguage prefixes.\nSome proposed shortcuts, such as T: → Template: and T: → Talk:, conflict.\nSome proposed shortcuts, such as T: → Template:, conflict with existing articles. While those articles could be moved as was done for articles such as Ki:Theory that conflict with existing namespaces or prefixes, one must ask whether the advantages of a shortcut outweigh the disadvantages of present and future conflicts.\nFew pages in most of these namespaces are linked or navigated to directly (using browser search boxes or direct URL manipulation) often enough that the savings of a few characters for a few users is worth the hassle for the rest of the community. Those few pages that are can be handled with WP-namespace or pseudo-namespace shortcuts, or shortcuts with the full namespace prefix.\nTemplates are normally linked using {{tl}}, which cannot readily be improved upon as an abbreviation, and specification of the Template namespace prefix is not necessary for transclusion. Few templates are directly navigated to.\nShortcuts for Help pages are often created in the WP namespace.\nPartly done in the form of \"pseudo-namespaces\" such as \"CAT:\" and \"MOS:\".\nSee also: Wikipedia:Village pump (proposals)/Archive 68#Proposal for an alias to templatespace, Wikipedia:Village pump (proposals)/Archive 127#Prefix suggestion: TP: for Template:\nMove the Main Page to another namespace, such as \"Wikipedia:\" or \"Portal:\"[edit]\nProposal Since the Main Page isn't an article, it should go in another namespace such as \"Wikipedia:\" or \"Portal:\" rather than stay in the main namespace.\nReasons for previous rejection There is little if any reason for such a move and we would still need to keep a cross-namespace redirect at the current title to avoid breaking probably millions of incoming links. The Main Page in its modern form dates to 2002, before the modern namespace system fully crystallized, and was placed by default in the main namespace. It has remained there since largely due to inertia and lack of a solid reason to move it to another namespace. Being sui generis, the Main Page doesn't particularly belong in any of the other namespaces either (with the possible exception of Portals).\nSee also: The discussions listed in Wikipedia:FAQ/Main Page#Why is Main Page in the main namespace?\nShare pages on Facebook, Twitter etc.[edit]\nProposal Wikipedia pages should have a \"Like\" button or \"Share\" widget to enable users to tag their favourite articles and to share article content on Facebook, Twitter and other social media sites.\nReasons for previous rejection Consensus and policy both establish that Wikipedia is not a social networking service. Having to decide which sites to include and which not would potentially cause issues in the community where Wikipedia would rather remain neutral. The copy-and-paste facility in most computer operating systems already allows people to copy links and paste them into a much wider range of websites than any share or like implementation ever could. In addition, there are potential privacy issues with many \"like\"/\"share\" implementations. Most network-sites provide bookmarklets that work on every webpage.\nSee also:  Village pump 1, Village pump 2, Village pump 3, Village pump 4, Help desk 1, Help desk 2, Help desk 3, Help desk 4, Help desk 5, Help desk 6, Help desk 7, Help desk 8, Help desk 9, Village pump 5, Help desk 10\nSee also[edit]\nWikipedia talk:Manual of Style/FAQ, listing some perennial disputes regarding the Manual of Style\nWikipedia:Historic debates\nWikipedia:FAQ/Main Page § Why doesn't the cursor appear in the search box, like with Google?\nNotes[edit]\n\n\n^ For example, the Oxford English Dictionary is free to (most) readers in the UK, but not elsewhere.\n\n^ From Wikipedia:Featured article criteria, as of April 2, 2008. (permalink)\n\n^ As of March 2008[update], there are 1,979 featured articles and 511 former featured articles (541 that have lost featured status minus 30 that have regained it). If you divide the 511 former featured articles by the 2490 articles that have ever been featured, 21% of FAs have been de-featured.\n\n^ See Policies and guidelines: \"Sources of Wikipedia policy\"\n\n^ A majority of articles follow the APA style (psychology) and Council of Science Editors style guide (all physical sciences) in naming the primary list of citations \"References\"; this proposal usually comes from someone who is familiar with the conventions used in history or the humanities.\n\n^ Wikipedia Statistics - Tables - English, accessed April 2, 2008; Who Writes Wikipedia?. Aaron Swartz's Raw Thought; accessed July 13, 2010.\n\n\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Wikipedia:Perennial_proposals&oldid=1022136659\"\nCategories: Wikipedia information pagesWikipedia proposalsWikipedia failed proposalsWikipedia cultureHidden categories: Project pages with short description\n\n\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nNot logged inTalkContributionsCreate accountLog in\n\n\n\n\n\nNamespaces\n\n\nProject pageTalk\n\n\n\n\n\nVariants\n\n\n\n\n\n\n\n\n\nViews\n\n\nReadEditView history\n\n\n\n\n\nMore\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\nContribute\n\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationWikidata item\n\n\n\n\nPrint/export\n\n\nDownload as PDFPrintable version\n\n\n\n\nLanguages\n\n\nEspañolFrançaisNederlandsPortuguêsРусский中文\nEdit links\n\n\n\n\n\n\n This page was last edited on 8 May 2021, at 17:51 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n"