"\n\n\n\n\n\n\nWikipedia:Reliable sources/Perennial sources\n\nFrom Wikipedia, the free encyclopedia\n< Wikipedia:Reliable sources\n\n\nJump to navigation\nJump to search\n\n\nList of sources whose reliability and use on Wikipedia are frequently discussed\nThis is an explanatory supplement to the Wikipedia:Reliable sources guideline.  This page is intended to provide additional information about concepts in the page(s) it supplements. This page is not one of Wikipedia's policies or guidelines, as it has not been thoroughly vetted by the community.ShortcutWP:RSP\nThis page in a nutshell: This is a list of repeatedly discussed sources, collected and summarized for convenience. Consensus can change, and context matters tremendously when determining how to use this list.\n The reliability of a source greatly affects what information it can be used to support, or whether it should be used at all.\nThis is a non-exhaustive list of sources whose reliability and use on Wikipedia are frequently discussed. This list summarizes prior consensus and consolidates links to the most in-depth and recent discussions from the reliable sources noticeboard and elsewhere on Wikipedia.\n\nClick here to see the list of frequently-discussed sources.\nContext matters tremendously, and some sources may or may not be suitable for certain uses depending on the situation. When in doubt, defer to the linked discussions for more detailed information on a particular source and its use. Consensus can change, and if more recent discussions considering new evidence or arguments reach a different consensus, this list should be updated to reflect those changes.\nReliability is an inquiry that takes place pursuant to the verifiability policy and the reliable sources guideline. Note that verifiability is only one of Wikipedia's core content policies, which also include neutral point of view and no original research. These policies work together to determine whether information from reliable sources should be included or excluded.\n\nContents\n\n1 How to use this list\n\n1.1 What if my source isn't here?\n\n\n2 How to improve this list\n\n2.1 Inclusion criteria\n2.2 Instructions\n\n\n3 Legend\n4 Sources\n5 Categories\n\n5.1 Self-published peerage websites\n5.2 State-sponsored fake news sites\n5.3 Student media\n\n\n6 See also\n\n6.1 Topic-specific pages\n6.2 Templates and categories\n\n\n7 Notes\n8 References\n9 External links\n\n\nHow to use this list[edit]\nShortcutWP:RSPUSE\nRefer to the legend for definitions of the icons in the list, but note that the discussion summaries provide more specific guidance on sources than the icons in the \"Status\" column. When in doubt, defer to the linked discussions, which provide in-depth arguments on when it is appropriate to use a source. The list is not an independent document; it is derived from the conclusions of the referenced discussions and formal requests for comment (RfCs). This list indexes discussions that reflect community consensus, and is intended as a useful summary.\nContext matters tremendously when determining the reliability of sources, and their appropriate use on Wikipedia. Sources which are generally unreliable may still be useful in some situations. For example, even extremely low-quality sources, such as social media, may sometimes be used as self-published sources for routine information about the subject themselves. Conversely, some otherwise high-quality sources may not be reliable for highly technical subjects that fall well outside their normal areas of expertise, and even very high-quality sources may occasionally make errors, or retract pieces they have published in their entirety. Even considering content published by a single source, some may represent high-quality professional journalism, while other content may be merely opinion pieces, which mainly represent the personal views of the author, and depend on the author's personal reliability as a source. Be especially careful with sponsored content, because while it is usually unreliable as a source, it is designed to appear otherwise.\nConsider also the weight of the claims you are supporting, which should be evaluated alongside the reliability of the sources cited. Mundane, uncontroversial details have the lowest burden of proof, while information related to biomedicine and living persons have the highest.\n\nWhat if my source isn't here?[edit]\nShortcutWP:RSPMISSING\nDon't panic. If your source isn't listed here, the only thing it really means is that it hasn't been the subject of repeated community discussion. That may be because the source you want to use is a stellar source, and we simply never needed to talk about it because it was so obvious.[a] It could mean that the source covers a niche topic, or that it simply fell through the cracks. Or it could mean the source is so obviously poor it never merited discussion. If you're concerned about any source in particular, you should start a discussion about it at the reliable sources noticeboard (RSN), after checking the \"Search the noticeboard archives\" there first. That is, after all, how the entries on this list got here to begin with.\n\n\nA source's absence from the list does not imply that it is any more or less reliable than the sources that are present.\n\nHow to improve this list[edit]\nShortcutWP:RSPIMPROVE\nConsensus can change. If you believe that circumstances have evolved since the most recent discussion, new evidence has emerged that was not available at the time, or there is a new line of argument not previously covered, consider starting a discussion or a request for comment (RfC) at the reliable sources noticeboard.\nBefore doing so, please thoroughly familiarize yourself with content of previous discussions, and particularly the reasoning why consensus was reached, and not simply the outcome itself. Also consider when consensus was formed, and that the outcomes of very recent discussions are unlikely to be quickly overturned. Repeatedly restarting discussions where a strong and recent consensus already exists, may be considered disruptive and a type of forum shopping.\nIf you feel that this list inadequately summarizes the content of the linked discussions, please help to improve it, or start a discussion on the talk page, especially if your changes prove controversial. In updating this list, please be mindful that it should only summarize the content of past discussions, and should not include novel arguments not previously covered in a centralized forum. If you would like to present a novel argument or interpretation, please do so in one of these forums, so that the discussion may be linked to, and itself summarized here.\n\nInclusion criteria[edit]\nShortcutWP:RSPCRITERIA\nFor a source to be added to this list, editors generally expect two or more significant discussions about the source's reliability in the past, or an uninterrupted request for comment on the source's reliability that took place on the reliable sources noticeboard. For a discussion to be considered significant, most editors expect no fewer than two qualifying participants for RSN discussions where the source's name is in the section heading, and no fewer than three qualifying participants for all other discussions. Qualifying participants are editors who make at least one comment on the source's reliability.\n\nInstructions[edit]\nMain page: Wikipedia:Reliable sources/Perennial sources/Instructions\nAny editor may improve this list. Please refer to the instructions for details, and ask for help on the talk page if you get stuck.\n\nLegend[edit]\n\nShortcutWP:GREL Generally reliable in its areas of expertise: Editors show consensus that the source is reliable in most cases on subject matters in its areas of expertise. The source has a reputation for fact-checking, accuracy, and error-correction, often in the form of a strong editorial team. It will normally still be necessary to analyze how much weight to give the source and how to describe its statements. Arguments to exclude such a source entirely must be strong and convincing: e.g. the material is contradicted by more authoritative sources, it is outside the source's accepted areas of expertise (a well-established news organization is normally reliable for politics but not for philosophy), a specific subcategory of the source is less reliable (such as opinion pieces in a newspaper), the source is making an exceptional claim, or a higher standard of sourcing is required (WP:MEDRS, WP:BLP) for the statement in question.\nShortcutWP:MREL No consensus, unclear, or additional considerations apply: The source is marginally reliable (i.e. neither generally reliable nor generally unreliable), and may be usable depending on context. Editors may not have been able to agree on whether the source is appropriate, or may have agreed that it is only reliable in certain circumstances. It may be necessary to evaluate each use of the source on a case-by-case basis while accounting for specific factors unique to the source in question. Carefully review the Summary column of the table for details on the status of the source and the factors that should be considered.\nShortcutWP:GUNREL Generally unreliable: Editors show consensus that the source is questionable in most cases. The source may lack an editorial team, have a poor reputation for fact-checking, fail to correct errors, be self-published, or present user-generated content. Outside exceptional circumstances, the source should normally not be used, and it should never be used for information about a living person. Even in cases where the source may be valid, it is usually better to find a more reliable source instead. If no such source exists, that may suggest that the information is inaccurate. The source may still be used for uncontroversial self-descriptions, and self-published or user-generated content authored by established subject-matter experts is also acceptable.\nShortcutWP:DEPREC Deprecated: There is community consensus from a request for comment to deprecate the source. The source is considered generally unreliable, and use of the source is generally prohibited. Despite this, the source may be used for uncontroversial self-descriptions, although reliable secondary sources are still preferred. An edit filter, 869 (hist · log), may be in place to warn editors who attempt to cite the source as a reference in articles. The warning message can be dismissed. Edits that trigger the filter are tagged.\n Blacklisted: Due to persistent abuse, usually in the form of external link spamming, the source is on the spam blacklist or the Wikimedia global spam blacklist. External links to this source are blocked, unless an exception is made for a specific link in the spam whitelist.\n Request for comment: The linked discussion is an uninterrupted request for comment on the reliable sources noticeboard or another centralized venue suitable for determining the source's reliability. The closing statement of any RfC that is not clearly outdated should normally be considered authoritative and can only be overturned by a newer RfC.\n Stale discussions: The source has not been discussed on the reliable sources noticeboard for four calendar years, and the consensus may have changed since the most recent discussion. However, sources that are considered generally unreliable for being self-published or presenting user-generated content are excluded. A change in consensus resulting from changes in the source itself does not apply to publications of the source from before the changes in question. Additionally, while it may be prudent to review these sources before using them, editors should generally assume that the source's previous status is still in effect if there is no reason to believe that the circumstances have changed.\n Discussion in progress: The source is currently being discussed on the reliable sources noticeboard. Italic numbers represent active discussions (all discussions that are not closed or archived) on the reliable sources noticeboard. Letters represent discussions outside of the reliable sources noticeboard.\n📌 Shortcut: Abbreviated wikilink to the list entry for the source.\n\nSources[edit]\nShortcutsWP:RSPSOURCESWP:RSPSRCWP:RSPSS\nNote: If you add/remove a source in the \"generally unreliable\", \"deprecated\" or \"blacklisted\" categories, please update WP:CITEWATCH/SETUP/GENERAL § WP:RSP, or leave a note at Wikipedia talk:CITEWATCH if you need help.\n\n\nContents\n\n0–9\nA\nB\nC\nD\nE\nF\nG\nH\nI\nJ\nK\nL\nM\nN\nO\nP\nQ\nR\nS\nT\nU\nV\nW\nX\nY\nZ\nLegend  \n\n\nPerennial sources\n\n\nSource\n\nStatus(legend)\n\nDiscussions\n\nUses\n\n\nList\n\nLast\n\nSummary\n\n\n112 Ukraine\n\n\n\n 2019  2020  2020\n1\nA B\n\n\n2020\n\n112 Ukraine was deprecated following a 2019 RfC, which showed overwhelming consensus for the deprecation of a slew of sources associated with Russian disinformation in Ukraine. It was pointed out later in a 2020 RfC that 112 Ukraine had not been explicitly discussed in that first discussion prior to its blacklisting request. Further discussion established a rough consensus that the source is generally unreliable, but did not form a consensus for deprecation or blacklisting. The prior blacklisting was reversed as out of process.\n\n1  2  \n\n\nAd Fontes Media\n\n\n\n1 2 3 4\n\n2020\n\nThere is consensus that Ad Fontes Media and their Media Bias Chart should not be used in article space in reference to sources' political leaning or reliability. Editors consider it a self-published source and have questioned its methodology.\n\n1  \n\n\nAdvameg (City-Data)\n\n \n\n 2019  2019  2019\n+14[b]\n\n\n2019\n\nAdvameg operates content farms, including City-Data, that use scraped or improperly licensed content. These sites frequently republish content from Gale's encyclopedias; many editors can obtain access to Gale through The Wikipedia Library free of charge. Advameg's sites are on the Wikipedia spam blacklist, and links must be whitelisted before they can be used.  WP:COPYLINK prohibits linking to copyright violations.\n\n1  2   +43\n\n\nAgence France-Presse (AFP)\n\n\n\n1 2\n\n2020\n\nAgence France-Presse is a news agency. There is consensus that Agence France-Presse is generally reliable. Syndicated reports from Agence France-Presse that are published in other sources are also considered generally reliable.\n\n1  \n\n\nAl Jazeera (Al Jazeera English, Aljazeera.com)\n\n\n\n1 2 3 4 5 6 7 8 9\n\n2019\n\nAl Jazeera is considered a generally reliable news organization. Editors perceive Al Jazeera English (and Aljazeera.com) to be more reliable than Al Jazeera's Arabic-language news reporting. Some editors say that Al Jazeera, particularly its Arabic-language media, is a partisan source with respect to the Arab–Israeli conflict. Al Jazeera's news blogs should be handled with the corresponding policy.\n\n1  2  \n\n\nAllGov.com\n\n\n\n1 2\n\n2018\n\nThere is consensus that AllGov is generally unreliable due to its inclusion of volunteer-contributed content.\n\n1  \n\n\nAlterNet\n\n\n\n1 2 3 4 5\n\n2019\n\nThere is consensus that AlterNet is generally unreliable. Editors consider AlterNet a partisan source, and its statements should be attributed. AlterNet's syndicated content should be evaluated by the reliability of its original publisher, and the citation should preferably point to the original publisher.\n\n1  \n\n\nAmazon WP:RSPAMAZON 📌\n\n\n\n1 2 3 4 5 6 7\n\n2021\n\nUser reviews on Amazon are anonymous, self-published, and unverifiable, and should not be used at all. Amazon is a reliable source for basic information about a work (such as release date, ISBN, etc.), although it is unnecessary to cite Amazon when the work itself may serve as a source for that information (e.g., authors' names and ISBNs). Future release dates may be unreliable.\n\n1  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  \n\n\nThe American Conservative (TAC)\n\n\n\n 2019  2020  2021\n1\n\n\n2021\n\nThere is consensus that The American Conservative is a usable source for attributed opinions. As TAC is published by the American Ideas Institute, an advocacy organization, TAC is considered biased or opinionated.\n\n1  \n\n\nAn Phoblacht\n\n\n\n 2020\n1\n\n\n2020\n\nThere is consensus that An Phoblacht is generally unreliable for news reporting, as it is a publication of Sinn Féin. Under the conditions of WP:ABOUTSELF, An Phoblacht is usable for attributed statements from Sinn Féin and some editors believe that the publication may also be used for attributed statements from the Provisional Irish Republican Army (IRA).\n\n1  \n\n\n Anadolu Agency (general topics) (AA)\n\n\n\n 2019\n\n2019\n\nThe 2019 RfC established no consensus on the reliability of Anadolu Agency. Well-established news outlets are normally considered reliable for statements of fact. However, Anadolu Agency is frequently described as a mouthpiece of the Turkish government that engages in propaganda, owing to its state-run status. See also: Anadolu Agency (controversial topics, international politics).\n\n1  2  \n\n\nAnadolu Agency (controversial topics, international politics) (AA)\n\n\n\n 2019\n\n2019\n\nIn the 2019 RfC, editors generally agreed that Anadolu Agency is generally unreliable for topics that are controversial or related to international politics. See also: Anadolu Agency (general topics).\n\n1  2  \n\n\nAncestry.com WP:ANCESTRY.COM 📌\n\n\n\n1 2 3 4 5 6\n\n2021\n\nAncestry.com is a genealogy site that hosts a database of primary source documents including marriage and census records. Some of these sources may be usable under WP:BLPPRIMARY, but secondary sources, where available, are usually preferred. Ancestry.com also hosts user-generated content, which is unreliable.\n\n1  \n\n\nAnswers.com (WikiAnswers)\n\n\n\n1 2 3 4\n\n2010\n\nAnswers.com (previously known as WikiAnswers) is a Q&A site that incorporates user-generated content. In the past, Answers.com republished excerpts and summaries of tertiary sources, including D&B Hoovers, Gale, and HighBeam Research. Citations of republished content on Answers.com should point to the original source, with a note that the source was accessed \"via Answers.com\". Answers.com also previously served as a Wikipedia mirror; using republished Wikipedia content is considered circular sourcing.\n\n1  \n\n\nAnti-Defamation League (ADL)\n\n\n\n 2020\n1 2 3 4 5 6\n\n\n2021\n\nThere is consensus that ADL is a generally reliable source, including for topics related to hate groups and extremism in the U.S. There is no consensus that ADL must be attributed in all cases, but there is consensus that the labelling of organisations and individuals by the ADL (particularly as antisemitic) should be attributed. Some editors consider the ADL's opinion pieces not reliable, and that they should only be used with attribution. Some editors consider the ADL a biased source for Israel/Palestine related topics that should be used with caution, if at all.\n\n1  \n\n\nApple Daily\n\n\n\n 2020\n\n2020\n\nThe consensus is that Apple Daily is often but not always reliable, and that it may be appropriate to use it in articles about Hong Kong, but subject to editorial judgment, particularly if the topic is controversial and/or Apple Daily is the only source for a contested claim. There is concern that historically, it was not necessarily as reliable as it is today.\n\n1  \n\n\nAsian News International (ANI)\n\n\n\n 2021\n\n2021\n\nAsian News International is an Indian news agency. For general reporting, Asian News International is considered to be between marginally reliable and generally unreliable, with consensus that it is biased and that it should be attributed in-text for contentious claims. For its coverage related to Indian domestic politics, foreign politics, and other topics in which the Government of India may have an established stake, there is consensus that Asian News International is questionable and generally unreliable due to its reported dissemination of pro-government propaganda.\n\n1  \n\n\nArab News\n\n\n\n 2020\n1 2 3\n\n\n2020\n\nThere is consensus that Arab News is a usable source for topics unrelated to the Saudi Arabian government. As Arab News is closely associated with the Saudi Arabian government and is published in a country with low press freedom, editors consider Arab News biased and non-independent for Saudi Arabian politics, and recommend attribution for its coverage in this area. Some editors consider Arab News unreliable for matters related to the Saudi Arabian government.\n\n1  \n\n\nArs Technica\n\n\n\n1 2\n\n2012\n\nArs Technica is considered generally reliable for science- and technology-related articles.\n\n1  2  \n\n\narXiv\n\n\n\n1 2 3 4\nA B\n\n\n2015\n\narXiv is a preprint (and sometimes postprint) repository containing papers that have undergone moderation, but not necessarily peer review. There is consensus that arXiv is a self-published source, and is generally unreliable with the exception of papers authored by established subject-matter experts. Verify whether a paper on arXiv is also published in a peer-reviewed academic journal; in these cases, cite the more reliable journal and provide an open access link to the paper (which may be hosted on arXiv).\n\n1  \n\n\nAskMen\n\n\n\n1 2 3 4 5 6\n\n2020\n\nThere is no consensus on the reliability of AskMen. See also: IGN.\n\n1  \n\n\nAssociated Press (AP)\n\n\n\n1 2 3 4 5 6\n\n2018\n\nThe Associated Press is a news agency. There is consensus that the Associated Press is generally reliable. Syndicated reports from the Associated Press that are published in other sources are also considered generally reliable.\n\n1  2  \n\n\nThe Atlantic (The Atlantic Monthly)\n\n\n\n1 2 3\n\n2019\n\nThe Atlantic is considered generally reliable.\n\n1  \n\n\nThe Australian\n\n\n\n1 2\n\n2020\n\nThe Australian is considered generally reliable. Some editors consider The Australian to be a partisan source. Opinion pieces are covered by WP:RSOPINION and WP:NEWSBLOG. Several editors expressed concern regarding their coverage of climate change related topics.\n\n1  \n\n\nThe A.V. Club\n\n\n\n1 2 3\nA\n\n\n2014\n\nThe A.V. Club is considered generally reliable for film, music and TV reviews.\n\n1  \n\n\nAxios\n\n\n\n1 2\n\n2020\n\nThere is consensus that Axios is generally reliable. Some editors consider Axios to be a biased or opinionated source. Statements of opinion should be attributed and evaluated for due weight.\n\n1  \n\n\nBaidu Baike\n\n\n\n 2020\n1 2 3 4\n\n\n2020\n\nBaidu Baike was deprecated in the 2020 RfC as it is similar to an open wiki, which is a type of self-published source. Although edits are reviewed by Baidu administrators before they are published, most editors believe the editorial standards of Baidu Baike to be very low, and do not see any evidence of fact-checking. The Baidu 10 Mythical Creatures kuso originated from Baidu Baike.\n\n1  2  \n\n\nBallotpedia\n\n\n\n1 2 3\n\n2016\n\nThere is no consensus on the reliability of Ballotpedia. The site has an editorial team and accepts error corrections, but some editors do not express strong confidence in the site's editorial process. Discussions indicate that Ballotpedia used to be an open wiki, but stopped accepting user-generated content at some point. Currently, the site claims: \"Ballotpedia's articles are 100 percent written by our professional staff of more than 50 writers and researchers.\"[1]\n\n1  \n\n\nBBC (British Broadcasting Corporation)\n\n\n\n16[c]\n\n2020\n\nBBC is considered generally reliable. This includes BBC News, BBC documentaries, and the BBC History site (on BBC Online). However, this excludes BBC projects that incorporate user-generated content (such as h2g2 and the BBC Domesday Project) and BBC publications with reduced editorial oversight (such as Collective). Statements of opinion should conform to the corresponding guideline.\n\n1  2  \n\n\nBellingcat\n\n\n\n 2019\n1 2 3 4 5 6\n\n\n2021\n\nThere is consensus that Bellingcat is generally reliable for news and should preferably be used with attribution. Some editors consider Bellingcat a biased source, as it receives funding from the National Endowment for Democracy.\n\n1  \n\n\nbestgore.com\n\n \n\n 2021\n\n2021\n\nThere is consensus that bestgore.com is a shock site with no credibility. It is deprecated and has been added to the spam blacklist.\n\n1  \n\n\nBild WP:BILD 📌\n\n\n\n1 2 3\n\n2020\n\nBild is a German tabloid that has been unfavourably compared to The Sun. A few editors consider the source usable in some cases.\n\n1  \n\n\nBiography.com\n\n\n\n1 2 3 4\n\n2018\n\nThere is no consensus on the reliability of Biography.com. Some editors consider the source reliable because of its backing from A&E Networks and references to the website in news media. Others point to discrepancies between information on Biography.com and on more established sources, and an unclear fact-checking process.\n\n1  \n\n\nBlaze Media (BlazeTV, Conservative Review, CRTV, TheBlaze)\n\n\n\n1 2 3\n\n2018\n\nBlaze Media (including TheBlaze) is considered generally unreliable for facts. In some cases, it may be usable for attributed opinions. In 2018, TheBlaze merged with Conservative Review (CRTV) to form Blaze Media.[2]\n\n1  2  \n\n\nBlogger (blogspot.com)\n\n\n\n21[d]\n\n2020\n\nBlogger is a blog hosting service that owns the blogspot.com domain. As a self-published source, it is considered generally unreliable and should be avoided unless the author is a subject-matter expert or the blog is used for uncontroversial self-descriptions. Blogger blogs published by a media organization should be evaluated by the reliability of the organization. Newspaper blogs hosted using Blogger should be handled with WP:NEWSBLOG. Blogger should never be used for third-party claims related to living persons; this includes interviews, as even those cannot be authenticated.\n\n1  \n\n\nBloomberg (Bloomberg News, Bloomberg Businessweek)\n\n\n\n1 2 3 4\n\n2019\n\nBloomberg publications, including Bloomberg News and Bloomberg Businessweek, are considered generally reliable for news and business topics. See also: Bloomberg profiles.\n\n1  2  \n\n\nBloomberg profiles\n\n\n\n1 2\n\n2018\n\nBloomberg company and executive profiles are generally considered to be based on company press releases and should only be used as a source for uncontroversial information. There is consensus that these profiles should not be used to establish notability. Some editors consider these profiles to be akin to self-published sources. See also: Bloomberg.\n\n1  \n\n\nBoing Boing\n\n\n\n1 2 3\n\n2019\n\nThere is no consensus on the reliability of Boing Boing. Although Boing Boing is a group blog, some of its articles are written by subject-matter experts such as Cory Doctorow, who is considered generally reliable for copyright law.\n\n1  \n\n\nBreitbart News WP:BREITBART 📌\n\n \n\n 2018  2018\n+15[e]\n\n\n2020\n\nDue to persistent abuse, Breitbart News is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. The site has published a number of falsehoods, conspiracy theories, and intentionally misleading stories. The 2018 RfC showed a very clear consensus that Breitbart News should be deprecated in the same way as the Daily Mail. This does not mean Breitbart News can no longer be used, but it should not be used, ever, as a reference for facts, due to its unreliability. It can still be used as a primary source when attributing opinions, viewpoints, and commentary. Breitbart News has directly attacked and doxed Wikipedia editors. Posting or linking to another editor's personal information is prohibited under the outing policy, unless the editor is voluntarily disclosing the information on Wikipedia.\n\n1  \n\n\nBurke's Peerage\n\n\n\n 2020\n1\n\n\n2020\n\nBurke's Peerage is considered generally reliable for genealogy.\n\n1  \n\n\nBusiness Insider (Insider, Markets Insider, Tech Insider) WP:BI 📌\n\n\n\n 2020\n10[f]\n\n\n2020\n\nThere is no consensus on the reliability of Business Insider. The site's syndicated content, which may not be clearly marked, should be evaluated by the reliability of its original publisher.\n\n1  2  3  \n\n\nBustle\n\n\n\n 2019\n\n2019\n\nThere is consensus that the reliability of Bustle is unclear and that its reliability should be decided on an instance-by-instance basis. Editors noted that it has an editorial policy and that it will issue retractions. Editors also noted previous issues it had around reliability and that its content is written by freelance writers – though there is no consensus on whether this model affects their reliability.\n\n1  \n\n\nBuzzFeed\n\n\n\n1 2 3 4 5 6 7 8\n\n2018\n\nEditors find the quality of BuzzFeed articles to be highly inconsistent. A 2014 study from the Pew Research Center found BuzzFeed to be the least trusted news source in America.[3] BuzzFeed may use A/B testing for new articles, which may cause article content to change.[4] BuzzFeed operates a separate news division, BuzzFeed News, which has higher editorial standards and is now hosted on a different website. See also: BuzzFeed News.\n\n1  \n\n\nBuzzFeed News\n\n\n\n1 2 3 4 5 6 7 8 9\n\n2019\n\nThere is consensus that BuzzFeed News is generally reliable. BuzzFeed News now operates separately from BuzzFeed, and most news content originally hosted on BuzzFeed was moved to the BuzzFeed News website in 2018.[5] In light of the staff layoffs at BuzzFeed in January 2019, some editors recommend exercising  more caution for BuzzFeed News articles published after this date. The site's opinion pieces should be handled with WP:RSOPINION. See also: BuzzFeed.\n\n1  2  \n\n\nThe California Globe\n\n\n\n 2021\n\n2021\n\nThere is consensus that The California Globe is generally unreliable. Editors note the lack of substantial editorial process, the lack of evidence for fact-checking, and the bias present in the site's material. Editors also note the highly opinionated nature of the site as evidence against its reliability.\n\n1  \n\n\nThe Canary\n\n\n\n 2021\n1 2 3 4\n\n\n2021\n\nThere is consensus that The Canary is generally unreliable. Its reporting is sensationalist at times; selective reporting, a left-wing bias, and a poor distinction between editorial and news content were also noted.\n\n1  \n\n\nCato Institute\n\n\n\n1 2\n\n2015\n\nThe Cato Institute is considered generally reliable for its opinion. Some editors consider the Cato Institute an authoritative source on libertarianism in the United States. There is no consensus on whether it is generally reliable on other topics. Most editors consider the Cato Institute biased or opinionated, so its uses should be attributed.\n\n1  \n\n\nCelebrityNetWorth\n\n\n\n1 2 3 4 5 6 7 8 9\n\n2018\n\nThere is consensus that CelebrityNetWorth is generally unreliable. CelebrityNetWorth does not disclose its methodology, and its accuracy has been criticized by The New York Times.[6]\n\n1  \n\n\nCenter for Economic and Policy Research (CEPR)\n\n\n\n 2020\n\n2020\n\nThe Center for Economic and Policy Research is an economic policy think tank. Though its articles are regularly written by subject-matter experts in economics and are frequently cited by reliable sources, most editors consider the CEPR biased or opinionated, so its uses should be attributed.\n\n1  \n\n\nCentre for Research on Globalization (CRG, Global Research, globalresearch.ca)\n\n \n\n 2019\n1 2 3 4 5 6 7\n\n\n2019\n\nDue to persistent abuse, Global Research is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. The Centre for Research on Globalization is the organization that operates the Global Research website (globalresearch.ca, not to be confused with GlobalSecurity.org). The CRG is considered generally unreliable due to its propagation of conspiracy theories and lack of editorial oversight. It is biased or opinionated, and its content is likely to constitute undue weight. As it often covers fringe material, parity of sources should be considered.\n\n1  2  3  \n\n\nCESNUR (Center for Studies on New Religions, Centro Studi sulle Nuove Religioni)\n\n\n\n1 2 3 4\n\n2019\n\nCESNUR is an apologia site for new religious movements, and thus is inherently unreliable in its core area due to conflicts of interest. There is also consensus that its content is unreliable on its own merits.\n\n1  \n\n\nChina Daily\n\n\n\n 2021\n1\n\n\n2021\n\nChina Daily is a publication owned by the Chinese Communist Party. The 2021 RfC found narrow consensus against deprecating China Daily, owing to the lack of available usable sources for Chinese topics. There is consensus that China Daily may be used, cautiously and with good editorial judgment, as a source for the position of the Chinese authorities and the Chinese Communist Party; as a source for the position of China Daily itself; as a source for facts about non-political events in mainland China, while noting that (a) China Daily's interpretation of those facts is likely to contain political spin, and (b) China Daily's omission of details from a story should not be used to determine that such details are untruthful; and, with great caution, as a supplementary (but not sole) source for facts about political events of mainland China. Editors agree that when using this source, context matters a great deal and the facts should be separated from China Daily's view about those facts. It is best practice to use in-text attribution and inline citations when sourcing content to China Daily.\n\n1  2  3  \n\n\nChina Global Television Network (CGTN, CCTV International) WP:CGTN 📌\n\n\n\n 2020\n1 2\n\n\n2020\n\nChina Global Television Network was deprecated in the 2020 RfC for publishing false or fabricated information. Many editors consider CGTN a propaganda outlet, and some editors express concern over CGTN's airing of forced confessions.\n\n1  \n\n\nThe Christian Science Monitor (CSM, CS Monitor) WP:CSMONITOR 📌\n\n\n\n20[g]\n\n2016\n\nThe Christian Science Monitor is considered generally reliable for news.\n\n1  \n\n\nCliffsNotes\n\n\n\n1 2\n\n2018\n\nCliffsNotes is a study guide. Editors consider CliffsNotes usable for superficial analyses of literature, and recommend supplementing CliffsNotes citations with additional sources.\n\n1  \n\n\nClimate Feedback\n\n\n\n1 2 3 4\n\n2020\n\nClimate Feedback is a fact-checking website that is considered generally reliable for topics related to climate change. It discloses its methodologies, is certified by the International Fact-Checking Network, and has been endorsed by other reliable sources. Most editors do not consider Climate Feedback a self-published source due to its high reviewer requirements.\n\n1  \n\n\nCNET (Computer Network)\n\n\n\n16[h]\n\n2015\n\nCNET is considered generally reliable for technology-related articles.\n\n1  \n\n\nCNN (Cable News Network)\n\n\n\n 2019  2020\n13[i]\n\n\n2021\n\nThere is consensus that news broadcast or published by CNN is generally reliable. However, iReport consists solely of user-generated content, and talk show content should be treated as opinion pieces. Some editors consider CNN biased, though not to the extent that it affects reliability.\n\n1  \n\n\nCoda Media (Coda Story)\n\n\n\n 2021\n\n2021\n\nA 2021 RfC found consensus that Coda Media is generally reliable for factual reporting. A few editors consider Coda Media a biased source for international politics related to the US, as it has received funding from the National Endowment for Democracy, though not to the extent that it affects reliability.\n\n1  \n\n\nCoinDesk\n\n\n\n 2018  2019\n1 2 3\n\n\n2019\n\nThere is consensus that CoinDesk should not be used to establish notability for article topics, and that it should be avoided in favor of more mainstream sources. Check CoinDesk articles for conflict of interest disclosures, and verify whether their parent company (Digital Currency Group) has an ownership stake in a company covered by CoinDesk.[7]\n\n1  \n\n\nCommon Sense Media (CSM) WP:CSM 📌\n\n\n\n1 2 3\n\n2020\n\nThere is consensus that Common Sense Media is generally reliable for entertainment reviews. As an advocacy organization, Common Sense Media is biased or opinionated, and its statements should generally be attributed.\n\n1  \n\n\nThe Conversation\n\n\n\n1 2 3\n\n2019\n\nThe Conversation publishes articles from academics who are subject-matter experts. It is generally reliable for subjects in the authors' areas of expertise. Opinions published in The Conversation should be handled with WP:RSOPINION.\n\n1  \n\n\nCosmopolitan\n\n\n\n1 2 3 4 5 6\n\n2019\n\nThere is no consensus on the reliability of Cosmopolitan. It is generally regarded as a situational source, which means context is important. The treatment of Cosmopolitan as a source should be decided on a case-by-case basis, depending on the article and the information to be verified.\n\n1  \n\n\nCounterPunch\n\n\n\n1 2 3 4 5 6 7 8 9\n\n2020\n\nThere is no consensus regarding the reliability of CounterPunch. As a biased or opinionated source, its statements should be attributed.\n\n1  \n\n\nCracked.com\n\n\n\n1 2 3 4 5\n\n2015\n\nCracked.com is a humor website. There is consensus that Cracked.com is generally unreliable. When Cracked.com cites another source for an article, it is preferable for editors to read and cite that source instead.\n\n1  \n\n\nCrunchbase\n\n\n\n 2019\n1 2\n\n\n2019\n\nIn the 2019 RfC, there was consensus to deprecate Crunchbase, but also to continue allowing external links to the website. A significant proportion of Crunchbase's data is user-generated content.\n\n1  \n\n\nThe Daily Beast WP:DAILYBEAST 📌\n\n\n\n1 2 3 4 5\n\n2021\n\nThe Daily Beast is considered generally reliable for news. Most editors consider The Daily Beast a biased or opinionated source. Some editors advise caution when using this source for controversial statements of fact related to living persons.\n\n1  \n\n\nThe Daily Caller\n\n\n\n 2019\n1 2 3 4 5 6 7 8\n\n\n2019\n\nThe Daily Caller was deprecated in the 2019 RfC, which showed consensus that the site publishes false or fabricated information.\n\n1  2  \n\n\nThe Daily Dot\n\n\n\n1 2 3 4 5 6 7 8 9\nA\n\n\n2020\n\nThe Daily Dot is considered generally reliable for Internet culture. Consider whether content from this publication constitutes due weight before citing it in an article.\n\n1  \n\n\nDaily Express WP:DAILYEXPRESS 📌\n\n\n\n1 2 3 4 5 6\n\n2020\n\nThe Daily Express is a tabloid with a number of similarities to the Daily Mail. It is considered generally unreliable.\n\n1  \n\n\nDaily Kos WP:DAILYKOS 📌\n\n\n\n1 2 3\n\n2017\n\nThere is consensus that Daily Kos should generally be avoided as a source, especially for controversial political topics where better sources are available. As an activism blog that publishes user-generated content with a progressive point of view, many editors consider Daily Kos to inappropriately blur news reporting and opinion.\n\n1  \n\n\nDaily Mail (MailOnline)WP:DAILYMAIL 📌WP:RSPDM 📌\n\n\n\n 2017  2019  2020\n48[j]\n\n\n2021\n\nThe Daily Mail was deprecated in the 2017 RfC, and the decision was reaffirmed in the 2019 RfC. There is consensus that the Daily Mail (including its online version, MailOnline) is generally unreliable, and its use as a reference is generally prohibited, especially when other more reliable sources exist. As a result, the Daily Mail should not be used for determining notability, nor should it be used as a source in articles. The Daily Mail may be used in rare cases in an about-self fashion. Some editors regard the Daily Mail as reliable historically, so old articles may be used in a historical context. (Note that dailymail.co.uk is not trustworthy as a source of past content that was printed in the Daily Mail.) The restriction is often incorrectly interpreted as a \"ban\" on the Daily Mail. The UK Daily Mail is not to be confused with other publications named Daily Mail. The dailymail.com domain was previously used by the unaffiliated Charleston Daily Mail, and reference links are still present.\n\n1  2  3  4  5  6  7  8  9  10  \n\n\nDaily Mirror (Mirror) WP:DAILYMIRROR 📌\n\n\n\n1 2 3 4 5\n\n2020\n\nThe Daily Mirror is a tabloid newspaper that publishes tabloid journalism. There is no consensus on whether its reliability is comparable to other British tabloids, such as the Daily Mail or The Sun.\n\n1  \n\n\nDaily Star (UK) WP:DAILYSTAR 📌\n\n\n\n 2020\n1 2 3 4\n\n\n2020\n\nThe Daily Star was deprecated in the 2020 RfC due to its reputation of publishing false or fabricated information.\n\n1  2  \n\n\nThe Daily Telegraph (UK) (The Telegraph)\n\n\n\n16[k]\n\n2018\n\nThere is consensus that The Daily Telegraph (also known as The Telegraph) is generally reliable. Some editors believe that The Daily Telegraph is biased or opinionated for politics. Unrelated to The Daily Telegraph (Sydney).\n\n1  \n\n\nThe Daily Wire\n\n\n\n1 2 3\n\n2020\n\nThere is a strong consensus that The Daily Wire is generally unreliable for factual reporting. Detractors note the site's tendency to share stories that are taken out of context or are improperly verified.[8][9]\n\n1  \n\n\nDeadline Hollywood WP:RSPDEADLINE 📌\n\n\n\n1 2 3 4 5 6\n\n2019\n\nDeadline Hollywood is considered generally reliable for entertainment-related articles.\n\n1  2  \n\n\nDebrett's\n\n\n\n 2020\n1\n\n\n2020\n\nThere is consensus that Debrett's is reliable for genealogical information. However, their defunct \"People of Today\" section is considered similar to Who's Who (UK) as the details were solicited from the subjects. Editors have also raised concerns that this section included paid coverage.\n\n1  \n\n\nDemocracy Now!\n\n\n\n1 2 3 4 5\n\n2013\n\nThere is no consensus on the reliability of Democracy Now!. Most editors consider Democracy Now! a partisan source whose statements should be attributed. Syndicated content published by Democracy Now! should be evaluated by the reliability of its original publisher.\n\n1  \n\n\nDeseret News\n\n\n\n1 2 3\n\n2016\n\nThe Deseret News is considered generally reliable for local news. It is owned by a subsidiary of The Church of Jesus Christ of Latter-day Saints, and there is no consensus on whether the Deseret News is independent of the LDS Church. The publication's statements on topics regarding the LDS Church should be attributed. The Deseret News includes a supplement, the Church News, which is considered a primary source as an official publication of the LDS Church.\n\n1  \n\n\nDigital Spy\n\n\n\n1 2 3 4 5\nA\n\n\n2012\n\nThere is consensus that Digital Spy is generally reliable for entertainment and popular culture. Consider whether the information from this source constitutes due or undue weight.\n\n1  2  \n\n\nThe Diplomat\n\n\n\n1 2\n\n2020\n\nThere is consensus that The Diplomat is generally reliable. Opinion pieces should be evaluated by WP:RSOPINION and WP:NEWSBLOG. Some editors have expressed concern on their reliability for North Korea-related topics.\n\n1  \n\n\nDiscogs\n\n\n\n 2019\n1 2 3 4 5\n\n\n2019\n\nThe content on Discogs is user-generated, and is therefore generally unreliable. There was consensus against deprecating Discogs in a 2019 RfC, as editors noted that external links to the site may be appropriate.\n\n1  \n\n\nDotdash (About.com, The Balance, Lifewire, The Spruce, ThoughtCo, TripSavvy, Verywell)\n\n\n\n 2018  2020\n+16[l]\n\n\n2020\n\nDotdash (formerly known as About.com) operates a network of websites. Editors find the quality of articles published by About.com to be inconsistent. Some editors recommend treating About.com articles as self-published sources, and only using articles published by established experts. About.com also previously served as a Wikipedia mirror; using republished Wikipedia content is considered circular sourcing. In 2017, the About.com website became defunct and some of its content was moved to Dotdash's current website brands.[10][11] Due to persistent abuse, verywellfamily.com, verywellhealth.com, and verywellmind.com are on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. See also: Investopedia.\n\n1  2  3  4  5  6  7  8  9  10  \n\n\nE! (E! News, E! Online, Entertainment Television) WP:E! 📌\n\n\n\n1 2 3\nA\n\n\n2019\n\nThere is no consensus on the reliability of the E! television network, including its website E! Online. It is generally regarded as usable for celebrity news. Consider whether the information from this source constitutes due or undue weight, especially when the subject is a living person.\n\n1  \n\n\nThe Economist\n\n\n\n1 2 3 4\n\n2018\n\nMost editors consider The Economist generally reliable. The Economist publishes magazine blogs and opinion pieces, which should be handled with the respective guidelines.\n\n1  \n\n\nThe Electronic Intifada (EI)\n\n\n\n1 2 3 4 5 6 7 8\n\n2018\n\nThere is consensus that The Electronic Intifada is generally unreliable with respect to its reputation for accuracy, fact-checking, and error-correction. Almost all editors consider The Electronic Intifada a biased and opinionated source, so their statements should be attributed.\n\n1  \n\n\n Encyclopædia Britannica (Encyclopædia Britannica Online) WP:BRITANNICA 📌\n\n\n\n13[m]\n\n2021\n\nThe Encyclopædia Britannica (including its online edition, Encyclopædia Britannica Online) is a tertiary source with a strong reputation for fact-checking and accuracy. Most editors prefer reliable secondary sources over the Encyclopædia Britannica when available. From 2009 to 2010, the Encyclopædia Britannica Online accepted a small number of content submissions from the general public. Although these submissions undergo the encyclopedia's editorial process, some editors believe that content from non-staff contributors is less reliable than the encyclopedia's staff-authored content. Content authorship is disclosed in the article history.\n\n1  \n\n\n Encyclopædia Iranica\n\n\n\n1 2 3\n\n2020\n\nThe Encyclopædia Iranica is considered generally reliable for Iran-related topics.\n\n1  \n\n\nEncyclopaedia Metallum (Metal Archives, MA)\n\n\n\n1 2\n\n2016\n\nEncyclopaedia Metallum is considered to be user-generated and so best avoided. It is listed at Wikipedia:WikiProject Albums/Sources#Unreliable sources.\n\n1  \n\n\nEngadget\n\n\n\n1\nA\n\n\n2012\n\nEngadget is considered generally reliable for technology-related articles, its statements should be attributed.\n\n1  \n\n\nEntertainment Weekly (EW)\n\n\n\n1 2 3\nA\n\n\n2018\n\nEntertainment Weekly is considered generally reliable for entertainment-related articles. There is no consensus on whether it is reliable for other topics.\n\n1  \n\n\nEntrepreneur (Entrepreneur India)\n\n\n\n 2020\n\n2020\n\nThere is no consensus for the reliability of Entrepreneur Magazine, although there is a consensus that \"contributor\" pieces in the publication should be treated as self-published, similar to Forbes.com contributors. Editors did not provide much evidence of fabrication in their articles, but were concerned that its coverage tends toward churnalism and may include improperly disclosed paid pieces.\n\n1  \n\n\nThe Epoch Times WP:EPOCHTIMES 📌\n\n\n\n 2019\n1 2 3 4 5 6\n\n\n2020\n\nThe Epoch Times was deprecated in the 2019 RfC. Most editors classify The Epoch Times as an advocacy group for the Falun Gong, and consider the publication a biased or opinionated source that frequently publishes conspiracy theories. As is the case with Breitbart News and Occupy Democrats, this does not mean that The Epoch Times can no longer be used, just that it can never again be used as a reference for facts.\n\n1  2  \n\n\nEvening Standard (London Evening Standard)\n\n\n\n1 2 3 4 5 6\n\n2018\n\nThere is no consensus on the reliability of the Evening Standard. Despite being a free newspaper, it is generally considered more reliable than most British tabloids and middle-market newspapers.\n\n1  \n\n\nExaminer.com\n\n \n\n 2009\n1 2 3 4 5 6 7\n\n\n2014\n\nDue to persistent abuse, Examiner.com is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. Examiner.com is considered a self-published source, as it has minimal editorial oversight. Most editors believe the site has a poor reputation for accuracy and fact-checking. Prior to 2004, the examiner.com domain was used by The San Francisco Examiner, which has moved to a different domain. Examiner.com was shut down in 2016; website content is no longer accessible unless archived.\n\n1  \n\n\nFacebook WP:RSPFB 📌\n\n\n\n 2020\n1 2 3\n\n\n2020\n\nFacebook is considered generally unreliable because it is a self-published source with no editorial oversight. In the 2020 RfC, there was consensus to add an edit filter to warn users who attempt to cite Facebook as a source, and no consensus on whether Facebook citations should be automatically reverted with XLinkBot.\n\n1  \n\n\nFairness and Accuracy in Reporting (FAIR)\n\n\n\n 2010\n1 2 3 4 5\n\n\n2014\n\nThere is no consensus on the reliability of Fairness and Accuracy in Reporting. However, there is strong consensus that publications from FAIR should not be used to support exceptional claims regarding living persons. Most editors consider FAIR a biased or opinionated source whose statements should be attributed and generally treated as opinions.\n\n1  \n\n\nFamilySearch\n\n\n\n1 2 3 4 5 6\n\n2018\n\nFamilySearch operates a genealogy site that incorporates a large amount of user-generated content. Editors see no evidence that FamilySearch performs fact-checking, and believe that the site has a questionable reputation for accuracy. FamilySearch also hosts primary source documents, such as birth certificates, which may be usable in limited situations. When using primary source documents from FamilySearch, follow WP:BLPPRIMARY and avoid interpreting them with original research.\n\n1  \n\n\nFamous Birthdays\n\n \n\n 2019\n1 2 3 4 5\n\n\n2019\n\nDue to persistent abuse, Famous Birthdays is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. There is consensus that Famous Birthdays is generally unreliable. Famous Birthdays does not provide sources for its content, claim to have an editorial team, or claim to perform fact-checking. Do not use this site for information regarding living persons.\n\n1  \n\n\n Fandom (Wikia, Wikicities) WP:FANDOM 📌 WP:RSPWIKIA 📌\n\n\n\n1 2 3 4 5 6\nA\n\n\n2019\n\nFandom (formerly Wikia and Wikicities) is considered generally unreliable because open wikis are self-published sources. Although citing Wikia as a source is against policy, copying Fandom content into Wikipedia is permissible if it is published under a compatible license (some wikis may use licenses like CC BY-NC and CC BY-NC-ND, which are incompatible). Use the {{Wikia content}} template to provide the necessary attribution in these cases, and ensure the article meets Wikipedia's policies and guidelines after copying.\n\n1  2  3  \n\n\nThe Federalist\n\n\n\n 2021\n\n2021\n\nThe Federalist is generally unreliable for facts due to its partisan nature and its promotion of conspiracy theories. However, it may be usable for attributed opinions.\n\n1  \n\n\nFinancial Times\n\n\n\n1 2 3 4 5 6 7 8\n\n2018\n\nThe Financial Times is considered generally reliable.\n\n1  \n\n\nFind a Grave\n\n\n\n1 2 3 4 5 6\n\n2021\n\nThe content on Find a Grave is user-generated,[12] and is therefore considered generally unreliable. Links to Find a Grave may sometimes be included in the external links section of articles, when the site offers valuable additional content, such as images not permitted for use on Wikipedia. Take care that the Find a Grave page does not itself contain prohibited content, such as copyright violations.\n\n1  \n\n\nFindmypast\n\n\n\n1 2 3 4 5\n\n2019\n\nFindmypast is a genealogy site that hosts transcribed primary source documents, which is covered under WP:BLPPRIMARY. The site's birth and death certificate records include the event's date of registration, not the date of the event itself. Editors caution against interpreting the documents with original research and note that the transcription process may introduce errors. Findmypast also hosts user-generated family trees, which are unreliable. The Wikipedia Library previously offered access to Findmypast.\n\n1  \n\n\nFlickr\n\n\n\n1 2 3\n\n2020\n\nMost photos on Flickr are anonymous, self-published, and unverifiable, and should not be used at all for verifying information in articles. Content uploaded from a verified official account, such as that of a news organization, may be treated as originating from the uploader and therefore inheriting their level of reliability. Note that one cannot make interpretations from Flickr photos, even from verified sources.\n\n1  \n\n\nForbes WP:FORBES 📌\n\n\n\n1 2 3 4 5 6\n\n2020\n\nForbes and Forbes.com include articles written by their staff, which are written with editorial oversight, and are generally reliable. Forbes also publishes various \"top\" lists which can be referenced in articles. See also: Forbes.com contributors.\n\n1  \n\n\n Forbes.com contributors WP:FORBESCON 📌\n\n\n\n13[n]\n\n2021\n\nMost content on Forbes.com is written by contributors with minimal editorial oversight, and is generally unreliable. Editors show consensus for treating Forbes.com contributor articles as self-published sources, unless the article was written by a subject-matter expert. Forbes.com contributor articles should never be used for third-party claims about living persons. Articles that have also been published in the print edition of Forbes are excluded, and are considered generally reliable. Check the byline to determine whether an article is written by \"Forbes Staff\" or a \"Contributor\", and check underneath the byline to see whether it was published in a print issue of Forbes. Previously, Forbes.com contributor articles could have been identified by their URL beginning in \"forbes.com/sites\"; the URL no longer distinguishes them, as Forbes staff articles have also been moved under \"/sites\". See also: Forbes.\n\n1  \n\n\nFox News[o] (news excluding politics and science) WP:FOXNEWS 📌\n\n\n\n 2010  2020\n9[p]\n\n\n2020\n\nThere is consensus that Fox News is generally reliable for news coverage on topics other than politics and science. See also: Fox News (politics and science), Fox News (talk shows).\n\n1  2  \n\n\nFox News[o] (politics and science)\n\n\n\n 2010  2020\n20[q]\n\n\n2020\n\nThere is no consensus on the reliability of Fox News's coverage of politics and science. Use Fox News with caution to verify contentious claims. Editors perceive Fox News to be biased or opinionated for politics; use in-text attribution for opinions. See also: Fox News (news excluding politics and science), Fox News (talk shows).\n\n1  \n\n\nFox News[o] (talk shows)\n\n\n\n1 2 3 4 5 6 7 8\n\n2020\n\nFox News talk shows, including Hannity, Tucker Carlson Tonight, The Ingraham Angle, and Fox & Friends, should not be used for statements of fact but can sometimes be used for attributed opinions. See also: Fox News (news excluding politics and science), Fox News (politics and science).\n\n1  \n\n\nFrontPage Magazine (FPM, FrontPageMag.com)WP:FPM 📌\n\n\n\n 2020\n1 2 3 4 5 6 7 8\n\n\n2020\n\nIn the 2020 RfC, there was unanimous consensus to deprecate FrontPage Magazine. Editors consider the publication generally unreliable, and believe that its opinions should be assigned little to no weight. The publication is considered biased or opinionated.\n\n1  2  \n\n\nGamasutra\n\n\n\n1 2\nA\n\n\n2020\n\nGamasutra is considered generally reliable for subjects related to video games.\n\n1  \n\n\nThe Gateway Pundit (TGP)\n\n\n\n 2019\n1\n\n\n2019\n\nThe Gateway Pundit was deprecated in the 2019 RfC, which showed consensus that the site is unacceptable as a source. It is unreliable for statements of fact, and given to publishing hoax articles and reporting conspiracy theories as fact.\n\n1  \n\n\nGawker\n\n\n\n 2019\n1 2 3 4 5 6 7\n\n\n2019\n\nGawker is an inactive gossip blog that frequently published articles on rumors and speculation without named authors. When Gawker is the only source for a piece of information, the information would likely constitute undue weight, especially when the subject is a living person. When another reliable source quotes information from Gawker, it is preferable to cite that source instead. In the 2019 RfC, there was no consensus on whether Gawker should be deprecated.\n\n1  \n\n\nGeni.com\n\n\n\n1 2 3 4 5\n\n2019\n\nGeni.com is a genealogy site that is considered generally unreliable because it is an open wiki, which is a type of self-published source. Primary source documents from Geni.com may be usable under WP:BLPPRIMARY to support reliable secondary sources, but avoid interpreting them with original research.\n\n1  \n\n\nGenius (Rap Genius)\n\n\n\n1 2\n\n2019\n\nSong lyrics, annotations and descriptions on Genius are mostly user-generated content and are thus generally unreliable. There is no consensus on the reliability of articles, interviews and videos produced by Genius. Verified commentary from musicians fall under WP:BLPSELFPUB, and usage of such commentary should conform to that policy.\n\n1  2  \n\n\nGlobal Times (Huanqiu Shibao) WP:GLOBALTIMES 📌\n\n\n\n 2020\n1 2 3 4\n\n\n2020\n\nThe Global Times is a tabloid owned by the Chinese Communist Party. It was deprecated near-unanimously in a 2020 RfC which found that it publishes false or fabricated information, including pro-Chinese government propaganda and conspiracy theories.\n\n1  2  \n\n\nGlobalSecurity.org\n\n\n\n11[r]\n\n2020\n\nThere is no consensus on the reliability of GlobalSecurity.org. It is not to be confused with globalresearch.ca.\n\n1  \n\n\nThe Globe and Mail\n\n\n\n 2021\n\n2021\n\nIn a 2021 RfC, editors found a strong consensus that The Globe and Mail is generally reliable for news coverage and is considered a newspaper of record.\n\n1  \n\n\nGoodreads\n\n\n\n1 2\n\n2018\n\nGoodreads is a social cataloging site comprising user-generated content. As a self-published source, Goodreads is considered generally unreliable.\n\n1  \n\n\nGoogle Maps (Google Street View)\n\n\n\n1 2 3 4 5 6\n\n2020\n\nGoogle Maps and Google Street View may be useful for some purposes, including finding and verifying geographic coordinates and other basic information like street names. However, especially for objects like boundaries (of neighborhoods, allotments, etc.), where other reliable sources are available they should be treated preferentially to Google Maps and Google Street View. It can also be difficult or impossible to determine the veracity of past citations, since Google Maps data is not publicly archived, and may be removed or replaced as soon as it is not current. Inferring information solely from Street View pictures may be considered original research. Note that due to restrictions on geographic data in China, OpenStreetMap coordinates for places in mainland China are almost always much more accurate than Google's – despite OpenStreetMap being user-generated – due to the severe distortion introduced by most commercial map providers. (References, in any case, are usually not required for geographic coordinates.)\n\n1  2  \n\n\nThe Grayzone\n\n\n\n 2020\n1\n\n\n2020\n\nThe Grayzone was deprecated in the 2020 RfC. There is consensus that The Grayzone publishes false or fabricated information. Some editors describe The Grayzone as Max Blumenthal's blog, and question the website's editorial oversight.\n\n1  \n\n\nThe Green Papers\n\n\n\n 2020\n1\nA\n\n\n2020\n\nThere is no consensus on the reliability of The Green Papers. As a self-published source that publishes United States election results, some editors question the site's editorial oversight.\n\n1  \n\n\nThe Guardian (TheGuardian.com, The Manchester Guardian, The Observer)\n\n\n\n15[s]\n\n2019\n\nThere is consensus that The Guardian is generally reliable. The Guardian's op-eds should be handled with WP:RSOPINION. Some editors believe The Guardian is biased or opinionated for politics. See also: The Guardian blogs.\n\n1  2  3  \n\n\nThe Guardian blogs\n\n\n\n10[t]\n\n2020\n\nMost editors say that The Guardian blogs should be treated as newspaper blogs or opinion pieces due to reduced editorial oversight. Check the bottom of the article for a \"blogposts\" tag to determine whether the page is a blog post or a non-blog article. See also: The Guardian.\n\n1  2  3  \n\n\nGuido Fawkes\n\n\n\n1 2 3 4\n\n2020\n\nThe Guido Fawkes website (order-order.com) is considered generally unreliable because it is a self-published blog. It may be used for uncontroversial descriptions of itself and its own content according to WP:ABOUTSELF, but not for claims related to living persons.\n\n1  \n\n\nGuinness World Records\n\n\n\n1 2 3 4 5\n\n2020\n\nThere is consensus that world records verified by Guinness World Records should not be used to establish notability. Editors have expressed concern that post-2008 records include paid coverage.\n\n1  \n\n\nHaaretz (Ḥadashot Ha'aretz)\n\n\n\n1 2 3 4 5 6 7 8 9\n\n2018\n\nHaaretz is considered generally reliable. Some editors believe that Haaretz reports with a political slant, particularly with respect to the Arab–Israeli conflict, which makes it biased or opinionated. The publication's opinion pieces should be handled with the appropriate guideline.\n\n1  2  \n\n\nHansard (UK Parliament transcripts, House of Commons, House of Lords)\n\n\n\n1 2 3 4\n\n2019\n\nAs a transcript of parliament proceedings in the United Kingdom, Hansard is a primary source and its statements should be attributed to whoever made them. Hansard is considered generally reliable for UK parliamentary proceedings and UK government statements. It is not considered reliable as a secondary source as it merely contains the personal opinions of whoever is speaking in Parliament that day, and is subject to Parliamentary privilege. Hansard is not a word-for-word transcript and may omit repetitions and redundancies.\n\n1  2  3  4  5  6  \n\n\nHeat Street\n\n\n\n1 2\n\n2017\n\nAlthough Heat Street was owned by Dow Jones & Company, a usually reputable publisher, many editors note that Heat Street does not clearly differentiate between its news articles and opinion. There is consensus that Heat Street is a partisan source. Some editors consider Heat Street's opinion pieces and news articles written by its staff to be usable with attribution, though due weight must be considered because Heat Street covers many political topics not as talked about in higher-profile sources.\n\n1  \n\n\nHeavy.com\n\n\n\n1 2\n\n2019\n\nThere is consensus that Heavy.com should not be relied upon for any serious or contentious statements, including dates of birth. When Heavy.com cites another source for their own article, it is preferable to read and cite the original source instead.\n\n1  \n\n\nThe Hill\n\n\n\n10[u]\n\n2019\n\nThe Hill is considered generally reliable for American politics. The publication's opinion pieces should be handled with the appropriate guideline. The publication's contributor pieces, labeled in their bylines, receive minimal editorial oversight and should be treated as equivalent to self-published sources.\n\n1  \n\n\nThe Hindu WP:THEHINDU 📌\n\n\n\n1 2 3\n\n2020\n\nThere is consensus that The Hindu is generally reliable and should be treated as a newspaper of record. The publication's opinion pieces should be handled with the appropriate guideline.\n\n1  \n\n\nHispanTV\n\n\n\n 2019\n\n2019\n\nHispanTV was deprecated in the 2019 RfC, which showed overwhelming consensus that the TV channel is generally unreliable and sometimes broadcasts outright fabrications. Editors listed multiple examples of HispanTV broadcasting conspiracy theories and Iranian propaganda.\n\n1  2  \n\n\nHistory (The History Channel)\n\n\n\n1 2 3\n\n2021\n\nMost editors consider The History Channel generally unreliable due to its poor reputation for accuracy and its tendency to broadcast programs that promote conspiracy theories.\n\n1  \n\n\nThe Hollywood Reporter (THR) WP:THR 📌\n\n\n\n1 2 3 4 5\n\n2018\n\nThere is consensus that The Hollywood Reporter is generally reliable for entertainment-related topics, including its articles and reviews on film, TV and music, as well as its box office figures.\n\n1  \n\n\nHope not Hate (Searchlight)\n\n\n\n 2018\n1 2 3 4 5\n\n\n2019\n\nMost commenters declined to make a general statement about publications from Hope not Hate. Reliability should be assessed on a case-by-case basis, while taking context into account. Because they are an advocacy group, they are a biased and opinionated source and their statements should be attributed.\n\n1  2  \n\n\nHuffPost (excluding politics) (The Huffington Post)WP:HUFFPO 📌WP:HUFFPOST 📌\n\n\n\n 2020\n+12[v]\n\n\n2020\n\nA 2020 RfC found HuffPost staff writers fairly reliable for factual reporting on non-political topics, but notes that they may give prominence to topics that support their political bias and less prominence to, or omit, things that contradict it. HuffPost's reliability has increased since 2012; articles before 2012 are less reliable and should be treated with more caution. HuffPost uses clickbait headlines to attract attention to its articles, thus the body text of any HuffPost article is considered more reliable than its headline. See also: HuffPost (politics), HuffPost contributors.\n\n1  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  \n\n\nHuffPost (politics) (The Huffington Post)\n\n\n\n 2020\n+10[w]\n\n\n2020\n\nIn the 2020 RfC, there was no consensus on HuffPost staff writers' reliability for political topics. The community considers HuffPost openly biased on US politics. There is no consensus on its reliability for international politics. See also: HuffPost (excluding politics), HuffPost contributors.\n\n1  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  \n\n\nHuffPost contributors (The Huffington Post)\n\n\n\n 2020\n+18[x]\n\n\n2020\n\nUntil 2018, the US edition of HuffPost published content written by contributors with near-zero editorial oversight. These contributors generally did not have a reputation for fact-checking, and most editors consider them highly variable in quality. Editors show consensus for treating HuffPost contributor articles as self-published sources, unless the article was written by a subject-matter expert. In 2018, HuffPost discontinued its contributor platform, but old contributor articles are still online. Check the byline to determine whether an article is written by a staff member or a \"Contributor\" (also referred to as an \"Editorial Partner\"). See also: HuffPost (excluding politics), HuffPost (politics).\n\n1  2  \n\n\nHuman Events\n\n\n\n1 2 3\n\n2019\n\nEditors consider Human Events biased or opinionated, and its statements should be attributed. In May 2019, a former editor-in-chief of Breitbart News became the editor-in-chief of Human Events; articles published after the leadership change are considered generally unreliable. There is no consensus on the reliability of Human Events's older content.\n\n1  \n\n\nIdolator\n\n\n\n1 2 3 4 5\n\n2017\n\nThere is consensus that Idolator is generally reliable for popular music. Consider whether content from this publication constitutes due weight before citing it in an article.\n\n1  \n\n\nIGN (Imagine Games Network) WP:IGN 📌\n\n\n\n12[y]\n\n2017\n\nThere is consensus that IGN is generally reliable for entertainment and popular culture, as well as for film and video game reviews given that attribution is provided. Consider whether the information from this source constitutes due weight before citing it in an article. In addition, articles written by N-Sider are generally unreliable as this particular group of journalists have been found to fabricate articles and pass off speculation as fact. The site's blogs should be handled with WP:RSBLOG. See also: AskMen.\n\n1  \n\n\nIMDb (Internet Movie Database)WP:IMDB 📌\n\n\n\n 2019\n+32[z]\n\n\n2020\n\nThe content on IMDb is user-generated, and the site is considered unreliable by a majority of editors. WP:Citing IMDb describes two exceptions, both of which do not require citations because the film itself is implied to be the primary source. Although certain content on the site is reviewed by staff, editors criticize the quality of IMDb's fact-checking. A number of editors have pointed out that IMDb content has been copied from other sites, including Wikipedia, and that there have been a number of notable hoaxes in the past. The use of IMDb as an external link is generally considered appropriate (see WP:IMDB-EL).\n\n1  \n\n\nThe Independent\n\n\n\n1 2 3 4\n\n2020\n\nThe Independent, a British newspaper, is considered a reliable source for non-specialist information. In March 2016, the publication discontinued its print edition to become an online newspaper; some editors advise caution for articles published after this date.\n\n1  \n\n\nIndependent Journal Review (IJR)\n\n\n\n1 2 3\n\n2018\n\nThere is no consensus on the reliability of the Independent Journal Review. Posts from \"community\" members are considered self-published sources. The site's \"news\" section consists mostly of syndicated stories from Reuters, and citations of these stories should preferably point to Reuters.\n\n1  \n\n\nIndependent Media Center (Indymedia, IMC)\n\n\n\n1 2 3\n\n2020\n\nThe Independent Media Center is an open publishing network. Editors express low confidence in Indymedia's reputation for fact-checking, and consider Indymedia a self-published source.\n\n1  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17  \n\n\nThe Indian Express WP:INDIANEXP 📌\n\n\n\n 2020\n\n2020\n\nThe Indian Express is considered generally reliable under the news organizations guideline.\n\n1  \n\n\nInfoWars (NewsWars)WP:INFOWARS 📌\n\n \n\n 2018  2018  2018\n1\n\n\n2018\n\nDue to persistent abuse, InfoWars is on both the Wikipedia spam blacklist and the Wikimedia global spam blacklist, and links must be whitelisted before they can be used. InfoWars was deprecated in the 2018 RfC, which showed unanimous consensus that the site publishes fake news and conspiracy theories. The use of InfoWars as a reference should be generally prohibited, especially when other more reliable sources exist. InfoWars should not be used for determining notability, or used as a secondary source in articles.\n\n1  2  3  4  5  \n\n\nInter Press Service (IPS)\n\n\n\n1 2\n\n2011\n\nThe Inter Press Service is a news agency. There is consensus that the Inter Press Service is generally reliable for news.\n\n1  2  3  \n\n\nThe Intercept\n\n\n\n1 2 3 4\n\n2020\n\nThere is consensus that The Intercept is generally reliable for news. Almost all editors consider The Intercept a biased source, so uses may need to be attributed. For science, editors prefer peer-reviewed journals over news sources like The Intercept.\n\n1  \n\n\nInternational Business Times (IBT, IBTimes)WP:IBTIMES 📌\n\n\n\n1 2 3 4 5 6 7\n\n2019\n\nThere is consensus that the International Business Times is generally unreliable. Editors note that the publication's editorial practices have been criticized by other reliable sources, and point to the inconsistent quality of the site's articles. The site's syndicated content, which may not be clearly marked, should be evaluated by the reliability of its original publisher.\n\n1  2  3  4  5  6  \n\n\nInternational Fact-Checking Network (IFCN) WP:IFCN 📌\n\n\n\n 2020\n\n2020\n\nThe Poynter Institute's International Fact-Checking Network (IFCN) reviews fact-checking organizations according to a code of principles. There is consensus that it is generally reliable for determining the reliability of fact-checking organizations.\n\n1  \n\n\nInvestopedia\n\n\n\n1 2 3 4\n\n2021\n\nInvestopedia is owned by Dotdash (formerly known as About.com). There is no consensus on the reliability of Investopedia. It is a tertiary source. See also: Dotdash.\n\n1  \n\n\nJAMA (Journal of the American Medical Association)\n\n\n\n1 2\n\n2018\n\nJAMA is a peer-reviewed medical journal published by the American Medical Association. It is considered generally reliable. Opinion pieces from JAMA, including articles from The Jama Forum, are subject to WP:RSOPINION and might not qualify under WP:MEDRS.\n\n1  \n\n\nThe Jewish Chronicle (The JC)\n\n\n\n1 2 3\n\n2021\n\nThere is consensus that The Jewish Chronicle is generally reliable for news, particularly in its pre-2010 reporting. There is a rough consensus that The Jewish Chronicle is biased for topics related to the British Left, Muslims, Islam, and Palestine/Palestinians; in-text attribution is recommended for its coverage of these topics.\n\n1  \n\n\nJewish Virtual Library (JVL)\n\n\n\n 2020\n1 2 3 4 5\nA\n\n\n2020\n\nThe Jewish Virtual Library is a partisan source which sometimes cites Wikipedia and it is mostly unreliable, especially in its \"Myths & Facts\" section. When it cites sources, those should preferably be read and then cited directly instead. Some exceptions on a case-by-case basis are possible.\n\n1  \n\n\nJezebel\n\n\n\n1 2\n\n2016\n\nThere is no consensus on the reliability of Jezebel. Most editors believe that Jezebel is biased or opinionated, and that its claims should be attributed. Jezebel should generally not be used for contentious claims, especially ones about living persons.\n\n1  \n\n\nJihad Watch\n\n\n\n 2021\n1 2 3\n\n\n2021\n\nJihad Watch was deprecated in the 2021 RfC; of the editors who commented on the substance of the proposal, they were unanimous that the source is unreliable. It is a blog generally regarded as propagating anti-Muslim conspiracy theories.\n\n1  \n\n\nKnow Your Meme (KYM)\n\n\n\n1 2 3 4\n\n2020\n\nKnow Your Meme entries, including \"confirmed\" entries, are user-generated and generally unreliable. There is no consensus on the reliability of their video series.\n\n1  \n\n\nKommersant (Коммерса́нтъ)\n\n\n\n 2021\n1 2 3\n\n\n2021\n\nKommersant (Russian: Коммерса́нтъ, often abbreviated as Ъ) is a liberal business broadsheet newspaper with nationwide distribution in the Russian Federation. Editors generally believed that Kommersant is one of the better publications in Russia and believe its reporting is generally reliable on most matters. However, editors have expressed concerns regarding how limited media freedom in Russia may affect the source's reporting, and as such caution should be applied when the source is used in relation to events in which the Russian government has a close interest. In such contexts, use of the source should generally be accompanied with intext attribution.\n\n1  2  3  \n\n\nLast.fm\n\n\n\n 2019\n1\n\n\n2019\n\nLast.fm was deprecated in the 2019 RfC. The content on Last.fm is user-generated, and is considered generally unreliable.\n\n1  \n\n\nLenta.ru (12 March 2014–present)\n\n \n\n 2019  2020\n1 2\n\n\n2020\n\nDue to persistent abuse, Lenta.ru is on the Wikipedia spam blacklist, and links to articles published on or after 12 March 2014 must be whitelisted before they can be used. Lenta.ru was deprecated in the 2019 RfC, which showed consensus that the site frequently publishes conspiracy theories and Russian propaganda, owing to a mass dismissal of staff on 12 March 2014. The use of Lenta.ru articles published since 12 March 2014 as references should be generally prohibited, especially when other more reliable sources exist. Lenta.ru should not be used for determining notability, or used as a secondary source in articles.\n\n1  \n\n\nLifeSiteNews (Campaign Life Coalition)\n\n\n\n 2019\n1 2 3 4\n\n\n2019\n\nLifeSiteNews was deprecated in the 2019 RfC, which showed consensus that the site publishes false or fabricated information.\n\n1  \n\n\nLinkedIn (LinkedIn Pulse)\n\n\n\n1 2 3 4 5 6 7 8 9\n\n2020\n\nLinkedIn is a social network. As a self-published source, it is considered generally unreliable and should be avoided unless the post is used for an uncontroversial self-description. Articles on LinkedIn Pulse written by LinkedIn users are also self-published. LinkedIn accounts should only be cited if they are verified accounts or if the user's identity is confirmed in some way. Posts that are not covered by reliable sources are likely to constitute undue weight. LinkedIn should never be used for third-party claims related to living persons.\n\n1  \n\n\nLiveJournal\n\n\n\n1 2 3 4\n\n2020\n\nLiveJournal is a blog hosting service. As a self-published source, it is considered generally unreliable. LiveJournal can be used for uncontroversial self-descriptions and content from subject-matter experts, but not as a secondary source for living persons.\n\n1  \n\n\nLiveLeak\n\n \n\n 2019\n1 2 3 4\n\n\n2019\n\nDue to persistent abuse, LiveLeak is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. LiveLeak is an online video platform that hosts user-generated content. Many of the videos on LiveLeak are copyright violations, and should not be linked to per WP:COPYLINK. The use of LiveLeak as a primary source is questionable in most cases, as the provenance of most of the videos is unclear.\n\n1  \n\n\nLos Angeles Times WP:LATIMES 📌\n\n\n\n1 2 3 4 5 6\n\n2016\n\nMost editors consider the Los Angeles Times generally reliable. Refer to WP:NEWSBLOG for the newspaper's blog.\n\n1  \n\n\nLulu.com (Lulu Press)\n\n \n\n 2008\n1 2 3 4 5 6 7 8 9\n\n\n2019\n\nDue to persistent abuse, Lulu.com is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. Lulu.com is a print-on-demand publisher, which is a type of self-published source. Books published through Lulu.com can be used if they are written by a subject-matter expert. Occasionally, a reputable publisher uses Lulu.com as a printer; in this case, cite the original publisher instead of Lulu.com.\n\n1  \n\n\nThe Mail on Sunday WP:MAILONSUNDAY 📌\n\n\n\n 2020\n1 2\n\n\n2020\n\nThere is clear and substantial consensus that the Mail on Sunday is generally unreliable, and a slightly narrower consensus that the source should be deprecated. Those supporting deprecation point to factual errors, asserted fabrications, and biased reporting identified on the part of the source, with reference to specific instances, and to common ownership of the source with a previously deprecated source.\n\n1  2  3  4  \n\n\nMarquis Who's Who (Who's Who in America)\n\n\n\n1 2 3 4 5\n\n2017\n\nMarquis Who's Who, including its publication Who's Who in America, is considered generally unreliable. As most of its content is provided by the person concerned, editors generally consider Marquis Who's Who comparable to a self-published source. There is a broad consensus that Marquis Who's Who should not be used to establish notability for article topics. See also: Who's Who (UK).\n\n1  2  \n\n\nMashable (non-sponsored content)WP:MASHABLE 📌\n\n\n\n 2021\n1 2 3 4 5 6\n\n\n2021\n\nIn a 2021 RfC, editors achieved a consensus while non-sponsored content from Mashable is generally fine, Mashable tends towards less formal writing and is geared at a particular niche (tech news and pop culture). As such, non-sponsored content should be evaluated on a case-by-case basis, especially if the subject matter is outside of Mashable's usual focus. Extra attention needs to be paid when it comes to sponsored content, especially ensuring that the content was written by Mashable staff and not the sponsor themselves.\n\n1  \n\n\nMashable (sponsored content)\n\n\n\n 2021\n1 2 3 4 5 6\n\n\n2021\n\nIn a 2021 RfC, editors achieved a consensus while non-sponsored content from Mashable is generally fine, Mashable tends towards less formal writing and is geared at a particular niche (tech news and pop culture). As such, non-sponsored content should be evaluated on a case-by-case basis, especially if the subject matter is outside of Mashable's usual focus. Extra attention needs to be paid when it comes to sponsored content, especially ensuring that the content was written by Mashable staff and not the sponsor themselves.\n\n1  \n\n\nThe Mary Sue\n\n\n\n1 2\nA B\n\n\n2016\n\nThere is no consensus on the reliability of The Mary Sue. It is generally regarded as usable for reviews and opinion, though not for its reblogged content.\n\n1  \n\n\nMDPI (Multidisciplinary Digital Publishing Institute)\n\n\n\n1 2 3 4 5 6\n\n2021\n\nPublications in MDPI journals are considered questionable. Editors have raised concerns about the robustness of MDPI's peer review process and their lack of selectivity in what they publish. Originally placed on Beall's List of predatory open journals in 2014, MDPI was removed from the list in 2015.\n\n1  \n\n\nMedia Bias/Fact Check (MBFC) WP:MBFC 📌\n\n\n\n1 2 3\n\n2019\n\nThere is consensus that Media Bias/Fact Check is generally unreliable, as it is self-published. Editors have questioned the methodology of the site's ratings.\n\n1  \n\n\nMedia Matters for America (MMfA)\n\n\n\n 2010  2019\n10[aa]\n\n\n2019\n\nThere is no consensus on the reliability of Media Matters for America. As a biased or opinionated source, their statements should be attributed.\n\n1  \n\n\n Media Research Center (MRC, CNSNews.com, Cybercast News Service, MRCTV, NewsBusters)\n\n\n\n 2010  2019  2020\n6[ab]\n\n\n2020\n\nThere is consensus that the Media Research Center and its subdivisions (e.g. CNSNews.com, MRCTV, and NewsBusters) are generally unreliable for factual reporting. Some editors believe these sources publish false or fabricated information. As biased or opinionated sources, their statements should be attributed.\n\n1  2  3  4  \n\n\nMediaite\n\n\n\n1 2 3\n\n2019\n\nThere is some consensus that Mediaite is only marginally reliable, and should be avoided where better sources are available. Editors consider the source to inappropriately blur news and opinion, and due weight should be considered if no other reliable sources support a given statement.\n\n1  \n\n\nMedium WP:MEDIUM 📌\n\n\n\n1 2 3 4\n\n2021\n\nMedium is a blog hosting service. As a self-published source, it is considered generally unreliable and should be avoided unless the author is a subject-matter expert or the blog is used for uncontroversial self-descriptions. Medium should never be used as a secondary source for living persons.\n\n1  \n\n\nMetacritic (GameRankings)\n\n\n\n10[ac]\n\n2017\n\nMetacritic is considered generally reliable for its review aggregation and its news articles on film, TV, and video games. There is no consensus on whether its blog articles and critic opinion pages are generally reliable for facts. There is consensus that user reviews on Metacritic are generally unreliable, as they are self-published sources. Reviewers tracked by Metacritic are not automatically reliable for their reviews. In December 2019, video game aggregate site GameRankings shut down and merged with Metacritic; GameRankings's content is no longer accessible unless archived.[13][14][15]\n\n1  2  \n\n\nMetal-experience.com\n\n\n\n 2021\n\n2021\n\nMetal-experience.com was determined to be generally unreliable for factual reporting. It is not notable enough to have a Wikipedia article.\n\n1  \n\n\nMetalSucks\n\n\n\n1 2\nA\n\n\n2018\n\nMetalSucks is considered usable for its reviews and news articles. Avoid its overly satirical content and exercise caution when MetalSucks is the only source making a statement.\n\n1  \n\n\nMetro (UK) WP:METRO 📌\n\n\n\n1 2 3 4 5 6 7\n\n2017\n\nThe reliability of Metro has been compared to that of the Daily Mail and other British tabloids. Articles published in the print newspaper (accessible via metro.news domain) are considered more reliable than articles published only on the metro.co.uk website.\n\n1  2  \n\n\nMiddle East Media Research Institute (MEMRI)\n\n\n\n 2020\n1 2 3\n\n\n2020\n\nThere is no consensus on the reliability of Middle East Media Research Institute or the accuracy of their translations. Editors are polarised between those who consider it to be a reliable source and those who consider it unreliable. Some editors consider MEMRI selective in what it chooses to translate.\n\n1  2  \n\n\nMintPress News\n\n\n\n 2019\n\n2019\n\nMintPress News was deprecated in the 2019 RfC, which showed consensus that the site publishes false or fabricated information.\n\n1  \n\n\nLe Monde diplomatique\n\n\n\n1 2 3 4\n\n2018\n\nThere is consensus that Le Monde diplomatique is generally reliable. Editors consider Le Monde diplomatique to be a biased and opinionated source.\n\n1  2  \n\n\nMondoweiss\n\n\n\n1 2 3 4 5 6 7 8\n\n2019\n\nMondoweiss is a news website operated by the Center for Economic Research and Social Change (CERSC), an advocacy organization. There is no consensus on the reliability of Mondoweiss. Editors consider the site biased or opinionated, and its statements should be attributed.\n\n1  \n\n\nMorning Star (UK)\n\n\n\n1 2 3\nA B\n\n\n2019\n\nThe Morning Star is a British tabloid with a low circulation and readership that the New Statesman has described as \"Britain's last communist newspaper\".[16] There is no consensus on whether the Morning Star engages in factual reporting, and broad consensus that it is a biased and partisan source. All uses of the Morning Star should be attributed. Take care to ensure that content from the Morning Star constitutes due weight in the article and conforms to the biographies of living persons policy.\n\n1  \n\n\nMother Jones (MoJo)\n\n\n\n1 2 3 4 5\n\n2019\n\nThere is consensus that Mother Jones is generally reliable. Almost all editors consider Mother Jones a biased source, so its statements (particularly on political topics) may need to be attributed. Consider whether content from this publication constitutes due weight before citing it in an article.\n\n1  \n\n\nMSNBC\n\n\n\n1 2\n\n2019\n\nThere is consensus that MSNBC is generally reliable. Talk show content should be treated as opinion pieces. See also: NBC News\n\n1  \n\n\nMyLife (Reunion.com)\n\n \n\n 2019  2019\n1\n\n\n2019\n\nDue to persistent abuse, MyLife is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. MyLife (formerly known as Reunion.com) is an information broker that publishes user-generated content, and is considered generally unreliable.\n\n1  2  \n\n\nThe Nation\n\n\n\n1 2 3 4 5 6 7\n\n2020\n\nThere is consensus that The Nation is generally reliable. In the \"About\" section of their website, they identify as progressive. Most editors consider The Nation a partisan source whose statements should be attributed. The publication's opinion pieces should be handled with the appropriate guideline. Take care to ensure that content from The Nation constitutes due weight in the article and conforms to the biographies of living persons policy.\n\n1  \n\n\nNational Enquirer\n\n\n\n 2019\n1 2 3 4 5 6\n\n\n2019\n\nThe National Enquirer is a supermarket tabloid that is considered generally unreliable. In the 2019 RfC, there was weak consensus to deprecate the National Enquirer as a source, but no consensus to create an edit filter to warn editors against using the publication.\n\n1  \n\n\nNational Geographic\n\n\n\n1 2 3\n\n2020\n\nThere is consensus that National Geographic is generally reliable. For coverage by National Geographic of fringe topics and ideas, due weight and parity of sources should be considered.\n\n1  \n\n\nNational Review (NR)\n\n\n\n1 2 3 4 5 6\n\n2018\n\nThere is no consensus on the reliability of National Review. Most editors consider National Review a partisan source whose statements should be attributed. The publication's opinion pieces should be handled with the appropriate guideline. Take care to ensure that content from the National Review constitutes due weight in the article and conforms to the biographies of living persons policy.\n\n1  \n\n\nNatural News (NewsTarget)\n\n \n\n 2019\n1\nA B\n\n\n2019\n\nDue to persistent abuse, Natural News is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. There is a near-unanimous consensus that the site repeatedly publishes false or fabricated information, including a large number of conspiracy theories.\n\n1  2  \n+494\n\n\n\nNBC News\n\n\n\n1 2\n\n2020\n\nThere is consensus that NBC News is generally reliable for news. See also: MSNBC\n\n1  \n\n\nThe Needle Drop\n\n\n\n 2021\n1\nA B\n\n\n2021\n\nThere is consensus that additional considerations apply when considering whether the use of The Needle Drop as a source is appropriate. There is currently strong consensus that Anthony Fantano's reviews that are published via The Needle Drop are self-published sources. There is currently rough consensus that Fantano is considered to be an established subject-matter expert as it pertains to music reviews and that these reviews may be used in an article as attributed opinion. However, per Wikipedia policy regarding self-published sources, these reviews should never be used as third-party sources about living people. There is also currently a rough consensus that Fantano's reviews do not always constitute due weight and that discretion should be applied on a case-by-case basis when determining if a review from The Needle Drop is appropriate to include in a given article.\n\n1  \n\n\nThe New American\n\n\n\n1 2 3 4 5 6\n\n2016\n\nThere is consensus that The New American is generally unreliable for factual reporting. Some editors consider it usable for attributed opinions regarding the John Birch Society.\n\n1  \n\n\nThe New Republic\n\n\n\n 2020\n1 2\n\n\n2020\n\nThere is consensus that The New Republic is generally reliable. Most editors consider The New Republic biased or opinionated. Opinions in the magazine should be attributed.\n\n1  \n\n\nNew Scientist WP:NEWSCIENTIST 📌\n\n\n\n1 2 3\n\n2021\n\nThere is consensus that New Scientist magazine is generally reliable for science coverage. Use New Scientist with caution to verify contentious claims.\n\n1  \n\n\n New York (Vulture, The Cut, Grub Street, Daily Intelligencer)\n\n\n\n1 2 3 4\n\n2016\n\nThere is consensus that New York magazine, including its subsidiary website Vulture, is generally reliable. There is no consensus on whether it is generally reliable for contentious statements. See also: Polygon, The Verge, Vox\n\n1  2  3  4  \n\n\nNew York Daily News (Illustrated Daily News)\n\n\n\n1 2 3\n\n2020\n\nMost editors consider the content of New York Daily News articles to be generally reliable, but question the accuracy of its tabloid-style headlines.\n\n1  \n\n\nNew York Post (New York Evening Post, Page Six)WP:NYPOST 📌 WP:PAGESIX 📌\n\n\n\n 2020\n1 2 3 4 5 6\n\n\n2021\n\nThere is consensus that the New York Post is generally unreliable for factual reporting especially with regard to politics, particularly New York City politics. A tabloid newspaper, editors criticise its lack of concern for fact-checking or corrections, including a number of examples of outright fabrication. Editors consider the New York Post more reliable in the period before it changed ownership in 1976, and particularly unreliable for coverage involving the New York City Police Department.\n\n1  2  \n\n\nThe New York Times (NYT) WP:NYT 📌 WP:NYTIMES 📌\n\n\n\n 2018\n38[ad]\n\n\n2020\n\nMost editors consider The New York Times generally reliable. WP:RSOPINION should be used to evaluate opinion columns, while WP:NEWSBLOG should be used for the blogs on The New York Times's website. The 2018 RfC cites WP:MEDPOP to establish that popular press sources such as The New York Times should generally not be used to support medical claims.\n\n1  \n\n\nThe New Yorker\n\n\n\n1 2\n\n2011\n\nThere is consensus that The New Yorker is generally reliable. Editors note the publication's robust fact-checking process.\n\n1  \n\n\nNews Break\n\n\n\n 2020\n\n2020\n\nNews Break is a news aggregator that publishes snippets of articles from other sources. In the 2020 RfC, there was consensus to deprecate News Break in favor of the original sources.\n\n1  \n\n\nNews of the World WP:NEWSOFTHEWORLD 📌\n\n\n\n 2019\n\n2019\n\nNews of the World was deprecated in the 2019 RfC. There is consensus that News of the World is generally unreliable. As is the case with The Sun, News of the World should not be used as a reference in most cases aside from about-self usage, and should not be used to determine notability. Some editors consider News of the World usable for uncontroversial film reviews if attribution is provided. News of the World shut down in 2011; website content is no longer accessible unless archived.\n\n1  2  \n\n\nNewsmax WP:NEWSMAX 📌\n\n\n\n 2020 1 2\n\n2020\n\nNewsmax was deprecated by snowball clause consensus in the November 2020 RfC. Concerns of editors included that Newsmax lacks adherence to journalistic standards, launders propaganda, promulgates misinformation, promotes conspiracy theories and false information for political purposes, and promotes medical misinformation such as COVID-19-related falsehoods, climate change denialism, conspiracy theories, and anti-vaccination propaganda.\n\n1  2  \n\n\nNewsweek (pre-2013)\n\n\n\n 2019\n1 2 3 4 5\n\n\n2019\n\nThere is consensus that articles from Newsweek pre-2013 are generally reliable for news covered during that time. In 2011, Newsweek was a reputable magazine with only some minor problems while it was owned by The Newsweek Daily Beast Company (which also owned The Daily Beast). Blogs under Newsweek, including The Gaggle, should be handled with the WP:NEWSBLOG policy. See also: Newsweek (2013–present).\n\n1  \n\n\nNewsweek (2013–present)\n\n\n\n 2019\n1 2 3 4 5\n\n\n2020\n\nUnlike articles before 2013, post-2013 Newsweek articles are not generally reliable. From 2013 to 2018, Newsweek was owned and operated by IBT Media, the parent company of International Business Times. IBT Media introduced a number of bad practices to the once reputable magazine and mainly focused on clickbait headlines over quality journalism. Its current relationship with IBT Media is unclear, and Newsweek's quality has not returned to its status prior to the 2013 purchase. Many editors have noted that there are several exceptions to this standard, so consensus is to evaluate Newsweek content on a case-by-case basis. See also: Newsweek (pre-2013).\n\n1  \n\n\nThe Next Web (TNW)\n\n\n\n1 2 3 4\n\n2019\n\nThere is no consensus on the reliability of The Next Web. Articles written by contributors may be subject to reduced or no editorial oversight. Avoid using The Next Web's sponsored content.\n\n1  \n\n\nNNDB (Notable Names Database) WP:NNDB 📌\n\n\n\n 2019\n1 2 3 4\n\n\n2019\n\nNNDB is a biographical database operated by Soylent Communications, the parent company of shock site Rotten.com. It was deprecated in the 2019 RfC. Editors note NNDB's poor reputation for fact-checking and accuracy, despite the site claiming to have an editorial process. Editors have also found instances of NNDB incorporating content from Wikipedia, which would make the use of the affected pages circular sourcing.\n\n1  \n\n\nNPR (National Public Radio)\n\n\n\n1 2 3\n\n2020\n\nThere is consensus that NPR is generally reliable for news and statements of fact. NPR's opinion pieces should only be used with attribution.\n\n1  \n\n\nOccupy Democrats\n\n\n\n 2018\n\n2018\n\nIn the 2018 RfC, there was clear consensus to deprecate Occupy Democrats as a source à la the Daily Mail. As with Breitbart News, this does not mean it cannot ever be used on Wikipedia; it means it cannot be used as a reference for facts. It can still be used as a primary source for attributing opinions, viewpoints, and the like.\n\n1  \n\n\nOne America News Network (OANN) WP:OANN 📌\n\n\n\n 2019\n1\n\n\n2019\n\nIn the 2019 RfC, there was clear consensus to deprecate One America News Network as a source à la the Daily Mail. Editors noted that One America News Network published a number of falsehoods, conspiracy theories, and intentionally misleading stories. One America News Network should not be used, ever, as a reference for facts, due to its unreliability. It can still be used as a primary source when attributing opinions, viewpoints, and commentary, meaning that it should not be used as a source outside of its own article.\n\n1  \n\n\nThe Onion\n\n\n\n1 2\n\n2019\n\nThe Onion is a satirical news website, and should not be used as a source for facts.\n\n1  \n\n\nOpIndia WP:OPINDIA 📌\n\n \n\n1 2\n\n2020\n\nDue to persistent abuse, OpIndia is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. OpIndia is considered generally unreliable due to its poor reputation for fact-checking and accuracy. OpIndia was rejected by the International Fact-Checking Network when it applied for accreditation in 2019. In the 2020 discussion, most editors expressed support for deprecating OpIndia. Editors consider the site biased or opinionated. OpIndia has directly attacked and doxed Wikipedia editors who edit India-related articles. Posting or linking to another editor's personal information is prohibited under the outing policy, unless the editor is voluntarily disclosing the information on Wikipedia. Editors who are subject to legal risks due to their activity on Wikipedia may request assistance from the Wikimedia Foundation, although support is not guaranteed. See also: Swarajya.\n\n1  2  \n\n\nOur Campaigns\n\n\n\n 2021\n\n2021\n\nOur Campaigns is considered generally unreliable due to its publishing of user-generated content.\n\n1  \n\n\nPanAm Post\n\n\n\n 2020\n\n2020\n\nThere is consensus that the PanAm Post is generally unreliable for factual reporting. Most editors consider the publication biased or opinionated. Some editors note that the PanAm Post is used by other reliable sources and only believe that its opinion section should be avoided.\n\n1  \n\n\nPatheos WP:PATHEOS 📌\n\n\n\n1 2 3\n\n2015\n\nPatheos is a website that hosts a collection of blogs. These blogs receive little editorial oversight and should be treated as self-published sources. Some editors have shown support for including Patheos articles as a source when cited together with other more reliable sources.\n\n1  \n\n\nPeerage websites (self-published)\n\n\n\n 2020  2020\n12[ae]\n\n\n2020\n\nTwo RfCs found consensus that certain self-published peerage websites are not reliable for genealogical information and should be deprecated. See § Self-published peerage websites for the full list.\n\nList\n\n\nPeople\n\n\n\n 2013\n1 2 3\n4\n\n\n2014\n\nThere is consensus that People magazine can be a reliable source in biographies of living persons, but the magazine should not be used for contentious claims unless supplemented with a stronger source.\n\n1  \n\n\nPew Research Center\n\n\n\n1 2\n\n2012\n\nThere is consensus that the Pew Research Center is generally reliable.\n\n1  2  3  4  5  6  7  8  \n\n\nPinkNews\n\n\n\n 2020\n1 2 3\n\n\n2020\n\nThere is rough consensus that PinkNews is generally reliable for factual reporting, but additional considerations may apply and caution should be used. Most of those who commented on PinkNews' reliability for statements about a person's sexuality said that such claims had to be based on direct quotes from the subject.\n\n1  \n\n\nPlayboy\n\n\n\n1 2 3 4 5 6 7 8\n\n2015\n\nThere is consensus that Playboy is generally reliable. Editors note the publication's reputation for high-quality interviews and fact-checking.\n\n1  \n\n\nThe Points Guy (news and reviews) (TPG)\n\n \n\n 2018  2019\nA B C\n\n\n2019\n\nThere is no consensus on the reliability of news articles and reviews on The Points Guy. The Points Guy has advertising relationships with credit card and travel companies, and content involving these companies should be avoided as sources. The Points Guy is currently on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. See also: The Points Guy (sponsored content).\n\n1  2  \n\n\nThe Points Guy (sponsored content) (TPG)\n\n \n\n 2018  2019\nA B C\n\n\n2019\n\nThere is consensus that sponsored content on The Points Guy, including content involving credit cards, should not be used as sources. The Points Guy has advertising relationships with credit card and travel companies, receiving compensation from readers signing up for credit cards via the website's links. The Points Guy is currently on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. See also: The Points Guy (news and reviews).\n\n1  \n\n\nPolitico\n\n\n\n1 2 3 4 5 6\n\n2018\n\nPolitico is considered generally reliable for American politics. A small number of editors say that Politico is a biased source.\n\n1  \n\n\nPolitiFact (PunditFact)\n\n\n\n 2016  2019\n\n2019\n\nPolitiFact is a reliable source for reporting the veracity of statements made by political candidates. PolitiFact is a reliable source for reporting the percentage of false statements made by a political candidate (of the statements checked by PolitiFact), provided that attribution is given, as a primary source.\n\n1  \n\n\nPolygon\n\n\n\n1 2\n\n2020\n\nPolygon is considered generally reliable for video games and pop culture related topics. See also: The Verge, Vox, New York\n\n1  \n\n\nThe Post Millennial\n\n\n\n 2020\n1 2\n\n\n2020\n\nThere is consensus that The Post Millennial is generally unreliable. Editors have noted multiple instances of inaccurate reporting, and consider the publication to be strongly biased.\n\n1  \n\n\nPR Newswire WP:PRNEWSWIRE 📌\n\n\n\n1 2 3 4 5\n\n2019\n\nThere is consensus that PR Newswire is generally unreliable, as press releases published on the site are not subject to editorial oversight. Some articles may be used for uncontroversial claims about the article's author.\n\n1  2  \n\n\nPress TV\n\n\n\n 2020\n1 2 3 4 5 6\n\n\n2020\n\nThere is consensus that Press TV is generally unreliable. As a state-owned media network in a country with low press freedom, Press TV may be a primary source for the viewpoint of the Iranian government, although due weight should be considered. Press TV is biased or opinionated, and its statements should be attributed. Press TV is particularly known for promoting anti-Semitic conspiracy theories, including Holocaust denial.[17]\n\n1  2  \n\n\nPride.com\n\n\n\n 2020\n\n2020\n\nThere is consensus that Pride.com is marginally reliable and that its articles should be evaluated for reliability on a case-by-case basis. Editors consider Pride.com comparable to BuzzFeed in its presentation.\n\n1  \n\n\nProject Veritas WP:VERITAS 📌\n\n\n\n1 2\n\n2020\n\nThere is consensus that Project Veritas is generally unreliable due to its reputation for selectively editing its videos. As an activist group, Project Veritas is a biased or opinionated source.\n\n1  \n\n\nProPublica\n\n\n\n 2019\n1\n\n\n2019\n\nThere is a strong consensus that ProPublica is generally reliable for all purposes because it has an excellent reputation for fact-checking and accuracy, is widely cited by reliable sources, and has received multiple Pulitzer Prizes.\n\n1  \n\n\nQuackwatch\n\n\n\n 2019\n+13[af]\n\n\n2019\n\nArticles written by Stephen Barrett on Quackwatch are considered generally reliable (as Barrett is a subject-matter expert) and self-published (as there is disagreement on the comprehensiveness of Quackwatch's editorial process); Barrett's articles should not be used as a source of information on other living persons. Articles written by other authors on Quackwatch are not considered self-published. Many editors believe uses of Quackwatch should be evaluated on a case-by-case basis, and some editors say its statements should be attributed. It may be preferable to use the sources cited by Quackwatch instead of Quackwatch itself. Since it often covers fringe material, parity of sources should be considered.\n\n1  \n\n\nQuadrant\n\n\n\n 2019\n\n2019\n\nMost editors consider Quadrant generally unreliable for factual reporting. The publication is a biased and opinionated source.\n\n1  \n\n\nQuartz\n\n\n\n1 2\n\n2020\n\nQuartz is considered generally reliable for factual reporting, although some editors argue that caution should be used for science and bitcoin topics.\n\n1  \n\n\nQuillette\n\n\n\n 2020\n1 2 3\n\n\n2020\n\nThere is consensus that Quillette is generally unreliable for facts, with non-trivial minorities arguing for either full deprecation or \"considerations apply\". Quillette is primarily a publication of opinion, and thus actual usage in articles will usually be a question of whether or not it is WP:DUE for an attributed opinion rather than whether it is reliable for a factual claim.\n\n1  \n\n\nQuora\n\n\n\n1 2 3 4\n\n2019\n\nQuora is a Q&A site. As an Internet forum, it is a self-published source that incorporates user-generated content, and is considered generally unreliable. Posts from verified accounts on Quora can be used as primary sources for statements about themselves. Posts from verified accounts of established experts may also be used to substantiate statements in their field of expertise, in accordance with the policy on self-published sources.\n\n1  \n\n\nRadio Free Asia (RFA)\n\n\n\n 2021\n1 2\n\n\n2021\n\nRadio Free Asia can be generally considered a reliable source. In particularly geopolitically-charged areas, attribution of its point of view and funding by the U.S. government may be appropriate. Per the result of a 2021 RfC, editors have established that there is little reason to think RFA demonstrates some systematic inaccuracy, unreliability, or level of government co-option that precludes its use.\n\n1  \n\n\nRappler WP:RAPPLER 📌\n\n\n\n1 2 3\n\n2018\n\nThere is consensus that staff content by Rappler is generally reliable. The IMHO section consists of opinions by readers, and not by paid staff. The defunct x.rappler.com section functioned as a self-published blogging service, and is therefore considered generally unreliable.\n\n1  \n\n\nRate Your Music (RYM, Cinemos, Glitchwave, Sonemic)\n\n\n\n 2019\n1\nA\n\n\n2019\n\nRate Your Music was deprecated in the 2019 RfC. The content on Rate Your Music is user-generated, and is considered generally unreliable.\n\n1  2  3  4  \n\n\nThe Raw Story\n\n\n\n 2021\n1 2 3 4 5\n\n\n2021\n\nThere is consensus that The Raw Story is generally unreliable for factual reporting, based upon a pattern of publishing false and sensationalized stories. Editors almost unanimously agree that the source is biased and that in-text attribution should accompany each use of the source.\n\n1  \n\n\nRealClearPolitics (RCP, RealClearInvestigations)\n\n\n\n1 2\n\n2021\n\nThere is no consensus as to RealClearPolitics's reliability. They appear to have the trappings of a reliable source, but their tactics in news reporting suggest they may be publishing non-factual or misleading information. Use as a source in a Wikipedia article should probably only be done with caution, and better yet should be avoided.\n\n1  2  \n\n\nReason\n\n\n\n1 2\n\n2020\n\nThere is consensus that Reason is generally reliable for news and facts. Editors consider Reason to be a biased or opinionated source that primarily publishes commentary, analysis, and opinion articles. Statements of opinion should be attributed and evaluated for due weight.\n\n1  \n\n\nReddit\n\n\n\n1 2 3 4 5\n\n2020\n\nReddit is a social news and discussion website. Reddit contains mostly user-generated content, and is considered both self-published and generally unreliable. Interview responses written by verified interviewees on the r/IAmA subreddit are primary sources, and editors disagree on their reliability. The policy on the use of sources about themselves applies.\n\n1  \n\n\nRedState\n\n\n\n1 2\n\n2020\n\nThere is consensus that RedState should not be used as a source of facts. Opinion pieces from RedState are likely to be undue.\n\n1  \n\n\nThe Register (\"El Reg\")\n\n\n\n1 2 3 4 5\nA\n\n\n2017\n\nThe Register is considered generally reliable for technology-related articles. Some editors say that The Register is biased or opinionated on topics involving Wikipedia.\n\n1  \n\n\nReligion News Service (RNS)\n\n\n\n1 2\n\n2020\n\nReligion News Service is considered generally reliable. Use RNS with caution to verify contentious claims.\n\n1  \n\n\nResearchGate\n\n\n\n1 2 3\n\n2019\n\nResearchGate is a social network that hosts a repository of user-generated publications, including preprints. ResearchGate does not perform fact checking or peer reviewing, and is considered a self-published source. Verify whether a paper on ResearchGate is also published in a peer-reviewed academic journal; in these cases, cite the more reliable journal and provide an open access link to the paper (which may be hosted on ResearchGate).\n\n1  \n\n\nRepublic TV\n\n\n\n1 2\n\n2020\n\nRepublic TV was criticized for spreading misinformation about COVID-19, the Love Jihad conspiracy theory, and other fabrications and factually incorrect information.\n\n1  2  \n\n\nReuters\n\n\n\n1 2 3\n\n2018\n\nReuters is a news agency. There is consensus that Reuters is generally reliable. Syndicated reports from Reuters that are published in other sources are also considered generally reliable. Press releases published by Reuters are not automatically reliable.\n\n1  \n\n\nRhythmOne (AllMusic, AllMovie, AllGame, All Media Guide, AllRovi)WP:ALLMUSIC 📌\n\n\n\n26[ag]\n\n2021\n\nRhythmOne (who acquired All Media Guide, formerly AllRovi) operates the websites AllMusic, AllMovie, and AllGame (defunct). There is consensus that RhythmOne websites are usable for entertainment reviews with attribution. Some editors question the accuracy of these websites for biographical details and recommend more reliable sources when available. Editors also advise against using AllMusic's genre classifications from the website's sidebar. Listings without accompanying prose do not count toward notability.\n\n1  2  3  \n\n\nRIA Novosti\n\n\n\n1 2 3 4\n\n2016\n\nRIA Novosti was an official news agency of the Russian government. There is a broad consensus that it is a biased and opinionated source. It is generally considered usable for official government statements and positions. There is no consensus on whether it is reliable for other topics, though opinions generally lean towards unreliability. See also: Sputnik, which replaced the international edition of RIA Novosti.\n\n1  2  \n\n\nRolling Stone\n\n\n\n1 2 3 4 5 6 7 8 9\n\n2019\n\nThere is consensus that Rolling Stone is generally reliable. Rolling Stone's opinion pieces and reviews, as well as any contentious statements regarding living persons, should only be used with attribution. The publication's capsule reviews deserve less weight than their full-length reviews, as they are subject to a lower standard of fact-checking. Some editors say that Rolling Stone is a partisan source in the field of politics, and that their statements in this field should also be attributed.\n\n1  \n\n\nRotten Tomatoes\n\n\n\n1 2 3 4\nA B C\n\n\n2015\n\nRotten Tomatoes is considered generally reliable for its review aggregation and its news articles on film and TV. There is no consensus on whether its blog articles and critic opinion pages are generally reliable for facts. There is consensus that user reviews on Rotten Tomatoes are generally unreliable, as they are self-published sources. Reviewers tracked by Rotten Tomatoes are not automatically reliable for their reviews, while there is no consensus on whether their \"Top Critics\" are generally reliable.\n\n1  \n\n\n RT (Russia Today)\n\n\n\n 2020\n1 2 3 4 5 6\n\n\n2020\n\nThere is consensus that RT is an unreliable source, publishes false or fabricated information, and should be deprecated along the lines of the Daily Mail. Many editors describe RT as a mouthpiece of the Russian government that engages in propaganda and disinformation.\n\n1  2  \n\n\nSalon\n\n\n\n1 2 3\n\n2018\n\nThere is no consensus on the reliability of Salon. Editors consider Salon biased or opinionated, and its statements should be attributed.\n\n1  \n\n\nScience-Based Medicine\n\n\n\n 2019\n1 2\n\n\n2019\n\nScience-Based Medicine is considered generally reliable, as it has a credible editorial board, publishes a robust set of editorial guidelines, and has been cited by other reliable sources. Editors do not consider Science-Based Medicine a self-published source, but it is also not a peer-reviewed publication with respect to WP:MEDRS. Since it often covers fringe material, parity of sources may be relevant.\n\n1  \n\n\nScienceBlogs\n\n\n\n1 2 3 4 5 6 7\nA\n\n\n2012\n\nScienceBlogs is an invitation-only network of blogs. There is no consensus on the reliability of ScienceBlogs articles in general. Most editors consider ScienceBlogs articles written by subject-matter experts reliable, though articles outside the writer's relevant field are not. As a self-published source it should not be used as a source of information on other living persons. Since it often covers fringe material, parity of sources may be relevant.\n\n1  \n\n\nScientific American (SA, SciAm)\n\n\n\n1 2\n\n2020\n\nScientific American is considered generally reliable for popular science content. Use WP:MEDPOP to determine whether the publication's medical coverage should be used.\n\n1  \n\n\nSCOTUSblog\n\n\n\n 2021\n1 2\n\n\n2021\n\nIn a 2021 RfC, there was strong consensus that SCOTUSblog is generally reliable for law-related topics. Some authors on SCOTUSblog are subject-matter experts, but editors do not consider the website an academic source. Editors recommend in-text attribution for SCOTUSblog's opinion and analysis articles.\n\n1  \n\n\nScreen Rant\n\n\n\n 2021\n1\n\n\n2021\n\nThere is no consensus on the reliability of Screen Rant. It is considered reliable for entertainment-related topics, and should not be used for controversial statements related to living persons.\n\n1  \n\n\nScribd\n\n\n\n1 2 3 4\n\n2016\n\nScribd operates a self-publishing platform for documents and audiobooks. It is considered generally unreliable, especially for biographies of living persons. Anyone can upload any document they'd like and there is no assurance that it hasn't been manipulated. Many documents on Scribd's self-publishing platform violate copyrights, so linking to them from Wikipedia would also violate the WP:COPYVIOEL guideline and the WP:COPYVIO policy. If a particular document hosted on the platform is in itself reliable, editors are advised to cite the source without linking to the Scribd entry.\n\n1  \n\n\nScriptural texts (Bible, Quran)WP:RSPSCRIPTURE 📌\n\n\n\n 2020\n1 2 3 4\n\n\n2021\n\nScriptural texts, like the Bible and the Quran, are primary sources only suitable for attributed, relevant quotes and in compliance with other Wikipedia content policies and guidelines. Content that interprets or summarizes scriptural passages or narratives should generally be cited to appropriate scholarly sources (for example, in the academic field of religious studies) and attributed when appropriate. Analysis of scriptural content by Wikipedia editors is prohibited by the Wikipedia policy regarding original research, and a 2020 discussion found no consensus on whether unsourced summaries of scriptual texts should be allowed under MOS:PLOTSOURCE.\n\n—\n\n\nSherdog\n\n\n\n 2020\n\n2020\n\nIn the 2020 RfC, Sherdog was determined to be not self-published and can be used for basic information on MMA fighters and matches. However, it is considered less reliable than ESPN and other generally reliable sources, so use with caution.\n\n1  \n\n\nSixth Tone (general topics)\n\n\n\n 2020\n\n2020\n\nSixth Tone is usable for general non-political topics, such as Chinese society and culture. See also: Sixth Tone (politics).\n\n1  \n\n\nSixth Tone (politics)\n\n\n\n 2020\n\n2020\n\nSixth Tone is published by the Shanghai United Media Group, which is government-controlled. Editors consider Sixth Tone generally unreliable for politics. See also: Sixth Tone (general topics).\n\n1  \n\n\nThe Skeptic's Dictionary\n\n\n\n1 2 3 4\n\n2020\n\nThe Skeptic's Dictionary is a book by Robert Todd Carroll that expanded into a website. The website is a self-published source (by a subject-matter expert) and should not be used as a source of information on other living persons. Attribution may be necessary. In some cases, it's preferable to read and cite the sources cited by The Skeptic's Dictionary. As it often covers fringe material, parity of sources may be relevant.\n\n1  \n\n\nThe Skwawkbox\n\n\n\n1 2\n\n2020\n\nThe Skwawkbox is considered generally unreliable because it is self-published. Most editors describe The Skwawkbox as biased or opinionated.\n\n1  \n\n\nSlate\n\n\n\n1 2 3\nA B\n\n\n2015\n\nSlate is considered generally reliable for its areas of expertise. Contrarian news articles may need to be attributed.\n\n1  2  \n\n\nSnopes WP:SNOPES 📌\n\n\n\n14[ah]\n\n2020\n\nSnopes is certified by the International Fact-Checking Network, and is considered generally reliable. Attribution may be necessary. Since it often covers fringe material, parity of sources may be relevant.\n\n1  \n\n\nSoftpedia\n\n\n\n1 2\nA\n\n\n2019\n\nSoftpedia is considered reliable for its software and product reviews. There is no consensus on whether Softpedia news articles are generally reliable.\n\n1  \n\n\nSourceWatch\n\n\n\n1 2 3\n\n2016\n\nAs an open wiki, SourceWatch is considered generally unreliable. SourceWatch is operated by the Center for Media and Democracy.\n\n1  \n\n\nSouth China Morning Post (SCMP, Sunday Morning Post)WP:SCMP 📌\n\n\n\n 2020\n1\n2\n3\n\n\n2020\n\nThe South China Morning Post is widely considered to be the English-language newspaper of record in Hong Kong. In the 2020 RFC, there was consensus that the SCMP is generally reliable. However, in addition, there is a rough consensus that additional considerations may apply for the newspaper's coverage of certain topics, including the Chinese Communist Party and the SCMP's current owner, Alibaba. Editors may apply higher scrutiny when dealing with the SCMP's coverage of such topics.\n\n1  \n\n\nSouthern Poverty Law Center (SPLC)WP:SPLC 📌\n\n\n\n+17[ai]\n\n2021\n\nThe Southern Poverty Law Center is considered generally reliable on topics related to hate groups and extremism in the United States. As an advocacy group, the SPLC is a biased and opinionated source. The organization's views, especially when labeling hate groups, should be attributed per WP:RSOPINION. Take care to ensure that content from the SPLC constitutes due weight in the article and conforms to the biographies of living persons policy. Some editors have questioned the reliability of the SPLC on non-United States topics. SPLC classifications should not automatically be included in the lead section of the article about the group which received the classification. The decision to include should rather be decided on a case-by-case basis.\n\n1  \n\n\nSpirit of Metal\n\n\n\n1 2\n\n2010\n\nSpirit of Metal is considered a self-published source and generally unreliable.\n\n1  \n\n\nSparkNotes\n\n\n\n1 2\n\n2018\n\nSparkNotes is a study guide. Editors consider SparkNotes usable for superficial analyses of literature, and recommend supplementing SparkNotes citations with additional sources.\n\n1  \n\n\n The Spectator WP:SPECTATOR 📌\n\n\n\n1 2\n\n2020\n\nThe Spectator primarily consists of opinion pieces and these should be judged by WP:RSOPINION, WP:RSEDITORIAL, and WP:NEWSBLOG.\n\n1  2  \n\n\nDer Spiegel (Spiegel Online, SPON)\n\n\n\n10[aj]\n\n2018\n\nThere is consensus that Der Spiegel is generally reliable. Articles written by Claas Relotius are generally unreliable as this particular journalist has been found to fabricate articles.\n\n1  \n\n\nSputnik\n\n\n\n 2020\n1 2 3\n\n\n2020\n\nThere is consensus that Sputnik is an unreliable source that publishes false or fabricated information, and should be deprecated as in the 2017 RfC of the Daily Mail. Sputnik is considered a Russian propaganda outlet that engages in bias and disinformation,[18] a significant proportion of editors endorse that view, with some editors considering it less reliable than Breitbart News. See also: RIA Novosti, whose international edition was replaced by Sputnik.\n\n1  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17  18  19  \n\n\nStack Exchange (Stack Overflow, MathOverflow, Ask Ubuntu)\n\n\n\n1 2\nA\n\n\n2018\n\nStack Exchange is a network of Q&A sites, including Stack Overflow, MathOverflow, and Ask Ubuntu. As an Internet forum, it is a self-published source that incorporates user-generated content, and is considered generally unreliable.\n\n1  2  3  4  5  6  \n\n\nStarsUnfolded\n\n\n\n1 2 3\n\n2020\n\nThere is consensus that StarsUnfolded is unreliable as it is a self-published source. It is not notable enough to have a Wikipedia article.\n\n1  \n\n\nThe Sun (UK) (The Sun on Sunday, The Irish Sun, The Scottish Sun)WP:THESUN 📌\n\n\n\n 2019\n15[ak]\n\n\n2020\n\nThe Sun was deprecated in the 2019 RfC. There is consensus that The Sun is generally unreliable. References from The Sun are actively discouraged from being used in any article and they should not be used for determining the notability of any subject. The RfC does not override WP:ABOUTSELF, which allows the use of The Sun for uncontroversial self-descriptions. Some editors consider The Sun usable for uncontroversial sports reporting, although more reliable sources are recommended.\n\n1  2  3  4  5  6  \n\n\nSwarajya\n\n \n\n1 2\n\n2020\n\nDue to persistent abuse, Swarajya is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. Swarajya is considered generally unreliable due to its poor reputation for fact-checking and accuracy. In the 2020 discussion, most editors expressed support for deprecating Swarajya. Editors consider the publication biased or opinionated. Swarajya was formerly the parent publication of OpIndia, and frequently republishes content from OpIndia under the \"Swarajya Staff\" byline. See also: OpIndia.\n\n1  \n\n\nTaki's Magazine (Takimag, Taki's Top Drawer)\n\n\n\n 2019\n1\n\n\n2019\n\nTaki's Magazine was deprecated in the 2019 RfC, which showed consensus that it is an unreliable opinion magazine that should be avoided outside of very limited exceptions (e.g. WP:ABOUTSELF).\n\n1  \n\n\nTASS (ТАСС, ITAR-TASS, Telegraph Agency of the Soviet Union)\n\n\n\n 2019\n\n2019\n\nIn the 2019 RfC, editors argued that the reliability of TASS varies based on the subject matter. Editors consider TASS fairly reliable for statements of fact as stated by the Russian government, but also agree that there are deficiencies in the reliability of TASS's reporting on other issues.\n\n1  2  \n\n\nTechCrunch\n\n\n\n1 2 3 4\n\n2018\n\nCareful consideration should be given to whether a piece is written by staff or as a part of their blog, as well as whether the piece/writer may have a conflict of interest, and to what extent they rely on public relations material from their subject for their writing. TechCrunch may be useful for satisfying verifiability, but may be less useful for the purpose of determining notability.\n\n1  \n\n\nTelesur\n\n\n\n 2019\n1 2\n\n\n2019\n\nTelesur was deprecated in the 2019 RfC, which showed consensus that the TV channel is a Bolivarian propaganda outlet. Many editors state that Telesur publishes false information. As a state-owned media network in a country with low press freedom, Telesur may be a primary source for the viewpoint of the Venezuelan government, although due weight should be considered. Telesur is biased or opinionated, and its statements should be attributed.\n\n1  2  \n\n\nTheWrap\n\n\n\n1 2\n\n2017\n\nAs an industry trade publication, there is consensus that TheWrap is a good source for entertainment news and media analysis. There is no consensus regarding the reliability of TheWrap's articles on other topics.\n\n1  \n\n\nThinkProgress\n\n\n\n 2013\n1 2\n\n\n2013\n\nDiscussions of ThinkProgress are dated, with the most recent in 2013. Circumstances may have changed. Some consider ThinkProgress a form of WP:NEWSBLOG, and reliable for attributed statements of opinion. Others argue that ThinkProgress is generally reliable under WP:NEWSORG, albeit with due consideration for their political leanings. ThinkProgress is generally considered a partisan source for the purposes of US politics.\n\n1  \n\n\nTime\n\n\n\n1 2 3 4 5\n\n2019\n\nThere is consensus that Time is generally reliable. Time's magazine blogs, including Techland, should be handled with the appropriate policy. Refer to WP:NEWSORG for guidance on op-eds, which should only be used with attribution.\n\n1  \n\n\nThe Times (The Sunday Times, The Times of London)\n\n\n\n1 2 3 4 5 6 7\nA\n\n\n2015\n\nThe Times, including its sister paper The Sunday Times, is considered generally reliable.\n\n1  2  3  \n\n\nThe Times of India (TOI)WP:TOI 📌\n\n\n\n 2020\n1\n\n\n2020\n\nThe Times of India is considered to have a reliability between no consensus and generally unreliable. It tends to have a bias in favor of the Indian government.\n\n1  \n\n\nTMZ WP:TMZ 📌\n\n\n\n13[al]\n\n2016\n\nThere is no consensus on the reliability of TMZ. Although TMZ is cited by reliable sources, most editors consider TMZ a low-quality source and prefer more reliable sources when available. Because TMZ frequently publishes articles on rumors and speculation without named authors, it is recommended to attribute statements from TMZ. When TMZ is the only source for a piece of information, consider whether the information constitutes due or undue weight, especially when the subject is a living person.\n\n1  \n\n\nTorrentFreak (TF)\n\n\n\n1 2 3 4 5 6 7 8\n\n2019\n\nMost editors consider TorrentFreak generally reliable on topics involving file sharing. Editors note references to the website in mainstream media. The source may or may not be reliable for other topics.\n\n1  \n\n\nTownhall\n\n\n\n1 2\n\n2010\n\nAs of 2010, a few editors commented that opinion pieces in Townhall are reliable as a source for the opinion of the author of the individual piece, although they may not be reliable for unattributed statements of fact, and context will dictate whether the opinion of the author as such, meets the standard of WP:DUEWEIGHT.\n\n1  \n\n\nTRT World\n\n\n\n 2019\n\n2019\n\nConsensus exists that TRT World is reliable for statements regarding the official views of the Turkish government but not reliable for subjects with which the Turkish government could be construed to have a conflict of interest. For other miscellaneous cases, it shall be assumed to be reliable enough.\n\n1  \n\n\nThe Truth About Guns (TTAG) WP:TTAG 📌\n\n\n\n1 2 3\n\n2019\n\nThe Truth About Guns is a group blog. There is consensus that TTAG does not have a strong reputation for fact-checking and accuracy. TTAG has promoted conspiracy theories, and does not clearly label its sponsored content. Editors agree that TTAG is biased or opinionated. Opinions in TTAG are likely to constitute undue weight.\n\n1  \n\n\nTunefind\n\n\n\n1 2\n\n2019\n\nTunefind is almost entirely composed of user-generated content, and is a self-published source.\n\n1  \n\n\nTV.com\n\n\n\n1 2 3 4 5 6\n\n2020\n\nTV.com is largely user-generated and generally unreliable. Some editors believe material published by its own staff may be cited.\n\n1  \n\n\nTV Guide\n\n\n\n1 2 3\n\n2021\n\nTV Guide is considered generally reliable for television-related topics. Some editors consider TV Guide a primary source for air dates.\n\n1  2  \n\n\nTV Tropes\n\n\n\n1 2\nA\n\n\n2016\n\nTV Tropes is considered generally unreliable because it is an open wiki, which is a type of self-published source.\n\n1  \n\n\nTwitter WP:RSPTWITTER 📌\n\n\n\n38[am]\n\n2020\n\nTwitter is a social network. As a self-published source, it is considered generally unreliable and should be avoided unless the author is a subject-matter expert or the tweet is used for an uncontroversial self-description. In most cases, Twitter accounts should only be cited if they are verified accounts or if the user's identity is confirmed in some way. Tweets that are not covered by reliable sources are likely to constitute undue weight. Twitter should never be used for third-party claims related to living persons.\n\n1  \n\n\nUrban Dictionary\n\n\n\n1 2 3\n\n2020\n\nUrban Dictionary is considered generally unreliable, because it consists solely of user-generated content.\n\n1  \n\n\nU.S. News & World Report\n\n\n\n1 2 3\n\n2020\n\nThere is consensus that U.S. News & World Report is generally reliable.\n\n1  \n\n\nUs Weekly\n\n\n\n1 2 3 4 5\n\n2018\n\nThere is no consensus on the reliability of Us Weekly. It is often considered less reliable than People magazine.\n\n1  \n\n\nUSA Today\n\n\n\n1 2 3 4\nA B\n\n\n2018\n\nThere is consensus that USA Today is generally reliable. Editors note the publication's robust editorial process and its centrist alignment.\n\n1  \n\n\nVanity Fair WP:VANITYFAIR 📌\n\n\n\n1 2 3\n\n2020\n\nVanity Fair is considered generally reliable, including for popular culture topics. Some editors say it is biased or opinionated.\n\n1  \n\n\nVariety WP:VARIETY 📌\n\n\n\n1 2 3 4 5\n\n2016\n\nAs an entertainment trade magazine, Variety is considered a reliable source in its field.\n\n1  \n\n\nVDARE\n\n\n\n 2018\n1\n\n\n2019\n\nVDARE was deprecated in the 2018 RfC. Editors agree that it is generally unusable as a source, although there may be rare exceptions such as in identifying its writers in an about-self fashion. Such limited instances will only be under careful and guided (\"filtered\") discretion.\n\n1  \n\n\nVenezuelanalysis\n\n\n\n 2019\n1\nA B\n\n\n2019\n\nThere is consensus that Venezuelanalysis is generally unreliable. Some editors consider Venezuelanalysis a Bolivarian propaganda outlet, and most editors question its accuracy. Almost all editors describe the site as biased or opinionated, so its claims should be attributed.\n\n1  \n\n\nVentureBeat\n\n\n\n1 2\nA B\n\n\n2015\n\nVentureBeat is considered generally reliable for articles relating to businesses, technology and video games.\n\n1  \n\n\nThe Verge\n\n\n\n 2018\n1\n\n\n2019\n\nThere is broad consensus that The Verge is a reliable source for use in articles relating to technology, science, and automobiles. Some editors question the quality of The Verge's instructional content on computer hardware. See also: Vox, Polygon, New York\n\n1  \n\n\nVeterans Today\n\n \n\n 2019  2019\n1 2\n\n\n2019\n\nDue to persistent abuse, Veterans Today is on the Wikipedia spam blacklist, and links must be whitelisted before they can be used. Veterans Today was deprecated in the 2019 RfC, which showed unanimous consensus that the site publishes fake news and antisemitic conspiracy theories. The use of Veterans Today as a reference should be generally prohibited, especially when other more reliable sources exist. Veterans Today should not be used for determining notability, or used as a secondary source in articles.\n\n1  \n\n\nVGChartz\n\n\n\n 2019\n+10[an]\n\n\n2019\n\nIn the 2019 RfC, editors unanimously agreed that VGChartz is generally unreliable. The site consists mainly of news articles that qualify as user-generated content. In addition, editors heavily criticize VGChartz for poor accuracy standards in its video game sales data, and its methodology page consists of wholly unverified claims.[19] If other reliable sources publish video game sales data for certain regions (usually The NPD Group, Chart-Track, and/or Media Create), it is strongly advised that editors cite those sources instead.\n\n1  \n\n\nVice Media (Garage, i-D, Refinery29, Vice, Vice News, Motherboard)\n\n\n\n1 2 3 4 5 6\n\n2021\n\nThere is no consensus on the reliability of Vice Media publications.\n\n1  2  3  4  \n\n\nVogue\n\n\n\n1 2 3 4\n\n2018\n\nVogue is considered generally reliable. Potentially contentious statements made by Vogue interview subjects can be attributed to the individual.\n\n1  \n\n\nVoltaire Network\n\n\n\n 2020\n\n2020\n\nThe Voltaire Network is considered unreliable due to its affiliation with conspiracy theorist Thierry Meyssan and its republication of articles from Global Research. Editors unanimously agreed to deprecate the Voltaire Network in the 2020 RfC.\n\n1  \n\n\nVox (Recode) WP:RSPVOX 📌\n\n\n\n1 2 3 4\n\n2020\n\nVox is considered generally reliable. Some editors say that Vox is a partisan source in the field of politics. See also: Polygon, The Verge, New York \n\n1  \n\n\nThe Wall Street Journal (WSJ)\n\n\n\n1 2 3 4 5\n\n2019\n\nMost editors consider The Wall Street Journal generally reliable for news. Use WP:NEWSBLOG to evaluate the newspaper's blogs, including Washington Wire. Use WP:RSOPINION for opinion pieces.\n\n1  \n\n\nWashington Examiner\n\n\n\n1 2 3 4 5 6 7 8\n\n2020\n\nThere is no consensus on the reliability of the Washington Examiner, but there is consensus that it should not be used to substantiate exceptional claims. Almost all editors consider the Washington Examiner a partisan source and believe that statements from this publication should be attributed. The Washington Examiner publishes opinion columns, which should be handled with the appropriate guideline.\n\n1  \n\n\nThe Washington Post (WaPo) WP:WAPO 📌\n\n\n\n17[ao]\n\n2021\n\nMost editors consider The Washington Post generally reliable. Some editors note that WP:NEWSBLOG should be used to evaluate blog posts on The Washington Post's website.\n\n1  \n\n\nThe Washington Times\n\n\n\n 2021\n1 2 3 4\n\n\n2021\n\nThere is consensus that The Washington Times is a marginally reliable source for politics and science. Most editors agree that it is a partisan source. Some editors noted a history of publishing inaccurate or false information, of being slow to issue retractions or corrections, and of sometimes only doing so under the threat of legal action; a considerable minority favored deprecation on these grounds. The Washington Times is probably suitable for its mundane political coverage, although better sources should be preferred when available. The Washington Times should generally not be used for contentious claims, especially about living persons. A majority of editors regard the The Washington Times as generally reliable for topics other than politics and science. Opinion columns are governed by WP:RSOPINION and WP:NEWSBLOG. Some editors observed that The Washington Times has a conflict of interest regarding the Unification movement and related topics.\n\n1  \n\n\nWeather2Travel.com\n\n\n\n1 2\n\n2012\n\nWeather2Travel is a website operated by UK-based Global Support Limited. It expressly disclaims all content as indicative only and unfit to be relied upon. Some editors expressed concerns it may have a conflict of interest by way of some commercial ties.\n\n1  \n\n\nThe Weekly Standard\n\n\n\n1 2 3\n\n2014\n\nThe Weekly Standard is considered generally reliable, but much of their published content is opinion and should be attributed as such. Most editors say this magazine is a partisan source.\n\n1  \n\n\nThe Western Journal(Western Journalism)\n\n\n\n 2019\n1\n\n\n2019\n\nIn the 2019 RfC, there was consensus that The Western Journal is generally unreliable, but no consensus on whether The Western Journal should be deprecated. The publication's syndicated content should be evaluated by the reliability of its original publisher.\n\n1  \n\n\nWe Got This Covered WP:WEGOTTHISCOVERED 📌\n\n\n\n1 2\n\n2020\n\nWe Got This Covered is generally unreliable due to the lack of its editoral oversight, publication of unsubstantiated or false rumors, speculations claiming as fact, and contributions accepting from non-staff contributors.\n\n1  \n\n\nWhatCulture\n\n\n\n1 2\n\n2020\n\nWhatCulture is considered generally unreliable. Contributors \"do not need to have any relevant experience or hold any particular qualifications\" and editors note a poor record of fact checking. It is listed as an unreliable source by WikiProject Professional wrestling.\n\n1  \n\n\nWho's Who (UK)\n\n\n\n1 2 3\n\n2019\n\nThere is no consensus on the reliability of Who's Who UK. It is a reference work with information mainly collected from the people concerned. Editors are divided on whether sufficient editorial control exists, and whether it is an independent source. It is generally considered more reliable than Marquis Who's Who, which is published in the United States. See also: Marquis Who's Who.\n\n1  \n\n\nWhoSampled\n\n\n\n1 2\n\n2016\n\nWhoSampled is almost entirely composed of user-generated content, and is a self-published source.\n\n1  \n\n\nWikidata\n\n\n\n 2013  2018\n1 2\n\n\n2018\n\nWikidata is largely user-generated, and articles should not directly cite Wikidata as a source (just as it would be inappropriate to cite other Wikipedias' articles as sources). See also: Wikidata transcluded statements.\n\n1  \n\n\nWikidata transcluded statements\n\n\n\n 2013  2018\n1 2\n\n\n2018\n\nUniquely among WMF sites, Wikidata's statements can be directly transcluded into articles; this is usually done to provide external links or infobox data. For example, more than two million external links from Wikidata are shown through the {{Authority control}} template. There has been controversy over the use of Wikidata in the English Wikipedia due to its infancy, its vandalism issues and its sourcing. While there is no consensus on whether information from Wikidata should be used at all, there is general agreement that any Wikidata statements transcluded need to be just as – or more – reliable compared to Wikipedia content. As such, Module:WikidataIB and some related modules and templates filter unsourced Wikidata statements by default; however, other modules and templates, such as Module:Wikidata, do not. See also: Wikidata (direct citations).\n\n—\n\n\nWikiLeaks\n\n\n\n13[ap]\n\n2020\n\nWikiLeaks is a repository of primary source documents leaked by anonymous sources. Some editors believe that documents from WikiLeaks fail the verifiability policy, because WikiLeaks does not adequately authenticate them, and there are concerns regarding whether the documents are genuine or tampered. It may be appropriate to cite a document from WikiLeaks as a primary source, but only if it is discussed by a reliable source. However, linking to material that violates copyright is prohibited by WP:COPYLINK.\n\n1  \n\n\nWikinews\n\n\n\n1 2 3 4 5 6 7 8\n\n2012\n\nMost editors believe that Wikinews articles do not meet Wikipedia's verifiability standards. As Wikinews does not enforce a strong editorial policy, many editors consider the site equivalent to a self-published source, which is generally unreliable.\n\n1  \n\n\nWikipedia (The Signpost)WP:RSPWP 📌\n\n\n\n+19[aq]\n\n2020\n\nWikipedia is not a reliable source because open wikis are self-published sources. This includes articles, non-article pages, The Signpost, non-English Wikipedias, Wikipedia Books, and Wikipedia mirrors; see WP:CIRCULAR for guidance.[20] Occasionally, inexperienced editors may unintentionally cite the Wikipedia article about a publication instead of the publication itself; in these cases, fix the citation instead of removing it. Although citing Wikipedia as a source is against policy, content can be copied between articles with proper attribution; see WP:COPYWITHIN for instructions.\n\n1  \n\n\nWired (Wired UK)\n\n\n\n+10[ar]\n\n2018\n\nWired magazine is considered generally reliable for science and technology.\n\n1  2  \n\n\nWordPress.com\n\n\n\n14[as]\n\n2020\n\nWordPress.com is a blog hosting service that runs on the WordPress software. As a self-published source, it is considered generally unreliable and should be avoided unless the author is a subject-matter expert or the blog is used for uncontroversial self-descriptions. WordPress.com should never be used for claims related to living persons; this includes interviews, as even those cannot be authenticated.\n\n1  \n\n\nWorldNetDaily (WND)WP:WND 📌\n\n\n\n 2018\n16[at]\n\n\n2018\n\nWorldNetDaily was deprecated in the 2018 RfC. There is clear consensus that WorldNetDaily is not a reliable source, and that it should not be used because of its particularly poor reputation for fact-checking and accuracy. The website is known for promoting falsehoods and conspiracy theories. Most editors consider WorldNetDaily a partisan source. WorldNetDaily's syndicated content should be evaluated by the reliability of its original publisher, and the citation should preferably point to the original publisher.\n\n1  2  \n\n\nWorldometer (Worldometers)\n\n\n\n1 2 3\n\n2020\n\nWorldometer is a self-published source and editors have questioned its accuracy and methodology. It is disallowed by WikiProject COVID-19 as a source for statistics on the COVID-19 pandemic and is considered generally unreliable for other topics.\n\n1  \n\n\nXinhua News Agency (New China News Agency) WP:XINHUA 📌\n\n\n\n 2020\n1 2 3\n\n\n2021\n\nXinhua News Agency is the official state-run press agency of the People's Republic of China. There is consensus that Xinhua is generally reliable for factual reporting except in areas where the government of China may have a reason to use it for propaganda or disinformation. Xinhua is also generally reliable for the views and positions of the Chinese government and its officials. For subjects where the Chinese government may be a stakeholder, the consensus is almost unanimous that Xinhua cannot be trusted to cover them accurately and dispassionately; some editors favour outright deprecation because of its lack of editorial independence. There is no consensus for applying any one single label to the whole of the agency. Caution should be exercised in using this source, extremely so in case of extraordinary claims on controversial subjects or biographies of living people. When in doubt, try to find better sources instead; use inline attribution if you must use Xinhua.\n\n1  2  \n\n\nYouTube WP:RSPYT 📌\n\n\n\n 2020\n+21[au]\n\n\n2020\n\nMost videos on YouTube are anonymous, self-published, and unverifiable, and should not be used at all. Content uploaded from a verified official account, such as that of a news organization, may be treated as originating from the uploader and therefore inheriting their level of reliability. However, many YouTube videos from unofficial accounts are copyright violations and should not be linked from Wikipedia, according to WP:COPYLINK. See also WP:YOUTUBE and WP:VIDEOLINK.\n\n1  \n\n\nZDNet\n\n\n\n1 2 3 4 5 6 7\n\n2018\n\nZDNet is considered generally reliable for technology-related articles.\n\n1  \n\n\nZero Hedge (ZH)WP:ZEROHEDGE 📌\n\n\n\n 2020\n1 2 3\n\n\n2020\n\nZero Hedge was deprecated in the 2020 RfC due to its propagation of conspiracy theories. It is a self-published blog that is biased or opinionated.\n\n1  \n\n\nZoomInfo\n\n \n\n 2020\n1 2\n\n\n2020\n\nDue to persistent abuse, ZoomInfo is currently on the Wikipedia spam blacklist, and links must be whitelisted before they can be used.\n\n1  \n\nCategories[edit]\nSelf-published peerage websites[edit]\nThe following self-published peerage websites have been deprecated in requests for comment:\n\n\nalmanach.be  \nalmanachdegotha.org  \nangelfire.com/realm/gotha  \nchivalricorders.org  \ncracroftspeerage.co.uk  \nenglishmonarchs.co.uk  \njacobite.ca  \nroyalark.net  \nthepeerage.com  \nworldstatesmen.org  \n\nSee § Peerage websites for the corresponding entry.\n\nState-sponsored fake news sites[edit]\nA limited number of sites are identified by credible sources (e.g. the EU's anti-disinformation East Stratcom Task Force) as disseminators of fake news. Many of these are state-sponsored. These sites are considered unreliable and should be blacklisted when identified. See Wikipedia:Reliable sources/Noticeboard/Archive 281 § RfC: Deprecation of fake news / disinformation sites.\n\n\ndan-news.info  \nnews-front.info  \nrusdialog.ru  \nsouthfront.org  \ntopwar.ru  \nukraina.ru  \nveteransnewsnow.com  \n\nStudent media[edit]\nShortcutWP:RSSM\nReputable student media outlets, such as The Harvard Crimson, are considered generally reliable sources for news on their school and local community.[21][22][23] They can sometimes be considered reliable on other topics, although professional sources are typically preferred when available.[22] However, given their local audience, student media may be challenged or discounted during notability discussions about topics related to home institutions. A topic which can be sourced exclusively to student media, with no evidence of wider coverage in mass market general interest media, is not likely to be viewed as notable.\n\nSee also[edit]\n\nExternal links/Perennial websites, a list of websites used as external links\nFake news websites, a list of websites that intentionally publish hoaxes\nNeutrality of sources, an essay on the use of reliable, but non-neutral, sources\nNew page patrol source guide, a list of sources organized by reliability, region, and topic\nNewspaper of record, newspapers whose editorial and news-gathering functions are considered authoritative\nPotentially unreliable sources, a list of questionable sources\nSatirical news websites, a list of websites that publish humorous fake news stories\nThe Wikipedia CiteWatch, a bot-compiled list of potentially problematic sources, ranked by frequency of use\nUnreliable/Predatory Source Detector, a user script designed to detect unreliable sources\n\nTopic-specific pages[edit]\n\nWikiProject Africa/Africa Sources list, a list of African sources\nWikiProject Albums/Sources, a list of sources about music\nWikiProject Video games/Sources, a list of sources about video games\nWikipedia:WikiProject Film/Resources\nWikipedia:WikiProject Korea/Reliable sources\nWikipedia:WikiProject Christian music/Sources\nWikipedia:WikiProject Venezuela/Reliable and unreliable sources\n\nTemplates and categories[edit]\n\n{{RSP entry}}\n{{Deprecated inline}}\nCategory:All articles with deprecated sources\n\nNotes[edit]\n\n\n^ This is the case for some of the most prestigious academic journals in the world, like Nature and The Lancet.\n\n^ See also these discussions of Advameg:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\nA\n\n^ See these discussions of BBC:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n\n^ See these discussions of Blogger:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n\n^ See also these discussions of Breitbart News:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\nA\n\n^ See also these discussions of Business Insider:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n^ See these discussions of The Christian Science Monitor:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n\n^ See these discussions of CNET: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16\n\n^ See these discussions of CNN:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n\n^ See also these discussions of the Daily Mail:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n\n^ See these discussions of The Daily Telegraph: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16\n\n^ See these discussions of Dotdash:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n\n^ See these discussions of Encyclopædia Britannica:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n\n^ See these discussions of Forbes.com contributors:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n\n^ a b c Local Fox affiliates are considered distinct from Fox News, and are covered by WP:NEWSORG.\n\n^ See also these discussions of Fox News (news excluding politics and science):\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n^ See also these discussions of Fox News (politics and science):\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n\n^ See these discussions of GlobalSecurity.org:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n\n^ See these discussions of The Guardian:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n\n^ See these discussions of The Guardian blogs:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n^ See these discussions of The Hill:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n^ See these discussions of HuffPost (excluding politics):\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n\n^ See these discussions of HuffPost (politics):\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n^ See these discussions of HuffPost contributors:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n\n^ See these discussions of IGN:\n1\n2\n3\n4\n5\n6\nA\nB\nC\nD\nE\nF\n\n^ See also these discussions of IMDb:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\nA\nB\nC\nD\nE\nF\n\n^ See also these discussions of Media Matters for America:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n^ See also these discussions of the Media Research Center:\n1\n2\n3\n4\n5\n6\n\n^ See these discussions of Metacritic:\n1\n2\nA\nB\nC\nD\nE\nF\nG\nH\n\n^ See also these discussions of The New York Times:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n\n^ See also these discussions of peerage websites (self-published):\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n\n^ See also these discussions of Quackwatch:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\nA\nB\n\n^ See these discussions of RhythmOne:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n\n^ See these discussions of Snopes:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n\n^ See these discussions of the Southern Poverty Law Center:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\nA\n\n^ See these discussions of Der Spiegel:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n^ See also these discussions of The Sun (UK):\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n\n^ See these discussions of TMZ:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n\n^ See these discussions of Twitter:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n\n^ See also these discussions of VGChartz:\nA\nB\nC\nD\nE\nF\nG\nH\nI\nJ\n\n^ See these discussions of The Washington Post:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n\n^ See these discussions of WikiLeaks:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n\n^ See these discussions of Wikipedia:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\nA\n\n^ See these discussions of Wired:\n1\n2\n3\n4\n5\n6\n7\n8\n9\nA\n\n^ See these discussions of WordPress.com:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n\n^ See also these discussions of WorldNetDaily:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n\n^ See also these discussions of YouTube:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\nA\n\n\nReferences[edit]\n\n\n^ \"Ballotpedia: About\". Ballotpedia. Archived from the original on November 7, 2018. Retrieved October 23, 2018. CS1 maint: discouraged parameter (link)\n\n^ Bond, Paul (December 2, 2018). \"TheBlaze and CRTV Merge to Create Conservative Media Powerhouse (Exclusive)\". The Hollywood Reporter. Archived from the original on December 18, 2018. Retrieved December 23, 2018. CS1 maint: discouraged parameter (link)\n\n^ Mitchell, Amy; Gottfried, Jeffrey; Kiley, Jocelyn; Matsa, Katerina Eva (October 21, 2014). \"Media Sources: Distinct Favorites Emerge on the Left and Right\". Pew Research Center. Archived from the original on October 20, 2018. Retrieved October 23, 2018. CS1 maint: discouraged parameter (link)\n\n^ Wang, Shan (September 15, 2017). \"BuzzFeed's strategy for getting content to do well on all platforms? Adaptation and a lot of A/B testing\". Nieman Lab. Archived from the original on November 21, 2018. Retrieved October 23, 2018. CS1 maint: discouraged parameter (link)\n\n^ Wang, Shan (July 18, 2018). \"The investigations and reporting of BuzzFeed News — *not* BuzzFeed — are now at their own BuzzFeedNews.com\". Nieman Lab. Archived from the original on November 30, 2018. Retrieved October 23, 2018. CS1 maint: discouraged parameter (link)\n\n^ Harris, Malcolm (September 19, 2018). \"The Big Secret of Celebrity Wealth (Is That No One Knows Anything)\". The New York Times. Archived from the original on September 27, 2018. Retrieved September 29, 2018. CS1 maint: discouraged parameter (link)\n\n^ \"Our Portfolio\". Digital Currency Group. Archived from the original on August 23, 2018. Retrieved November 21, 2018. CS1 maint: discouraged parameter (link)\n\n^ \"FACT CHECK: Is Mohammed the Most Popular Name for Newborn Boys in the Netherlands?\". Snopes.com. Retrieved April 29, 2018. CS1 maint: discouraged parameter (link)\n\n^ \"Carson Didn't Find HUD Errors\". FactCheck.org. April 19, 2017. Retrieved April 29, 2018. CS1 maint: discouraged parameter (link)\n\n^ Dreyfuss, Emily (May 3, 2017). \"RIP About.com\". Wired. ISSN 1059-1028. Archived from the original on August 25, 2018. Retrieved December 29, 2018 – via www.wired.com. CS1 maint: discouraged parameter (link)\n\n^ Shields, Mike (December 18, 2017). \"About.com had become a web relic, so its owner blew it up — and now it's enjoying a surge in revenue\". Business Insider. Archived from the original on June 25, 2018. Retrieved December 29, 2018. CS1 maint: discouraged parameter (link)\n\n^ \"Contribute – Find A Grave\". www.findagrave.com. Archived from the original on July 31, 2018. Retrieved July 30, 2018.\n\n^ Plunkett, Luke (December 5, 2019). \"RIP Gamerankings.com\". Kotaku. G/O Media. Retrieved December 6, 2019. CS1 maint: discouraged parameter (link)\n\n^ \"GameRankings Shutting down\". Archived from the original on December 4, 2019.\n\n^ McAloon, Alissa (December 5, 2019). \"Review aggregator site GameRankings is shutting down\". Gamasutra. Retrieved December 5, 2019. CS1 maint: discouraged parameter (link)\n\n^ Platt, Edward (August 4, 2015). \"Inside the Morning Star, Britain's last communist newspaper\". New Statesman. Archived from the original on February 7, 2019. Retrieved January 31, 2019. CS1 maint: discouraged parameter (link)\n\n^ Anti-Defamation League (October 17, 2013). \"Iran's Press TV: Broadcasting Anti-Semitism to the English-Speaking World\" (PDF). Archived (PDF) from the original on January 3, 2019. Retrieved August 8, 2018. CS1 maint: discouraged parameter (link)\n\n^ MacFarquhar, Neil (August 28, 2016). \"A Powerful Russian Weapon: The Spread of False Stories\". The New York Times. Archived from the original on February 21, 2017. Retrieved August 29, 2016. CS1 maint: discouraged parameter (link)\n\n^ Carless, Simon (June 23, 2008). \"Analysis: What VGChartz Does (And Doesn't) Do For The Game Biz\". Gamasutra. Retrieved October 3, 2014. CS1 maint: discouraged parameter (link)\n\n^ \"Can we trust Wikipedia? 1.4 billion people can't be wrong\". The Independent. February 19, 2018. Archived from the original on February 11, 2019. Retrieved February 22, 2019. CS1 maint: discouraged parameter (link)\n\n^ \"Wikipedia:Reliable sources/Noticeboard/Archive 134\". Wikipedia. July 23, 2017. Retrieved April 22, 2020. CS1 maint: discouraged parameter (link)\n\n^ a b \"Wikipedia:Reliable sources/Noticeboard/Archive 288\". Wikipedia. April 21, 2020. Retrieved April 22, 2020. CS1 maint: discouraged parameter (link)\n\n^ \"Wikipedia:Reliable sources/Noticeboard/Archive 46\". Wikipedia. February 13, 2020.\n\n\nExternal links[edit]\nMeta:Cite Unseen, a user script that helps readers quickly evaluate the sources used in a given English Wikipedia article\nGoogle custom search of generally reliable sources listed on this page\nGoogle custom search for generally reliable sources for video games\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Wikipedia:Reliable_sources/Perennial_sources&oldid=1022029257\"\nCategories: Wikipedia supplemental pagesWikipedia cultureWikiProject lists of online reliable sourcesWikipedia perennial sourcesHidden categories: CS1 maint: discouraged parameterProject pages with short description\n\n\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nNot logged inTalkContributionsCreate accountLog in\n\n\n\n\n\nNamespaces\n\n\nProject pageTalk\n\n\n\n\n\nVariants\n\n\n\n\n\n\n\n\n\nViews\n\n\nReadEditView history\n\n\n\n\n\nMore\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\nContribute\n\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationWikidata item\n\n\n\n\nPrint/export\n\n\nDownload as PDFPrintable version\n\n\n\n\nLanguages\n\n\nفارسیFrançaisLietuviųPortuguêsTiếng Việt中文\nEdit links\n\n\n\n\n\n\n This page was last edited on 8 May 2021, at 01:18 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n"