"\n\n\n\n\n\n\nWikipedia:Requests for page protection\n\nFrom Wikipedia, the free encyclopedia\n\n\n\nJump to navigation\nJump to search\nWikimedia noticeboard for requesting protection of pages\n\"WP:RFP\" and \"WP:RPP\" redirect here. You may also be looking for Wikipedia:Requests for permissions, Wikipedia:Requesting copyright permission, or Wikipedia:Random page patrol.\nvteNoticeboardsWikipedia's centralized discussion, request, and help venues. For a listing of ongoing discussions and current requests, see the dashboard.General\nAdministrators\nmain\nincidents\nBots\nBureaucrats\nCentralized discussion\nClosure requests\nEducation\nInterface admins\nMain Page errors\nOpen proxies\nOTRS\nOversight\nUser permissions\nArticles and content\nBiographies of living persons\nCopyrights\nquestions on media\nproblems\nDispute resolution\nExternal links\nFringe theories\nNeutral point of view\nOriginal research\nReliable sources\nResource requests\nSpam\nblacklist\nwhitelist\nScalable vector graphics\nTitleblacklist\nTranslation\nPage handling\nHistory merges\nMergers\nSplits\nMoves\nProtection\nImportation\nXfD\nArticles\nRedirects\nCategories\nTemplates\nFiles\nMiscellany\nUndeletion\nUser conduct\nConflict of interest\nContributor copyright\nEdit warring and 3RR\nSanctions\nPersonal restrictions\nGeneral sanctions\nSockpuppets\nUsernames\nVandalism\nOther\nArbitration\nCommittee noticeboard\nrequests\nenforcement\nEdit filters\nrequested\nfalse positives\nQuestions\nEditor assistance\nHelp desk\nTeahouse\nReference desk\nNew articles\nRequests for comment\nVillage pump\npolicy\ntechnical\nproposals\nidea lab\nWMF\nmiscellaneous\nWikiProject proposals\n Category:Wikipedia noticeboards\nSkip to TOC\nSkip to bottom\n\n\n\nRequests for page protection\n\n\n\nShortcutsWP:RFPPWP:RFPWP:RPP\nThis page is for requesting that a page, file or template be fully protected, create protected (salted), extended confirmed protected, semi-protected, added to pending changes, move-protected, template protected, upload protected (file-specific), or unprotected. Please read the protection policy for details. Full protection is used to stop edit warring between multiple users or to prevent vandalism to high-risk templates; semi-protection and pending changes are usually used only to prevent IP and new user vandalism (see the rough guide to semi-protection); and move protection is used to stop page-move wars. Extended confirmed protection is used where semi-protection has proved insufficient (see the rough guide to extended confirmed protection)\nAfter a page has been protected, the protection is listed in the page history and logs with a short description indicating why it was protected, and the article is listed on Special:Protectedpages. Further discussion should take place on the Talk page of the article. In the case of full protection due to edit warring, admins do not revert to specific versions of the page, except to get rid of obvious vandalism.\n\n\nSkip to table of contents\nrequests to raise protection\nlower protection\nrequested edits\nrolling archive (up to 7 days)\n(purge)\nInstructions\n\nIf you would like to request to have a page protected, have a page's existing protection level lowered or raised, or would like to submit an edit request for a protected page, please follow these steps (note: if you enable the Twinkle gadget for your Wikipedia account, this process can be largely automated for you):\n\nIf you are requesting unprotection, the correct protocol is to ask the protecting administrator first for unprotection (the admin's user account name can be found in the page's edit history). If for any reason he or she is unresponsive, unwilling, or unable to lower protection then you may list your request on this page.\nAdd a level-3 header (i.e. === [[Example title]] ===) with the exact title of the page you would like (un)protected. If the page is not in the article namespace, include the namespace prefix (e.g. Template:Example template or User:Example user). Place your request at the bottom of either the protection or unprotection list, depending on the nature of your request. Please make sure you have spelled the name of the article properly; a common error stems from mistaken requests for the protection of redirects, particularly capitalised ones (Twinkle can make sure this never happens to you!)\nPlace the pagelinks template below the header, in the form of * {{pagelinks|Example title}} (note the asterisk).\nIf you are requesting protection, write the type of request (full protection, semi-protection, pending changes, move protection) and a brief reason for your request below your header.\nPlease do not add arbitrary requests for a protection expiry time to your request, or request indefinite protection arbitrarily.\nIf there is a reason for a page to be protected for a certain amount of time, such as protecting a user talk page until the user is unblocked, please make this clear.\nIf you are requesting indefinite semi-protection or pending changes, be aware that it is only applied to articles with endemic and endless vandalism problems that multiple increasing periods of temporary semi-protection or pending changes have failed to stop.\nNote that different expiry times can be set for edit- and for move-protections— thus, an article can, for example, be semi-edit-protected for a week and also fully-move-protected indefinitely.\nSign your request with four tildes ~~~~ and click Publish changes.\nNote: editors should not consider requesting page protection as a method for continuing an argument from elsewhere nor as a venue for starting a new discussion regarding article content. If a request contains excessive argument, appears to be intended to resolve a content dispute, includes personal attacks or uncivil comments, or has any other unrelated discussion, it will be removed from this page and no action will be taken.\nExamples\nFor single page requests\n=== [[Example Article Name]] ===\n* {{pagelinks|Example Article Name}}\n'''Semi-protection:''' High level of IP vandalism. ~~~~\n=== [[Template:Example Template Name]] ===\n* {{pagelinks|Template:Example Template Name}}\n'''Reduction in protection level:''' From full protection to template editor protection. ~~~~\nFor multiple page requests with the same criteria\n=== Short descriptive header ===\n* {{pagelinks|Wikipedia:Example Page Name 1}}\n* {{pagelinks|Wikipedia:Example Page Name 2}}\n'''Temporary semi-protection:''' High level of IP vandalism. ~~~~\n You can subscribe to a web feed of this page in either RSS or Atom format.\n\nThis header: viewtalkedit\n\n\nAdministrator instructions\n\n\nContents\n\n1 Current requests for increase in protection level\n\n1.1 Eran Elhaik\n1.2 Freddie Freeman\n1.3 Big Hit Music\n1.4 Magda Szubanski\n1.5 Komi Can't Communicate\n1.6 Ikwerre people\n1.7 Chabacano metro station\n1.8 Francis Habgood\n1.9 KP Sharma Oli\n1.10 Eastern Security Network\n1.11 Once Upon a Time in Hollywood\n1.12 Education in England\n1.13 Galileo's Leaning Tower of Pisa experiment\n1.14 List of centenarians (politicians and civil servants)\n1.15 Pissing Razors\n1.16 Jason Ravnsborg\n1.17 Ghanzi\n1.18 Statistics of the COVID-19 pandemic in Indonesia\n1.19 Operation Guardian of the Walls\n1.20 Arabs\n1.21 Hajj\n1.22 Robert Buckland\n1.23 Persecution\n1.24 Gearspace\n1.25 John McGuirk\n1.26 Somebody's Watching Me\n1.27 Macaron\n1.28 Bulgaria national football team\n1.29 User:Jay\n1.30 Among Us\n1.31 Gavin McInnes\n1.32 Dominic Fike\n1.33 Aymeric Laporte\n1.34 TeenNick\n1.35 Azam Khan (politician)\n1.36 Legality of bestiality by country or territory\n1.37 Karim Khan Zand\n1.38 Kimiya Hosseini\n1.39 Talk:Xinjiang internment camps\n1.40 Tinga Tinga Tales\n1.41 Fawn Island\n1.42 List_of_Hail_Mary_passes_in_American_football\n1.43 Anthony Elanga\n\n\n2 Current requests for reduction in protection level\n3 Current requests for edits to a protected page\n4 Handled requests\n\n\nCurrent requests for increase in protection level[edit]\nPlace requests for new or upgrading pending changes, semi-protection, full protection, move protection, create protection, template editor protection, or upload protection at the BOTTOM of this section. Check the rolling archive of fulfilled and denied requests or, failing that, the page history if you cannot find your request. Only recently answered requests are still listed here.\n\nEran Elhaik[edit]\nEran Elhaik (edit | talk | history | links | watch | logs)\nTemporary extended confirmed protection: Arbitration enforcement – This edit [1] clearly has to do with the I/P conflict hence I ask temp prot. Shrike (talk) 14:21, 9 May 2021 (UTC)\n\nFreddie Freeman[edit]\nFreddie Freeman (edit | talk | history | links | watch | logs)\nSemi-protection: Persistent vandalism – Recent mass obstructive vandalism of a BLP sports article with consistent viewing traffic. Needs temporary protection for a short period to limit more imminent high chance vandalism. ₛₒₘₑBₒdyₐₙyBₒdy₀₅ (talk) 04:39, 10 May 2021 (UTC)\nAutomated comment: This user who requested protection has been blocked.—cyberbot ITalk to my owner:Online 15:54, 10 May 2021 (UTC)\n\nBig Hit Music[edit]\nBig Hit Music (edit | talk | history | links | watch | logs)\nIndefinite semi-protection: Persistent vandalism – IP user continously adding incorrect information onto the artists section. For instance, adding ENHYPEN which is managed by Belift Lab (another Hybe Corporation subsidiary) instead of Big Hit Music. And also adding Source Music and Pledis Entertainment artists onto the list which is incorrect. Requesting indefinite semi-protection as this article is essential a split from Hybe Corporation (which is already semi-protected indefinitely), the reason why Hybe Corporation article was semi-protected indefinitely is simply due to the same reason I'm filing this report for. — Paper9oll (🔔 • 📝) 07:02, 10 May 2021 (UTC)\n\nMagda Szubanski[edit]\nMagda Szubanski (edit | talk | history | links | watch | logs)\nTemporary semi-protection: BLP policy violations – Single IP jumping editor edit warring to add \"controversy\" in the lead not supported by cite and not in the article.  Has made no attempt to discuss on talk page, impossible to reach because editing from a different IP every time. Escape Orbit (Talk) 10:25, 10 May 2021 (UTC)\n\nKomi Can't Communicate[edit]\nKomi Can't Communicate (edit | talk | history | links | watch | logs)\nSemi-protection for 2 or 3 days: Persistent addition of unsourced content, specially, an anime adaptation was leaked and a bunch of new editors feel the need to add it. Please protect it to prevent that from happening until it is officially announced. Link20XX (talk) 14:16, 10 May 2021 (UTC)\n\nIkwerre people[edit]\nIkwerre people (edit | talk | history | links | watch | logs)\nIndefinite semi-protection Persistent vandalism from several IPs and users, and pushing certain POV, the page seems controversial topic. Nyanardsan (talk) 15:03, 10 May 2021 (UTC)\n\nChabacano metro station[edit]\nChabacano metro station (edit | talk | history | links | watch | logs)\nTemporary pending changes: Persistent sockpuppetry. (CC) Tbhotch™ 15:52, 10 May 2021 (UTC)\n\nFrancis Habgood[edit]\nFrancis Habgood (edit | talk | history | links | watch | logs)\nTemporary extended confirmed protection: Persistent disruptive editing – A single focus account is obsessed with removing references and details that they consider \"irrelevant\". I'd appreciate if it could be protected from such disruption. Gaia Octavia Agrippa Talk  16:58, 10 May 2021 (UTC)\n\nKP Sharma Oli[edit]\nKP Sharma Oli (edit | talk | history | links | watch | logs)\nIndefinite semi-protection: Persistent disruptive editing – surge in disruptive editing just after previous protection expired. Yeti Dai (talk) 17:18, 10 May 2021 (UTC)\n\nEastern Security Network[edit]\nEastern Security Network (edit | talk | history | links | watch | logs)\nTemporary semi-protection: Content Dispute/Edit Warring. There has been considerable edit-warring between SPAs on this page for a few weeks now. The page needs some protection so it can be cleaned up and worked on properly. JBchrch (talk) 19:50, 10 May 2021 (UTC) Gaelan: FYI. --JBchrch (talk) 19:50, 10 May 2021 (UTC)\n\nIn my opinion the only worthwhile protection here would be WP:ECP, possibly a month. There is a steady stream of new users adding POV to the article (words such as 'terrorist' or 'peaceful' applied without qualification to one group or another group). Semiprotection wouldn't be useful because the problem is not from IPs. Full protection would stop all progress on the article. Due to the unrest in Nigeria this may become an important article. EdJohnston (talk) 03:33, 11 May 2021 (UTC)\nBut, due to content dispute/edit warring, temporary full protection at least a week would be necessary because of disagreement over the article's edit with well-sourced content. 36.77.95.215 (talk) 06:29, 11 May 2021 (UTC)\nYeah, I think this is correct. JBchrch (talk) 12:01, 11 May 2021 (UTC)\n Extended confirmed protected – 2 months. Anyone who isn't able to edit at this moment can ask for a change using {{Edit extended-protected}} on the article talk page . EdJohnston (talk) 15:48, 11 May 2021 (UTC)\nOnce Upon a Time in Hollywood[edit]\nOnce Upon a Time in Hollywood (edit | talk | history | links | watch | logs)\nTemporary Semi-Protection: Persistent vandalism — Persitent petty vandalism of the article by anonymous editors. Varies in content and volume. Samurai Kung fu Cowboy (talk) 22:47, 10 May 2021 (UTC)\n\nEducation in England[edit]\nEducation in England (edit | talk | history | links | watch | logs)\nExtended confirmed protection: Persistent sockpuppetry – Resumption of sock activity 1 minute after lifting of 3 month period of protection. Mutt Lunker (talk) 23:34, 10 May 2021 (UTC)\n\nGalileo's Leaning Tower of Pisa experiment[edit]\nGalileo's Leaning Tower of Pisa experiment (edit | talk | history | links | watch | logs)\nIndefinite pending changes: Persistent vandalism – Long-term target for vandals.  — Mr. Guye (talk) (contribs)  01:40, 11 May 2021 (UTC)\n\nList of centenarians (politicians and civil servants)[edit]\nList of centenarians (politicians and civil servants) (edit | talk | history | links | watch | logs)\nSemi-protection A disruptive IP (who used their current IP while under a block of their previous IP) has resumed the editing which resulted in this article requiring autoconfirmation for 1 year. Disruptive edit confirmed and subsequently reverted. DerbyCountyinNZ (Talk Contribs) 05:04, 11 May 2021 (UTC)\n\nPissing Razors[edit]\nPissing Razors (edit | talk | history | links | watch | logs)\nTemporary semi-protection: Persistent disruptive editing. FMSky (talk) 06:36, 11 May 2021 (UTC)\n\nJason Ravnsborg[edit]\nJason Ravnsborg (edit | talk | history | links | watch | logs)\nTemporary semi-protection: BLP Policy Violations. I would recommend protection for a few months for attention to die down. Curbon7 (talk) 06:56, 11 May 2021 (UTC)\n\nGhanzi[edit]\nGhanzi (edit | talk | history | links | watch | logs)\nSemi-protection: High level of IP vandalism. Urbanoc (talk) 08:11, 11 May 2021 (UTC)\n\nStatistics of the COVID-19 pandemic in Indonesia[edit]\nStatistics of the COVID-19 pandemic in Indonesia (edit | talk | history | links | watch | logs)\nTemporary semi-protection: Persistent addition of unsourced or poorly sourced content. Flix11 (talk) 11:13, 11 May 2021 (UTC)\n\nOperation Guardian of the Walls[edit]\nOperation Guardian of the Walls (edit | talk | history | links | watch | logs)\nIndefinite extended confirmed protection: Arbitration enforcement – Per Wikipedia:Arbitration/Requests/Case/Palestine-Israel_articles_4#ARBPIA_General_Sanctions, pre-emptive 500/30 protection is applied on all articles broadly related to the Arab-Israeli conflict. RoanokeVirginia (talk) 11:16, 11 May 2021 (UTC)\n\nArabs[edit]\nArabs (edit | talk | history | links | watch | logs)\nIndefinite extended confirmed protection: Arbitration enforcement – Per Wikipedia:Arbitration/Requests/Case/Palestine-Israel_articles_4#ARBPIA_General_Sanctions, pre-emptive 500/30 protection is applied on all articles broadly related to the Arab-Israeli conflict. The reason is because the Palestinians are Arabs and many of Arabs are lived in Israel. 182.1.0.135 (talk) 11:20, 11 May 2021 (UTC)\n\n Note: Arabs does not appear to refer to the Arab-Israeli conflict in any way and would seem to fall outside arbitration remedies. Malcolmxl5 (talk) 13:43, 11 May 2021 (UTC)\nHajj[edit]\nHajj (edit | talk | history | links | watch | logs)\nExample (edit | talk | history | links | watch | logs)\nExample (edit | talk | history | links | watch | logs)\nExample (edit | talk | history | links | watch | logs)\nIndefinite extended confirmed protection: Arbitration enforcement – Per Wikipedia:Arbitration/Requests/Case/Palestine-Israel_articles_4#ARBPIA_General_Sanctions, pre-emptive 500/30 protection is applied on all articles broadly related to the Arab-Israeli conflict. I believe that hajj, Kaaba, and Five Pillars of Islam and many more relates to one side of the topic (Arab). 182.1.0.135 (talk) 11:20, 11 May 2021 (UTC)\n\n Note: I am doubtful that Hajj is related to the Arab-Israeli conflict. Where is the conflict? Malcolmxl5 (talk) 13:37, 11 May 2021 (UTC)\nRobert Buckland[edit]\nRobert Buckland (edit | talk | history | links | watch | logs)\nTemporary semi-protection: BLP policy violations – Recent target of multiple unsourced/trolling edits by two anon-IPs (likely the same person). BastunĖġáḍβáś₮ŭŃ! 12:14, 11 May 2021 (UTC)\n\nAutomated comment: One or more pages in this request appear to already be protected. Please confirm.—cyberbot ITalk to my owner:Online 14:54, 11 May 2021 (UTC)\nPersecution[edit]\nPersecution (edit | talk | history | links | watch | logs)\nTemporary EC protection: Persistent addition of the same unsourced material by IPs from three different ranges, and most recently by an account created 6 May 2021 who has posted on two of their WP:TPs. The history of the addition goes back to the beginning of 2021, and probably earlier. I'm at WP:3RR. Narky Blert (talk) 12:55, 11 May 2021 (UTC)\n\nMore easily handled with blocking; added to my watchlist, gave user final warning. OhNoitsJamie Talk 15:01, 11 May 2021 (UTC)\n@Ohnoitsjamie: Thanks! Narky Blert (talk) 16:09, 11 May 2021 (UTC)\nGearspace[edit]\nGearspace (edit | talk | history | links | watch | logs)\nSome kind of temporary edit protection if possible - an anonymous user keeps editing this page to include references to a court case it seems they were involved in (username \"Moppat O'Smitty\" seems very similar to the person mentioned in said court case). The information seems biased and largely not relevant to the subject matter. Advice appreciated. — Preceding unsigned comment added by Mhatma (talk • contribs) 13:22, 11 May 2021 (UTC)\n\nJohn McGuirk[edit]\nJohn McGuirk (edit | talk | history | links | watch | logs)\nTemporary semi-protection: Persistent disruptive editing – Persistent reverts of referenced content by IPs. BastunĖġáḍβáś₮ŭŃ! 13:24, 11 May 2021 (UTC)\n\nSomebody's Watching Me[edit]\nSomebody's Watching Me (edit | talk | history | links | watch | logs)\nSemi-protection: Persistent addition of badly sourced content by IP adresses. Synthwave.94 (talk) 14:42, 11 May 2021 (UTC)\n\nMacaron[edit]\nMacaron (edit | talk | history | links | watch | logs)\nTemporary protection: Persistent vandalism. Serols (talk) 14:56, 11 May 2021 (UTC)\n\nBulgaria national football team[edit]\nBulgaria national football team (edit | talk | history | links | watch | logs)\nTemporary semi-protection: Persistent vandalism. (CC) Tbhotch™ 14:58, 11 May 2021 (UTC)\n\nUser:Jay[edit]\nUser:Jay (edit | talk | history | links | watch | logs)\nIndefinite semi-protection: Persistent vandalism. -- dylx 15:12, 11 May 2021 (UTC)\n\n(non-admin comment) Dylx, did you even see when the edits were made? Also, I believe an edit filter prevents new users from editing others' user pages.  JavaHurricane 15:26, 11 May 2021 (UTC)\nYes, I saw when the edits were made. What concerned me was how long they were able to stay on the page with no action taken against them. -- dylx 15:38, 11 May 2021 (UTC)\nAmong Us[edit]\nAmong Us (edit | talk | history | links | watch | logs)\nIndefinite semi-protection: Persistent vandalism – Article history is persistent with vandalism primarily from newer users and IP's which hasn't had any page protection. SuperSkaterDude45 (talk) 15:13, 11 May 2021 (UTC)\n\nGavin McInnes[edit]\nGavin McInnes (edit | talk | history | links | watch | logs)\nextended protection: High level of IP vandalism. Caustic3 (talk) 15:27, 11 May 2021 (UTC)\n\nDominic Fike[edit]\nDominic Fike (edit | talk | history | links | watch | logs)\nTemporary semi-protection: BLP policy violations. (CC) Tbhotch™ 15:40, 11 May 2021 (UTC)\n\nAymeric Laporte[edit]\nAymeric Laporte (edit | talk | history | links | watch | logs)\nTemporary semi-protection: BLP policy violations – The subject is in the news because of reports that he will change his nationality. This is not official yet but IP editors are jumping the gun. Ytoyoda (talk) 15:40, 11 May 2021 (UTC)\n\nAutomated comment: One or more pages in this request appear to already be protected. Please confirm.—cyberbot ITalk to my owner:Online 16:10, 11 May 2021 (UTC)\n Already protected by administrator Ohnoitsjamie. Favonian (talk) 16:59, 11 May 2021 (UTC)\nTeenNick[edit]\nTeenNick (edit | talk | history | links | watch | logs)\nTemporary semi-protection: Content Dispute/Edit Warring.  kpgamingz (rant me) 15:47, 11 May 2021 (UTC)\n\nAzam Khan (politician)[edit]\nAzam Khan (politician) (edit | talk | history | links | watch | logs)\nSemi-protection: Vandalism, plus unsourced assertions that he has died. Khan is apparently in hospital with COVID 19, but I can't find any RS for death. AndyTheGrump (talk) 15:56, 11 May 2021 (UTC)\n\nLegality of bestiality by country or territory[edit]\nLegality of bestiality by country or territory (edit | talk | history | links | watch | logs)\nSemi-protection: The article has still been getting disruptive editing from anonymous users and newly registered users with no other edits. It was briefly protected in April, but since the protection ended the disruptive edits have returned. I don't know if its possible for the protection to be longer or permanent so only established users can edit it? Delderd (talk) 16:10, 11 May 2021 (UTC)\n\nKarim Khan Zand[edit]\nKarim Khan Zand (edit | talk | history | links | watch | logs)\nSemi-protection: Persistent disruptive editing – Article has a long history of ethno-nationalistic disruption and that's not gonna change anytime soon. HistoryofIran (talk) 16:37, 11 May 2021 (UTC)\n\nKimiya Hosseini[edit]\nKimiya Hosseini (edit | talk | history | links | watch | logs)\nSemi-protection: Persistent disruptive editing – This article has recently been the subject of a high volume of all types of disruptive editing by both anonymous and registered users, ranging from unsourced edits to blatant vandalism, to requests for speedy deletion as db-hoax.  The db-hoax template has been removed until we can sort this out.  Needs whatever level of page protection the admins deem appropriate until then.  Thank you, Johnnie Bob (talk) 16:44, 11 May 2021 (UTC)\n\nTalk:Xinjiang internment camps[edit]\nTalk:Xinjiang internment camps (edit | subject | history | links | watch | logs)\nIndefinite semi-protection: I believe that this article is at risk of vandalism in the future and I suggest using Generic semi-protection as a prophylactic measure against it. Like the Taiwan article, where there was controversy on its place as a country, this article is at risk to vandalism from the same or a similar group of vandals that has already made it's risk and existence known in the Taiwan edit war. JazzClam (talk) 16:45, 11 May 2021 (UTC)\nI apologize, please ignore this request, as i thought it was for the main page, not the talk page.JazzClam (talk) 16:46, 11 May 2021 (UTC)\n\n Withdrawn by requestor Malcolmxl5 (talk) 17:31, 11 May 2021 (UTC)\nTinga Tinga Tales[edit]\nTinga Tinga Tales (edit | talk | history | links | watch | logs)\nTemporary extended confirmed protection: Persistent sockpuppetry – Persistent sockpuppetry, the latest is EighteenFan2021. AussieLegend (✉) 16:49, 11 May 2021 (UTC)\n\nAutomated comment: A request for protection/unprotection for one or more pages in this request was recently made, and was denied at some point within the last 8 days.—cyberbot ITalk to my owner:Online 16:56, 11 May 2021 (UTC)\nFawn Island[edit]\nFawn Island (edit | talk | history | links | watch | logs)\nTemporary extended confirmed protection: Persistent vandalism – Tried to do a semi-protection but there are other accounts vandalizing this article. Seahawks4LifeTALK—CONTRIBS  17:20, 11 May 2021 (UTC)\n\nList_of_Hail_Mary_passes_in_American_football[edit]\nList of Hail Mary passes in American football (edit | talk | history | links | watch | logs)\nPermanent semi-protection: Persistent vandalism – While only on a small scale, regarding just one item, this article has seen multiple bad faith edits by IP addresses in the past five years and should be protected, insofar as only logged-in users should be allowed to edit. The article has been temporarily semi-protected several times already, the last instance ended after a year, a couple of weeks ago, and as soon as the temporary semi-protection expires, the same vandal inserts the same POV again, and always anonymously. He tends to switch his IPs and/or work from IPs which are used by a plurality of people, making a block or permanent block infeasible. It has also proven impossible to discuss with the user to limit the article to 'properly sourced facts-only'.  PJEckenheim (talk) 17:41, 11 May 2021 (UTC)\n\nAnthony Elanga[edit]\nAnthony Elanga (edit | talk | history | links | watch | logs)\nTemporary semi-protection: Persistent addition of unsourced or poorly sourced content. Flix11 (talk) 17:53, 11 May 2021 (UTC)\n\nCurrent requests for reduction in protection level[edit]\nShortcutsWP:RFUPWP:RFPU\nBefore posting, first discuss with the protecting admin at their talk page. Only post below if you receive no (favourable) reply.\nTo find out the username of the admin who protected the page click on \"history\" at the top of the page, then click on \"View logs for this page\" which is under the title of the page. The protecting admin is the username in blue before the words \"protected\", \"changed protection level\" or \"pending changes\". If there are a number of entries on the log page, you might find it easier to select \"Protection log\" or \"Pending changes log\" from the dropdown menu in the blue box.\nRequests to downgrade full protection to template protection on templates and modules can be directed straight here; you do not need to ask the protecting admin first.\nRequests for removing create protection on redlinked articles are generally assisted by having a draft version of the intended article prepared beforehand.\nIf you want to make spelling corrections or add uncontroversial information to a protected page please add {{Edit fully-protected}} to the article's talk page, along with an explanation of what you want to add to the page. If the talk page is protected please use the section below.\nCheck the rolling archive if you cannot find your request. Only recently answered requests are still listed here.\n\nCurrent requests for edits to a protected page[edit]\nShortcutWP:RFED\nIdeally, requests should be made on the article talk page rather than here.\n\nUnless the talk page itself is protected, you may instead add the appropriate template among {{Edit protected}}, {{Edit template-protected}}, {{Edit extended-protected}}, or {{Edit semi-protected}} to the article's talk page if you would like to make a change rather than requesting it here. Doing so will automatically place the page in the appropriate category for the request to be reviewed.\nWhere requests are made due to the editor having a conflict of interest (COI; see Wikipedia:Suggestions for COI compliance), the {{request edit}} template should be used.\nRequests to move move-protected pages should be made at Wikipedia:Requested moves, not here.\nIf the discussion page and the article are both protected preventing you from making an edit request, this page is the right place to make that request. Please see the top of this page for instructions on how to post requests.\nThis page is not for continuing or starting discussions regarding content should both an article and its discussion page be protected. Please make a request only if you have a specific edit you wish to make.\nFurther information: Wikipedia:Edit requests\nCreate a level 3 header with a link to the article in question, then a  {{pagelinks}}  template and then the reason.\n\nHandled requests[edit]\nA rolling archive of the last seven days of protection requests can be found at Wikipedia:Requests for page protection/Rolling archive.\n\n\n\n\n\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Wikipedia:Requests_for_page_protection&oldid=1022648970\"\nCategories: Wikipedia vandalismWikipedia noticeboardsWikipedia requestsWikipedia requests related to adminsHidden categories: Project pages with short descriptionNon-talk pages that are automatically signedWikipedia move-protected project pages\n\n\n\n\n\n\nNavigation menu\n\n\n\nPersonal tools\n\n\nNot logged inTalkContributionsCreate accountLog in\n\n\n\n\n\nNamespaces\n\n\nProject pageTalk\n\n\n\n\n\nVariants\n\n\n\n\n\n\n\n\n\nViews\n\n\nReadEditView history\n\n\n\n\n\nMore\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonate\n\n\n\n\nContribute\n\n\nHelpLearn to editCommunity portalRecent changesUpload file\n\n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationWikidata item\n\n\n\n\nPrint/export\n\n\nDownload as PDFPrintable version\n\n\n\n\nIn other projects\n\n\nMultilingual Wikisource\n\n\n\n\nLanguages\n\n\nالعربيةتۆرکجهবাংলাBosanskiBrezhonegDeutschEspañolفارسیFrançais한국어हिन्दीBahasa IndonesiaItalianoJawaLëtzebuergeschLietuviųBahasa MelayuNederlandsनेपाली日本語Norsk bokmålOccitanPortuguêsRomânăРусскийScotsShqipසිංහලسنڌيSlovenščinaکوردیதமிழ்తెలుగుTürkçeУкраїнськаاردوVènetoTiếng Việt粵語中文\nEdit links\n\n\n\n\n\n\n This page was last edited on 11 May 2021, at 18:08 (UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nMobile view\nDevelopers\nStatistics\nCookie statement\n\n\n\n\n\n\n\n"